{
    "data": [
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "1.00",
            "hadithNumber": "3371",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Wine is the key to all evils",
                    "urn": 1277320,
                    "body": "<p>It was\nnarrated that Abu Darda’ said: ‘My close friend (ﷺ) advised\nme:\n‘Do not drink wine, for it is the key to all evils.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب الْخَمْرُ مِفْتَاحُ كُلِّ شَرٍّ",
                    "urn": 1334970,
                    "body": "<p>حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ، حَدَّثَنَا ابْنُ أَبِي عَدِيٍّ، ح وَحَدَّثَنَا إِبْرَاهِيمُ بْنُ سَعِيدٍ الْجَوْهَرِيُّ، حَدَّثَنَا عَبْدُ الْوَهَّابِ، جَمِيعًا عَنْ رَاشِدٍ أَبِي مُحَمَّدٍ الْحِمَّانِيِّ، عَنْ شَهْرِ بْنِ حَوْشَبٍ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ أَوْصَانِي خَلِيلِي ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَشْرَبِ الْخَمْرَ فَإِنَّهَا مِفْتَاحُ كُلِّ شَرٍّ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "1.00",
            "hadithNumber": "3372",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Wine is the key to all evils",
                    "urn": 1277330,
                    "body": "<p>‘Ubadah\nbin Samit said: “I heard Khabbab bin Arat narrating that the\nMessenger of Allah (ﷺ) said: ‘Beware of wine! For its sins\noverwhelm\nother sins, just as the grapevine overwhelms other trees.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da’if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب الْخَمْرُ مِفْتَاحُ كُلِّ شَرٍّ",
                    "urn": 1334980,
                    "body": "<p>حَدَّثَنَا الْعَبَّاسُ بْنُ عُثْمَانَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا مُنِيرُ بْنُ الزُّبَيْرِ، أَنَّهُ سَمِعَ عُبَادَةَ بْنَ نُسَىٍّ، يَقُولُ سَمِعْتُ خَبَّابَ بْنَ الأَرَتِّ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\"‏ إِيَّاكَ وَالْخَمْرَ فَإِنَّ خَطِيئَتَهَا تَفْرَعُ الْخَطَايَا كَمَا أَنَّ شَجَرَتَهَا تَفْرَعُ الشَّجَرَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "2.00",
            "hadithNumber": "3373",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "2",
                    "chapterTitle": "Whoever drinks wine in this world, he will not drink it in the hereafter",
                    "urn": 1277340,
                    "body": "<p>It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:\n“Whoever drinks wine in this world, he will not drink it in the\nHereafter, unless he repents.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "2",
                    "chapterTitle": "باب مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا لَمْ يَشْرَبْهَا فِي الآخِرَةِ",
                    "urn": 1334990,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا لَمْ يَشْرَبْهَا فِي الآخِرَةِ إِلاَّ أَنْ يَتُوبَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "2.00",
            "hadithNumber": "3374",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "2",
                    "chapterTitle": "Whoever drinks wine in this world, he will not drink it in the hereafter",
                    "urn": 1277350,
                    "body": "<p>Abu\nHurairah narrated that the Messenger of Allah (ﷺ) said:\n“Whoever\ndrinks wine in this world, he will not drink it in the\nHereafter.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "2",
                    "chapterTitle": "باب مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا لَمْ يَشْرَبْهَا فِي الآخِرَةِ",
                    "urn": 1335000,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ حَمْزَةَ، حَدَّثَنِي زَيْدُ بْنُ وَاقِدٍ، أَنَّ خَالِدَ بْنَ عَبْدِ اللَّهِ بْنِ حُسَيْنٍ، حَدَّثَهُ قَالَ حَدَّثَنِي أَبُو هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ شَرِبَ الْخَمْرَ فِي الدُّنْيَا لَمْ يَشْرَبْهَا فِي الآخِرَةِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "3.00",
            "hadithNumber": "3375",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "The one who is addicted to wine",
                    "urn": 1277360,
                    "body": "<p>It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:\n“The one who is addicted to wine is like one who worships\nidols.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب مُدْمِنِ الْخَمْرِ",
                    "urn": 1335010,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ سُلَيْمَانَ بْنِ الأَصْبَهَانِيِّ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مُدْمِنُ الْخَمْرِ كَعَابِدِ وَثَنٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "3.00",
            "hadithNumber": "3376",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "The one who is addicted to wine",
                    "urn": 1277370,
                    "body": "<p>It was\nnarrated from Abu Darda’ that the Prophet (ﷺ) said: “No one\nwho\nis addicted to wine will enter Paradise.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب مُدْمِنِ الْخَمْرِ",
                    "urn": 1335020,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ عُتْبَةَ، حَدَّثَنِي يُونُسُ بْنُ مَيْسَرَةَ بْنِ حَلْبَسٍ، عَنْ أَبِي إِدْرِيسَ، عَنْ أَبِي الدَّرْدَاءِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ لاَ يَدْخُلُ الْجَنَّةَ مُدْمِنُ خَمْرٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "4.00",
            "hadithNumber": "3377",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "4",
                    "chapterTitle": "If a person drinks wine, his prayer will not be accepted",
                    "urn": 1277380,
                    "body": "<p>It was\nnarrated from ‘Abdullah bin ‘Amr that the Messenger of Allah\n(ﷺ) said: “Whoever drinks wine and gets drunk, his prayer will\nnot\nbe accepted for forty days, and if he dies he will enter Hell,\nbut if\nhe repents, Allah will accept his repentance. If he drinks\nwine again\nand gets drunk, his prayer will not be accepted for forty\ndays, and if\nhe dies he will enter Hell, but if he repents, Allah\nwill accept his\nrepentance. If he drinks wine again and gets drunk,\nhis prayer will\nnot be accepted for forty days, and if he dies he\nwill enter Hell, but\nif he repents Allah will accept his repentance.\nBut if he does it\nagain, then Allah will most certainly make him\ndrink of the mire of\nthe puss or sweat on the Day of Resurrection.”\nThey said: “O Messenger\nof Allah, what is the mire of the pus or\nsweat? He said: “The\ndrippings of the people of Hell.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "4",
                    "chapterTitle": "باب مَنْ شَرِبَ الْخَمْرَ لَمْ تُقْبَلْ لَهُ صَلاَةٌ",
                    "urn": 1335030,
                    "body": "<p>حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ رَبِيعَةَ بْنِ يَزِيدَ، عَنِ ابْنِ الدَّيْلَمِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ شَرِبَ الْخَمْرَ وَسَكِرَ لَمْ تُقْبَلْ لَهُ صَلاَةٌ أَرْبَعِينَ صَبَاحًا وَإِنْ مَاتَ دَخَلَ النَّارَ فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ وَإِنْ عَادَ فَشَرِبَ فَسَكِرَ لَمْ تُقْبَلْ لَهُ صَلاَةٌ أَرْبَعِينَ صَبَاحًا فَإِنْ مَاتَ دَخَلَ النَّارَ فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ وَإِنْ عَادَ فَشَرِبَ فَسَكِرَ لَمْ تُقْبَلْ لَهُ صَلاَةٌ أَرْبَعِينَ صَبَاحًا فَإِنْ مَاتَ دَخَلَ النَّارَ فَإِنْ تَابَ تَابَ اللَّهُ عَلَيْهِ وَإِنْ عَادَ كَانَ حَقًّا عَلَى اللَّهِ أَنْ يَسْقِيَهُ مِنْ رَدْغَةِ الْخَبَالِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ وَمَا رَدْغَةُ الْخَبَالِ قَالَ ‏\"‏ عُصَارَةُ أَهْلِ النَّارِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "5.00",
            "hadithNumber": "3378",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "5",
                    "chapterTitle": "What wine is made from",
                    "urn": 1277390,
                    "body": "<p>It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:\n“Wine comes from these two trees: The date palm and the\ngrapevine.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "5",
                    "chapterTitle": "باب مَا يَكُونُ مِنْهُ الْخَمْرُ",
                    "urn": 1335040,
                    "body": "<p>حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ الْيَمَامِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، حَدَّثَنَا أَبُو كَثِيرٍ السُّحَيْمِيُّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ الْخَمْرُ مِنْ هَاتَيْنِ الشَّجَرَتَيْنِ النَّخْلَةِ وَالْعِنَبَةِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "5.00",
            "hadithNumber": "3379",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "5",
                    "chapterTitle": "What wine is made from",
                    "urn": 1277400,
                    "body": "<p>It was\nnarrated from Nu’man bin Bashir that the Messenger of Allah\n(ﷺ)\nsaid: “From wheat comes wine, from barley comes wine, from\nraisins\ncomes wine, from dates comes wine and from honey comes wine.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "5",
                    "chapterTitle": "باب مَا يَكُونُ مِنْهُ الْخَمْرُ",
                    "urn": 1335050,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، أَنَّ خَالِدَ بْنَ كَثِيرٍ الْهَمْدَانِيَّ، حَدَّثَهُ أَنَّ السَّرِيَّ بْنَ إِسْمَاعِيلَ حَدَّثَهُ أَنَّ الشَّعْبِيَّ حَدَّثَهُ أَنَّهُ، سَمِعَ النُّعْمَانَ بْنَ بَشِيرٍ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ مِنَ الْحِنْطَةِ خَمْرًا وَمِنَ الشَّعِيرِ خَمْرًا وَمِنَ الزَّبِيبِ خَمْرًا وَمِنَ التَّمْرِ خَمْرًا وَمِنَ الْعَسَلِ خَمْرًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "6.00",
            "hadithNumber": "3380",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "6",
                    "chapterTitle": "Wine is cursed from ten angles",
                    "urn": 1277410,
                    "body": "<p>It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:\n“Wine is cursed from ten angles: The wine itself, the one who\nsqueezes (the grapes etc), the one for whom it is squeezed, the one\nwho sells it, the one who buys it, the one who carries it, the one to\nwhom it is carried, the one who consumes its price, the one who\ndrinks\nit and the one who pours it.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "6",
                    "chapterTitle": "باب لُعِنَتِ الْخَمْرُ عَلَى عَشَرَةِ أَوْجُهٍ",
                    "urn": 1335060,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، وَمُحَمَّدُ بْنُ إِسْمَاعِيلَ، قَالاَ حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ عُمَرَ بْنِ عَبْدِ الْعَزِيزِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ عَبْدِ اللَّهِ الْغَافِقِيِّ، وَأَبِي، طُعْمَةَ مَوْلاَهُمْ أَنَّهُمَا سَمِعَا ابْنَ عُمَرَ، يَقُولُ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لُعِنَتِ الْخَمْرُ عَلَى عَشَرَةِ أَوْجُهٍ بِعَيْنِهَا وَعَاصِرِهَا وَمُعْتَصِرِهَا وَبَائِعِهَا وَمُبْتَاعِهَا وَحَامِلِهَا وَالْمَحْمُولَةِ إِلَيْهِ وَآكِلِ ثَمَنِهَا وَشَارِبِهَا وَسَاقِيهَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "6.00",
            "hadithNumber": "3381",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "6",
                    "chapterTitle": "Wine is cursed from ten angles",
                    "urn": 1277420,
                    "body": "<p>Anas\nsaid: “The Messenger of Allah (ﷺ) cursed ten with regard to\nwine:\nThe one who squeezes (the grapes etc.), the one who asks for it\nto be\nsqueezed, the one for whom it is squeezed, the one who carries\nit,\nthe one to whom it is carried, the one who sells it, the one for\nwhom\nit is brought, the one who pours it, the one for whom it is\npoured,\nuntil he counted ten like this.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "6",
                    "chapterTitle": "باب لُعِنَتِ الْخَمْرُ عَلَى عَشَرَةِ أَوْجُهٍ",
                    "urn": 1335070,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ سَعِيدِ بْنِ يَزِيدَ بْنِ إِبْرَاهِيمَ التُّسْتَرِيُّ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ شَبِيبٍ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، - أَوْ حَدَّثَنِي أَنَسٌ، - قَالَ لَعَنَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الْخَمْرِ عَشَرَةً عَاصِرَهَا وَمُعْتَصِرَهَا وَالْمَعْصُورَةَ لَهُ وَحَامِلَهَا وَالْمَحْمُولَةَ لَهُ وَبَائِعَهَا وَالْمُبْتَاعَةَ لَهُ وَسَاقِيَهَا وَالْمُسْتَقَاةَ لَهُ ‏\"‏ ‏.‏ حَتَّى عَدَّ عَشَرَةً مِنْ هَذَا الضَّرْبِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "7.00",
            "hadithNumber": "3382",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "7",
                    "chapterTitle": "Dealing in wine",
                    "urn": 1277430,
                    "body": "<p>It was\nnarrated that ‘Aishah said: “When the Verses at the end of\nSurat\nAl-Baqarah concerning usury were revealed, the Messenger of\nAllah(ﷺ) went out and forbade dealing in wine.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "7",
                    "chapterTitle": "باب التِّجَارَةِ فِي الْخَمْرِ",
                    "urn": 1335080,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، حَدَّثَنَا الأَعْمَشُ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، قَالَتْ لَمَّا نَزَلَتِ الآيَاتُ مِنْ آخِرِ سُورَةِ الْبَقَرَةِ فِي الرِّبَا خَرَجَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَحَرَّمَ التِّجَارَةَ فِي الْخَمْرِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "7.00",
            "hadithNumber": "3383",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "7",
                    "chapterTitle": "Dealing in wine",
                    "urn": 1277440,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: Umar heard that Samurah had\nsold\nsome wine, and he said: “May Allah ruin Samurah! Does he not know\nthat the Messenger of Allah (ﷺ) said: ‘May Allah curse the Jews,\nfor\nanimal fat was forbidden to them, so they melted it down and sold\nit.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "7",
                    "chapterTitle": "باب التِّجَارَةِ فِي الْخَمْرِ",
                    "urn": 1335090,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ، عَنْ عَمْرِو بْنِ دِينَارٍ، عَنْ طَاوُسٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ بَلَغَ عُمَرَ أَنَّ سَمُرَةَ، بَاعَ خَمْرًا فَقَالَ قَاتَلَ اللَّهُ سَمُرَةَ أَلَمْ يَعْلَمْ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ لَعَنَ اللَّهُ الْيَهُودَ حُرِّمَتْ عَلَيْهِمُ الشُّحُومُ فَجَمَلُوهَا فَبَاعُوهَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "8.00",
            "hadithNumber": "3384",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "8",
                    "chapterTitle": "They will call wine by other names",
                    "urn": 1277450,
                    "body": "<p>It was\nnarrated from Abu Umamah Al-Bahili that the Messenger of Allah\n(ﷺ)\nsaid: “Night and day will not cease until a group among my\nnation\ndrinks wine, calling it by some other name.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "8",
                    "chapterTitle": "باب الْخَمْرِ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا",
                    "urn": 1335100,
                    "body": "<p>حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، حَدَّثَنَا عَبْدُ السَّلاَمِ بْنُ عَبْدِ الْقُدُّوسِ، حَدَّثَنَا ثَوْرُ بْنُ يَزِيدَ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنْ أَبِي أُمَامَةَ الْبَاهِلِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَذْهَبُ اللَّيَالِي وَالأَيَّامُ حَتَّى تَشْرَبَ طَائِفَةٌ مِنْ أُمَّتِي الْخَمْرَ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "8.00",
            "hadithNumber": "3385",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "8",
                    "chapterTitle": "They will call wine by other names",
                    "urn": 1277460,
                    "body": "<p>It was\nnarrated from ‘Ubadah bin Samit that the Messenger of Allah\n(ﷺ)\nsaid: “People among my nation will drink wine, under some other\nname that they will give it.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "8",
                    "chapterTitle": "باب الْخَمْرِ يُسَمُّونَهَا بِغَيْرِ اسْمِهَا",
                    "urn": 1335110,
                    "body": "<p>حَدَّثَنَا الْحُسَيْنُ بْنُ أَبِي السَّرِيِّ، حَدَّثَنَا عُبَيْدُ اللَّهِ، حَدَّثَنَا سَعْدُ بْنُ أَوْسٍ الْعَبْسِيُّ، عَنْ بِلاَلِ بْنِ يَحْيَى الْعَبْسِيِّ، عَنْ أَبِي بَكْرِ بْنِ حَفْصٍ، عَنِ ابْنِ مُحَيْرِيزٍ، عَنْ ثَابِتِ بْنِ السِّمْطِ، عَنْ عُبَادَةَ بْنِ الصَّامِتِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يَشْرَبُ نَاسٌ مِنْ أُمَّتِي الْخَمْرَ بِاسْمٍ يُسَمُّونَهَا إِيَّاهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "9.00",
            "hadithNumber": "3386",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Every intoxicant is haram",
                    "urn": 1277470,
                    "body": "<p>It was\nnarrated from ‘Aishah, narrating it from the Prophet (ﷺ):\n“Every\ndrink that causes intoxication is unlawful.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب كُلُّ مُسْكِرٍ حَرَامٌ",
                    "urn": 1335120,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ أَبِي سَلَمَةَ، عَنْ عَائِشَةَ، تَبْلُغُ بِهِ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ كُلُّ شَرَابٍ أَسْكَرَ فَهُوَ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "9.00",
            "hadithNumber": "3387",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Every intoxicant is haram",
                    "urn": 1277480,
                    "body": "<p>Salim\nbin ‘Abdullah bin ‘Umar narrated that his father said: “The\nMessenger of Allah (ﷺ) said: ‘Every intoxicant is unlawful.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب كُلُّ مُسْكِرٍ حَرَامٌ",
                    "urn": 1335130,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، حَدَّثَنَا يَحْيَى بْنُ الْحَارِثِ الذِّمَارِيُّ، سَمِعْتُ سَالِمَ بْنَ عَبْدِ اللَّهِ بْنِ عُمَرَ، يُحَدِّثُ عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "9.00",
            "hadithNumber": "3388",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Every intoxicant is haram",
                    "urn": 1277490,
                    "body": "<p>It was\nnarrated from Ibn Mas’ud that the Messenger of Allah (ﷺ)\nsaid:\n“Every intoxicant is unlawful.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب كُلُّ مُسْكِرٍ حَرَامٌ",
                    "urn": 1335140,
                    "body": "<p>حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ وَهْبٍ، أَخْبَرَنَا ابْنُ جُرَيْجٍ، عَنْ أَيُّوبَ بْنِ هَانِئٍ، عَنْ مَسْرُوقٍ، عَنِ ابْنِ مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏ قَالَ ابْنُ مَاجَهْ هَذَا حَدِيثُ الْمِصْرِيِّينَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "9.00",
            "hadithNumber": "3389",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Every intoxicant is haram",
                    "urn": 1277500,
                    "body": "<p>Mu’awiyah said: “I heard the Messenger of Allah (ﷺ) say: ‘Every\nintoxicant is unlawful for every believer.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب كُلُّ مُسْكِرٍ حَرَامٌ",
                    "urn": 1335150,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مَيْمُونٍ الرَّقِّيُّ، حَدَّثَنَا خَالِدُ بْنُ حَيَّانَ، عَنْ سُلَيْمَانَ بْنِ عَبْدِ اللَّهِ بْنِ الزِّبْرِقَانِ، عَنْ يَعْلَى بْنِ شَدَّادِ بْنِ أَوْسٍ، سَمِعْتُ مُعَاوِيَةَ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ عَلَى كُلِّ مُؤْمِنٍ ‏\"‏ ‏.‏ وَهَذَا حَدِيثُ الرَّقِّيِّينَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "9.00",
            "hadithNumber": "3390",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Every intoxicant is haram",
                    "urn": 1277510,
                    "body": "<p>It was\nnarrated from Ibn ‘Umar that the Messenger of Allah (ﷺ)\nsaid:\n“Every intoxicant is Khamr (wine) and every Khamr is unlawful.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب كُلُّ مُسْكِرٍ حَرَامٌ",
                    "urn": 1335160,
                    "body": "<p>حَدَّثَنَا سَهْلٌ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ مُحَمَّدِ بْنِ عَمْرِو بْنِ عَلْقَمَةَ، عَنْ أَبِي سَلَمَةَ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ كُلُّ مُسْكِرٍ خَمْرٌ وَكُلُّ خَمْرٍ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "9.00",
            "hadithNumber": "3391",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Every intoxicant is haram",
                    "urn": 1277520,
                    "body": "<p>It was\nnarrated from Abu Musa that the Messenger of Allah (ﷺ) said:\n“Every\nintoxicant is unlawful.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب كُلُّ مُسْكِرٍ حَرَامٌ",
                    "urn": 1335170,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو دَاوُدَ، حَدَّثَنَا شُعْبَةُ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ، عَنْ أَبِيهِ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "10.00",
            "hadithNumber": "3392",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "10",
                    "chapterTitle": "What causes intoxication in large amounts, a small amount of it is (also) unlawful",
                    "urn": 1277530,
                    "body": "<p>It was\nnarrated from ‘Abdullah bin ‘Umar that the Messenger of Allah\n(ﷺ) said: “Every intoxicant is unlawful and whatever causes\nintoxication in large amounts, a small amount of it is (also)\nunlawful.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "10",
                    "chapterTitle": "باب مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ",
                    "urn": 1335180,
                    "body": "<p>حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا أَبُو يَحْيَى، زَكَرِيَّا بْنُ مَنْظُورٍ عَنْ أَبِي حَازِمٍ، عَنْ عَبْدِ اللَّهِ بْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ وَمَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "10.00",
            "hadithNumber": "3393",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "10",
                    "chapterTitle": "What causes intoxication in large amounts, a small amount of it is (also) unlawful",
                    "urn": 1277540,
                    "body": "<p>It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\nsaid: “Whatever causes intoxication in large amounts, a small\namount of it is (also) unlawful.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "10",
                    "chapterTitle": "باب مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ",
                    "urn": 1335190,
                    "body": "<p>حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنِي دَاوُدُ بْنُ بَكْرٍ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "10.00",
            "hadithNumber": "3394",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "10",
                    "chapterTitle": "What causes intoxication in large amounts, a small amount of it is (also) unlawful",
                    "urn": 1277550,
                    "body": "<p>It was\nnarrated from ‘Amr bin Shu’aib, from his father, from his\ngrandfather, that the Messenger of Allah (ﷺ) said: “Whatever\ncauses\nintoxication in large amounts a small amount of it is (also)\nunlawful.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "10",
                    "chapterTitle": "باب مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ",
                    "urn": 1335200,
                    "body": "<p>حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا أَنَسُ بْنُ عِيَاضٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَا أَسْكَرَ كَثِيرُهُ فَقَلِيلُهُ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "11.00",
            "hadithNumber": "3395",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "11",
                    "chapterTitle": "The prohibition of mixing two fruits",
                    "urn": 1277560,
                    "body": "<p>It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\nforbade making Nabidh* with dates and raisins together, or with\nunripe dates and fresh dates together.”\n</p>\n<p>Another chain reports the same.</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "11",
                    "chapterTitle": "باب النَّهْىِ عَنِ الْخَلِيطَيْنِ",
                    "urn": 1335211,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى أَنْ يُنْبَذَ التَّمْرُ وَالزَّبِيبُ جَمِيعًا وَنَهَى أَنْ يُنْبَذَ الْبُسْرُ وَالرُّطَبُ جَمِيعًا ‏.‏ \n</p>\n<p>قَالَ اللَّيْثُ بْنُ سَعْدٍ حَدَّثَنِي عَطَاءُ بْنُ أَبِي رَبَاحٍ الْمَكِّيُّ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ مِثْلَهُ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "11.00",
            "hadithNumber": "3396",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "11",
                    "chapterTitle": "The prohibition of mixing two fruits",
                    "urn": 1277570,
                    "body": "<p>It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:\n‘Do not make Nabidh with dried dates and unripe dates together,\nmake Nabidh with each of them on its own.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "11",
                    "chapterTitle": "باب النَّهْىِ عَنِ الْخَلِيطَيْنِ",
                    "urn": 1335230,
                    "body": "<p>حَدَّثَنَا يَزِيدُ بْنُ عَبْدِ اللَّهِ الْيَمَامِيُّ، حَدَّثَنَا عِكْرِمَةُ بْنُ عَمَّارٍ، عَنْ أَبِي كَثِيرٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَنْبِذُوا التَّمْرَ وَالْبُسْرَ جَمِيعًا وَانْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "11.00",
            "hadithNumber": "3397",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "11",
                    "chapterTitle": "The prohibition of mixing two fruits",
                    "urn": 1277580,
                    "body": "<p>It was\nnarrated from ‘Abdullah bin Abu Qatadah, from his father, that\nhe\nheard the Messenger of Allah (ﷺ) say: “Do not combine fresh dates\nand unripe dates, or raisins and dates; rather make Nabidh with each\none of them on its own.”*</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "11",
                    "chapterTitle": "باب النَّهْىِ عَنِ الْخَلِيطَيْنِ",
                    "urn": 1335240,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ عَبْدِ اللَّهِ بْنِ أَبِي قَتَادَةَ، عَنْ أَبِيهِ، أَنَّهُ سَمِعَ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ لاَ تَجْمَعُوا بَيْنَ الرُّطَبِ وَالزَّهْوِ وَلاَ بَيْنَ الزَّبِيبِ وَالتَّمْرِ وَانْبِذُوا كُلَّ وَاحِدٍ مِنْهُمَا عَلَى حِدَتِهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "12.00",
            "hadithNumber": "3398",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "12",
                    "chapterTitle": "Description of Nabidh and how it is drunk",
                    "urn": 1277590,
                    "body": "<p>It was\nnarrated that ‘Aishah said: “We used to make Nabidh for the\nMessenger of Allah (ﷺ) in a water skin. We would take a handful of\ndates or a handful of raisins, and put them in it, then pour water\nover it. We would make that in the morning and he would drink it in\nthe\nevening, or we would make it in the evening and he would drink it\nin\nthe morning.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "12",
                    "chapterTitle": "باب صِفَةِ النَّبِيذِ وَشُرْبِهِ",
                    "urn": 1335250,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا عَبْدُ الْوَاحِدِ بْنُ زِيَادٍ، قَالاَ حَدَّثَنَا عَاصِمٌ الأَحْوَلُ، حَدَّثَتْنَا بَنَانَةُ بِنْتُ يَزِيدَ الْعَبْشَمِيَّةُ، عَنْ عَائِشَةَ، قَالَتْ كُنَّا نَنْبِذُ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي سِقَاءٍ فَنَأْخُذُ قَبْضَةً مِنْ تَمْرٍ أَوْ قَبْضَةً مِنْ زَبِيبٍ فَنَطْرَحُهَا فِيهِ ثُمَّ نَصُبُّ عَلَيْهِ الْمَاءَ فَنَنْبِذُهُ غُدْوَةً فَيَشْرَبُهُ عَشِيَّةً وَنَنْبِذُهُ عَشِيَّةً فَيَشْرَبُهُ غُدْوَةً ‏.‏ وَقَالَ أَبُو مُعَاوِيَةَ نَهَارًا فَيَشْرَبُهُ لَيْلاً أَوْ لَيْلاً فَيَشْرَبُهُ نَهَارًا ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "12.00",
            "hadithNumber": "3399",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "12",
                    "chapterTitle": "Description of Nabidh and how it is drunk",
                    "urn": 1277600,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: “Nabidh would be made for the\nMessenger of Allah (ﷺ) and he would drink it on the same day, or\nthe\nnext day, or the third day, and if there was any left he would\nthrow\nit away or give orders that it was to be thrown away.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "12",
                    "chapterTitle": "باب صِفَةِ النَّبِيذِ وَشُرْبِهِ",
                    "urn": 1335260,
                    "body": "<p>حَدَّثَنَا أَبُو كُرَيْبٍ، عَنْ إِسْمَاعِيلَ بْنِ صَبِيحٍ، عَنْ أَبِي إِسْرَائِيلَ، عَنْ أَبِي عُمَرَ الْبَهْرَانِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ يُنْبَذُ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَيَشْرَبُهُ يَوْمَهُ ذَلِكَ وَالْغَدَ وَالْيَوْمَ الثَّالِثَ فَإِنْ بَقِيَ مِنْهُ شَىْءٌ أَهْرَاقَهُ أَوْ أَمَرَ بِهِ فَأُهْرِيقَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "12.00",
            "hadithNumber": "3400",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "12",
                    "chapterTitle": "Description of Nabidh and how it is drunk",
                    "urn": 1277610,
                    "body": "<p>It was\nnarrated that Jabir bin ‘Abdullah said: “Nabidh would be made\nfor\nthe Messenger of Allah (ﷺ) in a vessel of stone.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "12",
                    "chapterTitle": "باب صِفَةِ النَّبِيذِ وَشُرْبِهِ",
                    "urn": 1335270,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ كَانَ يُنْبَذُ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي تَوْرٍ مِنْ حِجَارَةٍ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "13.00",
            "hadithNumber": "3401",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "13",
                    "chapterTitle": "The prohibition of making Nabidh in certain vessels",
                    "urn": 1277620,
                    "body": "<p>It was\nnarrated that Abu Hurairah said: “The Messenger of Allah (ﷺ)\nforbade making Nabidh in Naqir, Muzaffat, Dubba’, and Hantamah. And\nhe\nsaid: ‘Every intoxicant is unlawful.”*</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "13",
                    "chapterTitle": "باب النَّهْىِ عَنْ نَبِيذِ الأَوْعِيَةِ",
                    "urn": 1335280,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، حَدَّثَنَا أَبُو سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُنْبَذَ فِي النَّقِيرِ وَالْمُزَفَّتِ وَالدُّبَّاءِ وَالْحَنْتَمَةِ وَقَالَ ‏\"‏ كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "13.00",
            "hadithNumber": "3402",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "13",
                    "chapterTitle": "The prohibition of making Nabidh in certain vessels",
                    "urn": 1277630,
                    "body": "<p>It was\nnarrated that Ibn ‘Umar said: “The Messenger of Allah (ﷺ)\nforbade making Nabidh in Muzaffat or a gourd.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "13",
                    "chapterTitle": "باب النَّهْىِ عَنْ نَبِيذِ الأَوْعِيَةِ",
                    "urn": 1335290,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُنْبَذَ فِي الْمُزَفَّتِ وَالْقَرْعِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "13.00",
            "hadithNumber": "3403",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "13",
                    "chapterTitle": "The prohibition of making Nabidh in certain vessels",
                    "urn": 1277640,
                    "body": "<p>It was\nnarrated that Abu Sa’eed Al-Khudri said: “The Messenger of\nAllah\n(ﷺ) forbade drinking from Hantam, Dubba’ and Naqir.</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "13",
                    "chapterTitle": "باب النَّهْىِ عَنْ نَبِيذِ الأَوْعِيَةِ",
                    "urn": 1335300,
                    "body": "<p>حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبِي، عَنِ الْمُثَنَّى بْنِ سَعِيدٍ، عَنْ أَبِي الْمُتَوَكِّلِ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الشُّرْبِ فِي الْحَنْتَمِ وَالدُّبَّاءِ وَالنَّقِيرِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "13.00",
            "hadithNumber": "3404",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "13",
                    "chapterTitle": "The prohibition of making Nabidh in certain vessels",
                    "urn": 1277650,
                    "body": "<p>It was\nnarrated that ‘Abdur-Rahman bin Ya’mar said: “The Messenger of\nAllah (ﷺ) forbade Dubba’ and Hantam.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "13",
                    "chapterTitle": "باب النَّهْىِ عَنْ نَبِيذِ الأَوْعِيَةِ",
                    "urn": 1335310,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، وَالْعَبَّاسُ بْنُ عَبْدِ الْعَظِيمِ الْعَنْبَرِيُّ، قَالاَ حَدَّثَنَا شَبَابَةُ، عَنْ شُعْبَةَ، عَنْ بُكَيْرِ بْنِ عَطَاءٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ يَعْمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الدُّبَّاءِ وَالْحَنْتَمِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "14.00",
            "hadithNumber": "3405",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "14",
                    "chapterTitle": "Concessions regarding that",
                    "urn": 1277660,
                    "body": "<p>It was\nnarrated from Ibn Buraidah from his father that the Prophet\n(ﷺ)\nsaid: “I used to forbid you to use certain vessels, but now make\nNabidh in them, but avoid all intoxicants.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "14",
                    "chapterTitle": "باب مَا رُخِّصَ فِيهِ مِنْ ذَلِكَ",
                    "urn": 1335320,
                    "body": "<p>حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ، حَدَّثَنَا إِسْحَاقُ بْنُ يُوسُفَ، عَنْ شَرِيكٍ، عَنْ سِمَاكٍ، عَنِ الْقَاسِمِ بْنِ مُخَيْمِرَةَ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ كُنْتُ نَهَيْتُكُمْ عَنِ الأَوْعِيَةِ فَانْتَبِذُوا فِيهِ وَاجْتَنِبُوا كُلَّ مُسْكِرٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "14.00",
            "hadithNumber": "3406",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "14",
                    "chapterTitle": "Concessions regarding that",
                    "urn": 1277670,
                    "body": "<p>It was\nnarrated from Ibn Mas’ud that the Messenger of Allah (ﷺ)\nsaid: “I\nused to forbid you from making Nabidh in certain vessels, but\na\nvessel does not make something unlawful. All intoxicants are\nunlawful.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "14",
                    "chapterTitle": "باب مَا رُخِّصَ فِيهِ مِنْ ذَلِكَ",
                    "urn": 1335330,
                    "body": "<p>حَدَّثَنَا يُونُسُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ وَهْبٍ، أَنْبَأَنَا ابْنُ جُرَيْجٍ، عَنْ أَيُّوبَ بْنِ هَانِئٍ، عَنْ مَسْرُوقِ بْنِ الأَجْدَعِ، عَنِ ابْنِ مَسْعُودٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِنِّي كُنْتُ نَهَيْتُكُمْ عَنْ نَبِيذِ الأَوْعِيَةِ أَلاَ وَإِنَّ وِعَاءً لاَ يُحَرِّمُ شَيْئًا كُلُّ مُسْكِرٍ حَرَامٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "15.00",
            "hadithNumber": "3407",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "15",
                    "chapterTitle": "Nabidh made in (earthenware) jars",
                    "urn": 1277680,
                    "body": "<p>It was\nnarrated that ‘Aishah said: “Is anyone of you incapable of\ntaking\na water skin from the skin of her sacrifice each year?” Then\nshe\nsaid: “The Messenger of Allah (ﷺ) forbade making Nabidh in\n(earthenware) jars, and in such and such, and such and such, except\nfor vinegar.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da’if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "15",
                    "chapterTitle": "باب نَبِيذِ الْجَرِّ",
                    "urn": 1335340,
                    "body": "<p>حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنْ أَبِيهِ، حَدَّثَتْنِي رُمَيْثَةُ، عَنْ عَائِشَةَ، أَنَّهَا قَالَتْ أَتَعْجِزُ إِحْدَاكُنَّ أَنْ تَتَّخِذَ كُلَّ عَامٍ مِنْ جِلْدِ أُضْحِيَّتِهَا سِقَاءً ثُمَّ قَالَتْ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُنْبَذَ فِي الْجَرِّ وَفِي كَذَا وَفِي كَذَا إِلاَّ الْخَلَّ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "15.00",
            "hadithNumber": "3408",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "15",
                    "chapterTitle": "Nabidh made in (earthenware) jars",
                    "urn": 1277690,
                    "body": "<p>It was\nnarrated that Abu Hurairah said: “The Messenger of Allah (ﷺ)\nforbade making Nabidh in (earthenware) jars.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "15",
                    "chapterTitle": "باب نَبِيذِ الْجَرِّ",
                    "urn": 1335350,
                    "body": "<p>حَدَّثَنَا إِسْحَاقُ بْنُ مُوسَى الْخَطْمِيُّ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُنْبَذَ فِي الْجِرَارِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "15.00",
            "hadithNumber": "3409",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "15",
                    "chapterTitle": "Nabidh made in (earthenware) jars",
                    "urn": 1277700,
                    "body": "<p>It was\nnarrated that Abu Hurairah said: “Some Nabidh from an\n(earthenware)\njar was brought to the Messenger of Allah (ﷺ) and it\nwas bubbling.\nHe said: ‘Throw this against the wall, for this is the\ndrink of one\nwho does not believe in Allah and the Last Day.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "15",
                    "chapterTitle": "باب نَبِيذِ الْجَرِّ",
                    "urn": 1335360,
                    "body": "<p>حَدَّثَنَا مُجَاهِدُ بْنُ مُوسَى، حَدَّثَنَا الْوَلِيدُ، عَنْ صَدَقَةَ أَبِي مُعَاوِيَةَ، عَنْ زَيْدِ بْنِ وَاقِدٍ، عَنْ خَالِدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أُتِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ بِنَبِيذِ جَرٍّ يَنِشُّ فَقَالَ ‏\"‏ اضْرِبْ بِهَذَا الْحَائِطَ فَإِنَّ هَذَا شَرَابُ مَنْ لاَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "16.00",
            "hadithNumber": "3410",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "16",
                    "chapterTitle": "Covering vessels",
                    "urn": 1277710,
                    "body": "<p>It was\nnarrated from Jabir bin ‘Abdullah that the Messenger of Allah\n(ﷺ)\nsaid: “Cover your vessels, tie your water skins, extinguish your\nlamps and lock your doors, for Satan does not untie a water skin,\nopen\na door or uncover a vessel. If a person cannot find anything but\na\nstick with which to cover his vessel and mention the Name of Allah,\nthen let him do so. And the mouse could set fire to the house with\nits\npeople inside.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "16",
                    "chapterTitle": "باب تَخْمِيرِ الإِنَاءِ",
                    "urn": 1335370,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\"‏ غَطُّوا الإِنَاءَ وَأَوْكُوا السِّقَاءَ وَأَطْفِئُوا السِّرَاجَ وَأَغْلِقُوا الْبَابَ فَإِنَّ الشَّيْطَانَ لاَ يَحُلُّ سِقَاءً وَلاَ يَفْتَحُ بَابًا وَلاَ يَكْشِفُ إِنَاءً فَإِنْ لَمْ يَجِدْ أَحَدُكُمْ إِلاَّ أَنْ يَعْرُضَ عَلَى إِنَائِهِ عُودًا وَيَذْكُرَ اسْمَ اللَّهِ فَلْيَفْعَلْ فَإِنَّ الْفُوَيْسِقَةَ تُضْرِمُ عَلَى أَهْلِ الْبَيْتِ بَيْتَهُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "16.00",
            "hadithNumber": "3411",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "16",
                    "chapterTitle": "Covering vessels",
                    "urn": 1277720,
                    "body": "<p>It was\nnarrated that Abu Hurairah said: “The Messenger of Allah (ﷺ)\ncommanded us to cover our vessels, tie up our water skins and turn\nover our vessels.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "16",
                    "chapterTitle": "باب تَخْمِيرِ الإِنَاءِ",
                    "urn": 1335380,
                    "body": "<p>حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ بِتَغْطِيَةِ الإِنَاءِ وَإِيكَاءِ السِّقَاءِ وَإِكْفَاءِ الإِنَاءِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "16.00",
            "hadithNumber": "3412",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "16",
                    "chapterTitle": "Covering vessels",
                    "urn": 1277730,
                    "body": "<p>It was\nnarrated that ‘Aishah said: “I used to prepare three covered\nvessels for the Messenger of Allah (ﷺ) at night: A vessel for his\nwater for purification, a vessel for his tooth stick and a vessel for\nhis drink.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da’if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "16",
                    "chapterTitle": "باب تَخْمِيرِ الإِنَاءِ",
                    "urn": 1335390,
                    "body": "<p>حَدَّثَنَا عِصْمَةُ بْنُ الْفَضْلِ، حَدَّثَنَا حَرَمِيُّ بْنُ عُمَارَةَ بْنِ أَبِي حَفْصَةَ، حَدَّثَنَا حَرِيشُ بْنُ خِرِّيتٍ، أَنْبَأَنَا ابْنُ أَبِي مُلَيْكَةَ، عَنْ عَائِشَةَ، قَالَتْ كُنْتُ أَصْنَعُ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ثَلاَثَةَ آنِيَةٍ مِنَ اللَّيْلِ مُخَمَّرَةً إِنَاءً لِطَهُورِهِ وَإِنَاءً لِسِوَاكِهِ وَإِنَاءً لِشَرَابِهِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "17.00",
            "hadithNumber": "3413",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "17",
                    "chapterTitle": "Drinking from a silver vessel",
                    "urn": 1277740,
                    "body": "<p>It was\nnarrated from Umm Salamah that the Messenger of Allah (ﷺ)\nsaid:\n“The one who drinks from a silver vessel is swallowing Hell-fire\ninto his belly.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "17",
                    "chapterTitle": "باب الشُّرْبِ فِي آنِيَةِ الْفِضَّةِ",
                    "urn": 1335400,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ نَافِعٍ، عَنْ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرٍ، عَنْ أُمِّ سَلَمَةَ، أَنَّهَا أَخْبَرَتْهُ عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِنَّ الَّذِي يَشْرَبُ فِي إِنَاءِ الْفِضَّةِ إِنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "17.00",
            "hadithNumber": "3414",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "17",
                    "chapterTitle": "Drinking from a silver vessel",
                    "urn": 1277750,
                    "body": "<p>It was\nnarrated that Hudhaifah said: “The Messenger of Allah (ﷺ)\nforbade\ndrinking from vessels of gold and silver. He said: “They are\nfor\nthem in this world and for you in the Hereafter.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "17",
                    "chapterTitle": "باب الشُّرْبِ فِي آنِيَةِ الْفِضَّةِ",
                    "urn": 1335410,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْمَلِكِ بْنِ أَبِي الشَّوَارِبِ، حَدَّثَنَا أَبُو عَوَانَةَ، عَنْ أَبِي بِشْرٍ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ حُذَيْفَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الشُّرْبِ فِي آنِيَةِ الذَّهَبِ وَالْفِضَّةِ وَقَالَ ‏\"‏ هِيَ لَهُمْ فِي الدُّنْيَا وَهِيَ لَكُمْ فِي الآخِرَةِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "17.00",
            "hadithNumber": "3415",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "17",
                    "chapterTitle": "Drinking from a silver vessel",
                    "urn": 1277760,
                    "body": "<p>It was\nnarrated from ‘Aishah that the Prophet (ﷺ) said: “Whoever\ndrinks from a silver vessel, it is as if he is swallowing Hell-fire\ninto his belly.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "17",
                    "chapterTitle": "باب الشُّرْبِ فِي آنِيَةِ الْفِضَّةِ",
                    "urn": 1335420,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ، عَنْ نَافِعٍ، عَنِ امْرَأَةِ ابْنِ عُمَرَ، عَنْ عَائِشَةَ، عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ شَرِبَ فِي إِنَاءِ فِضَّةٍ فَكَأَنَّمَا يُجَرْجِرُ فِي بَطْنِهِ نَارَ جَهَنَّمَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "18.00",
            "hadithNumber": "3416",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "18",
                    "chapterTitle": "Drinking in three draughts",
                    "urn": 1277770,
                    "body": "<p>It was\nnarrated from Anas that he used to drink from a vessel in\nthree\ndraughts, and Anas said that the Messenger of Allah (ﷺ) used\nto\ndrink from a vessel in three draughts.</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "18",
                    "chapterTitle": "باب الشُّرْبِ بِثَلاَثَةِ أَنْفَاسٍ",
                    "urn": 1335430,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا ابْنُ مَهْدِيٍّ، حَدَّثَنَا عَزْرَةُ بْنُ ثَابِتٍ الأَنْصَارِيُّ، عَنْ ثُمَامَةَ بْنِ عَبْدِ اللَّهِ، عَنْ أَنَسٍ، أَنَّهُ كَانَ يَتَنَفَّسُ فِي الإِنَاءِ ثَلاَثًا وَزَعَمَ أَنَسٌ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ كَانَ يَتَنَفَّسُ فِي الإِنَاءِ ثَلاَثًا ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "18.00",
            "hadithNumber": "3417",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "18",
                    "chapterTitle": "Drinking in three draughts",
                    "urn": 1277780,
                    "body": "<p>It was\nnarrated from Ibn ‘Abbas that the Prophet (ﷺ) drank, and\ntook two\nbreaths while doing so.</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da’if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "18",
                    "chapterTitle": "باب الشُّرْبِ بِثَلاَثَةِ أَنْفَاسٍ",
                    "urn": 1335440,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَمُحَمَّدُ بْنُ الصَّبَّاحِ، قَالاَ حَدَّثَنَا مَرْوَانُ بْنُ مُعَاوِيَةَ، حَدَّثَنَا رِشْدِينُ بْنُ كُرَيْبٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ شَرِبَ فَتَنَفَّسَ فِيهِ مَرَّتَيْنِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "19.00",
            "hadithNumber": "3418",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "19",
                    "chapterTitle": "Tipping up water skins",
                    "urn": 1277790,
                    "body": "<p>It was\nnarrated that Abu Sa’eed Al-Khudri said: “The Messenger of\nAllah\n(ﷺ) forbade tipping up water skins in order to drink from\ntheir\nmouths.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "19",
                    "chapterTitle": "باب اخْتِنَاثِ الأَسْقِيَةِ",
                    "urn": 1335450,
                    "body": "<p>حَدَّثَنَا أَحْمَدُ بْنُ عَمْرِو بْنِ السَّرْحِ، حَدَّثَنَا ابْنُ وَهْبٍ، عَنْ يُونُسَ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ بْنِ عُتْبَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ اخْتِنَاثِ الأَسْقِيَةِ أَنْ يُشْرَبَ مِنْ أَفْوَاهِهَا ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "19.00",
            "hadithNumber": "3419",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "19",
                    "chapterTitle": "Tipping up water skins",
                    "urn": 1277800,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: “The Messenger of Allah (ﷺ)\nforbade tipping up water skins. After the Messenger of Allah (ﷺ)\nhad\nforbidden that, a man got up at night and tipped up a water skin,\nand\na snake fell out of it onto him.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "19",
                    "chapterTitle": "باب اخْتِنَاثِ الأَسْقِيَةِ",
                    "urn": 1335460,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا أَبُو عَامِرٍ، حَدَّثَنَا زَمْعَةُ بْنُ صَالِحٍ، عَنْ سَلَمَةَ بْنِ وَهْرَامَ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ اخْتِنَاثِ الأَسْقِيَةِ وَإِنَّ رَجُلاً بَعْدَمَا نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ ذَلِكَ قَامَ مِنَ اللَّيْلِ إِلَى سِقَاءٍ فَاخْتَنَثَهُ فَخَرَجَتْ عَلَيْهِ مِنْهُ حَيَّةٌ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "20.00",
            "hadithNumber": "3420",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "20",
                    "chapterTitle": "Drinking from the mouth of a water skin",
                    "urn": 1277810,
                    "body": "<p>It was\nnarrated that Abu Hurairah said: “The Messenger of Allah (ﷺ)\nforbade drinking (directly) from the mouth of a water skin.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "20",
                    "chapterTitle": "باب الشُّرْبِ مِنْ فَمِ السِّقَاءِ",
                    "urn": 1335470,
                    "body": "<p>حَدَّثَنَا بِشْرُ بْنُ هِلاَلٍ الصَّوَّافُ، حَدَّثَنَا عَبْدُ الْوَارِثِ بْنُ سَعِيدٍ، عَنْ أَيُّوبَ، عَنْ عِكْرِمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ الشُّرْبِ مِنْ فِي السِّقَاءِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "20.00",
            "hadithNumber": "3421",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "20",
                    "chapterTitle": "Drinking from the mouth of a water skin",
                    "urn": 1277820,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: “The Messenger of Allah (ﷺ)\nforbade drinking (directly) from the mouth of a water skin.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "20",
                    "chapterTitle": "باب الشُّرْبِ مِنْ فَمِ السِّقَاءِ",
                    "urn": 1335480,
                    "body": "<p>حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، حَدَّثَنَا خَالِدٌ الْحَذَّاءُ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى أَنْ يُشْرَبَ مِنْ فَمِ السِّقَاءِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "21.00",
            "hadithNumber": "3422",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "21",
                    "chapterTitle": "Drinking while standing up",
                    "urn": 1277830,
                    "body": "<p>‘Asim\nnarrated from Sha’bi, from Ibn ‘Abbas who said: “I drew water\nfrom Zamzam for the Prophet (ﷺ) and he drank standing up.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "21",
                    "chapterTitle": "باب الشُّرْبِ قَائِمًا",
                    "urn": 1335490,
                    "body": "<p>حَدَّثَنَا سُوَيْدُ بْنُ سَعِيدٍ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنْ عَاصِمٍ، عَنِ الشَّعْبِيِّ، عَنِ ابْنِ عَبَّاسٍ، قَالَ سَقَيْتُ النَّبِيَّ ـ صلى الله عليه وسلم ـ مِنْ زَمْزَمَ فَشَرِبَ قَائِمًا ‏.‏ فَذَكَرْتُ ذَلِكَ لِعِكْرِمَةَ فَحَلَفَ بِاللَّهِ مَا فَعَلَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "21.00",
            "hadithNumber": "3423",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "21",
                    "chapterTitle": "Drinking while standing up",
                    "urn": 1277840,
                    "body": "<p>It was\nnarrated from ‘Abdur-Rahman bin Abi ‘Amrah, from a grandmother\nof\nhis who was called Kabshah Al-Ansariyyah, that the Messenger of\nAllah\n(ﷺ) entered upon her, and there was a water skin hanging\nthere. He\ndrank from it while standing, and she cut off the mouth of\nthe water\nskin, seeking the blessing of the place where the mouth of\nthe\nMessenger of Allah (ﷺ) had been.</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "21",
                    "chapterTitle": "باب الشُّرْبِ قَائِمًا",
                    "urn": 1335500,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ يَزِيدَ بْنِ يَزِيدَ بْنِ جَابِرٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي عَمْرَةَ، عَنْ جَدَّةٍ، لَهُ يُقَالُ لَهَا كَبْشَةُ الأَنْصَارِيَّةُ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ دَخَلَ عَلَيْهَا وَعِنْدَهَا قِرْبَةٌ مُعَلَّقَةٌ فَشَرِبَ مِنْهَا وَهُوَ قَائِمٌ فَقَطَعَتْ فَمَ الْقِرْبَةِ تَبْتَغِي بَرَكَةَ مَوْضِعِ فِي رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "21.00",
            "hadithNumber": "3424",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "21",
                    "chapterTitle": "Drinking while standing up",
                    "urn": 1277850,
                    "body": "<p>It was\nnarrated from Anas that the Messenger of Allah (ﷺ) forbade\ndrinking\nwhile standing up.</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "21",
                    "chapterTitle": "باب الشُّرْبِ قَائِمًا",
                    "urn": 1335510,
                    "body": "<p>حَدَّثَنَا حُمَيْدُ بْنُ مَسْعَدَةَ، حَدَّثَنَا بِشْرُ بْنُ الْمُفَضَّلِ، حَدَّثَنَا سَعِيدٌ، عَنْ قَتَادَةَ، عَنْ أَنَسٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ نَهَى عَنِ الشُّرْبِ قَائِمًا ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "22.00",
            "hadithNumber": "3425",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "22",
                    "chapterTitle": "When drinking, the (vessel) should be passed around to the right",
                    "urn": 1277860,
                    "body": "<p>It was\nnarrated from Anas bin Malik that the Messenger of Allah (ﷺ)\nwas\nbrought some milk mixed with water. On his right there was a\nBedouin\nand on his left was Abu Bakr. He drank some, then he gave it\nto the\nBedouin and said: “Pass it around to the right.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "22",
                    "chapterTitle": "باب إِذَا شَرِبَ أَعْطَى الأَيْمَنَ فَالأَيْمَنَ",
                    "urn": 1335520,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا مَالِكُ بْنُ أَنَسٍ، عَنِ الزُّهْرِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ أُتِيَ بِلَبَنٍ قَدْ شِيبَ بِمَاءٍ وَعَنْ يَمِينِهِ أَعْرَابِيٌّ وَعَنْ يَسَارِهِ أَبُو بَكْرٍ فَشَرِبَ ثُمَّ أَعْطَى الأَعْرَابِيَّ وَقَالَ ‏\"‏ الأَيْمَنُ فَالأَيْمَنُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "22.00",
            "hadithNumber": "3426",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "22",
                    "chapterTitle": "When drinking, the (vessel) should be passed around to the right",
                    "urn": 1277870,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: “The Messenger of Allah (ﷺ)\nwas\nbrought some milk. On his right was Ibn ‘Abbas and on his left was\nKhalid bin Walid. The Messenger of Allah (ﷺ) said to Ibn ‘Abbas:\n‘Will you permit me to give Khalid to drink?’ Ibn ‘Abbas said:\n‘I\nwould not like to give preference to anyone over myself when it\ncomes\nto the leftover drink of the Messenger of Allah (ﷺ). So Ibn\n‘Abbas\ntook it and drank some, then Khalid drank some.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da’if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "22",
                    "chapterTitle": "باب إِذَا شَرِبَ أَعْطَى الأَيْمَنَ فَالأَيْمَنَ",
                    "urn": 1335530,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنِ ابْنِ شِهَابٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ أُتِيَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِلَبَنٍ وَعَنْ يَمِينِهِ ابْنُ عَبَّاسٍ وَعَنْ يَسَارِهِ خَالِدُ بْنُ الْوَلِيدِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ لاِبْنِ عَبَّاسٍ ‏\"‏ أَتَأْذَنُ لِي أَنْ أَسْقِيَ خَالِدًا ‏\"‏ ‏.‏ قَالَ ابْنُ عَبَّاسٍ مَا أُحِبُّ أَنْ أُوثِرَ بِسُؤْرِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَى نَفْسِي أَحَدًا ‏.‏ فَأَخَذَ ابْنُ عَبَّاسٍ فَشَرِبَ وَشَرِبَ خَالِدٌ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "23.00",
            "hadithNumber": "3427",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "23",
                    "chapterTitle": "Breathing into the vessel",
                    "urn": 1277880,
                    "body": "<p>It was\nnarrated from Abu Hurairah that the Messenger of Allah (ﷺ)\nsaid:\n“When anyone of you drinks, let him not breathe into the vessel.\nIf\nhe wants to continue drinking, let him move the vessel away (in\norder\nto breathe) then bring it back, if he wants.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "23",
                    "chapterTitle": "باب التَّنَفُّسِ فِي الإِنَاءِ",
                    "urn": 1335540,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا دَاوُدُ بْنُ عَبْدِ اللَّهِ، عَنْ عَبْدِ الْعَزِيزِ بْنِ مُحَمَّدٍ، عَنِ الْحَارِثِ بْنِ أَبِي ذُبَابٍ، عَنْ عَمِّهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا شَرِبَ أَحَدُكُمْ فَلاَ يَتَنَفَّسْ فِي الإِنَاءِ فَإِذَا أَرَادَ أَنْ يَعُودَ فَلْيُنَحِّ الإِنَاءَ ثُمَّ لْيَعُدْ إِنْ كَانَ يُرِيدُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "23.00",
            "hadithNumber": "3428",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "23",
                    "chapterTitle": "Breathing into the vessel",
                    "urn": 1277890,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: “The Messenger of Allah (ﷺ)\nforbade breathing into the vessel.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "23",
                    "chapterTitle": "باب التَّنَفُّسِ فِي الإِنَاءِ",
                    "urn": 1335550,
                    "body": "<p>حَدَّثَنَا بَكْرُ بْنُ خَلَفٍ أَبُو بِشْرٍ، حَدَّثَنَا يَزِيدُ بْنُ زُرَيْعٍ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنِ التَّنَفُّسِ فِي الإِنَاءِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "24.00",
            "hadithNumber": "3429",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "24",
                    "chapterTitle": "Blowing into the drink",
                    "urn": 1277900,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: “The Messenger of Allah (ﷺ)\nforbade blowing into the vessel.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "24",
                    "chapterTitle": "باب النَّفْخِ فِي الشَّرَابِ",
                    "urn": 1335560,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ خَلاَّدٍ الْبَاهِلِيُّ، حَدَّثَنَا سُفْيَانُ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يُنْفَخَ فِي الإِنَاءِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "24.00",
            "hadithNumber": "3430",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "24",
                    "chapterTitle": "Blowing into the drink",
                    "urn": 1277910,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: “The Messenger of Allah (ﷺ)\ndid\nnot blow into his drinks.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "24",
                    "chapterTitle": "باب النَّفْخِ فِي الشَّرَابِ",
                    "urn": 1335570,
                    "body": "<p>حَدَّثَنَا أَبُو كُرَيْبٍ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ عَبْدِ الرَّحْمَنِ الْمُحَارِبِيُّ، عَنْ شَرِيكٍ، عَنْ عَبْدِ الْكَرِيمِ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ لَمْ يَكُنْ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَنْفُخُ فِي الشَّرَابِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "25.00",
            "hadithNumber": "3431",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "25",
                    "chapterTitle": "Drinking from one’s hand and lapping up water (like an animal)",
                    "urn": 1277920,
                    "body": "<p>It was\nnarrated from ‘Asim bin Muhammad bin Zaid bin ‘Abdullah, from\nhis\nfather, that his grandfather said: “The Messenger of Allah (ﷺ)\nforbade us to drink while (lying) on our bellies, lapping up water,\nand he forbade us to drink from one hand only. He said: ‘None of\nyou\nshould lap up water as a dog does, and he should not drink water\nfrom\none hand as the people with whom Allah is angry do, and he\nshould not\ndrink from a vessel at night without stirring it first,\nunless the\nvessel was covered. Whoever drinks from his hand when he\nis able to\ndrink from a vessel, with the intention of humility, Allah\nwill record\ngood deeds equivalent to the number of fingers for him.\nIt (i.e., the\nhand) is the vessel of ‘Eisa bin Maryam, (as) when he\nthrew away the\ncup and said: ‘Ugh! That belongs to this world.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da’if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "25",
                    "chapterTitle": "باب الشُّرْبِ بِالأَكُفِّ وَالْكَرْعِ",
                    "urn": 1335580,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ الْمُصَفَّى الْحِمْصِيُّ، حَدَّثَنَا بَقِيَّةُ، عَنْ مُسْلِمِ بْنِ عَبْدِ اللَّهِ، عَنْ زِيَادِ بْنِ عَبْدِ اللَّهِ، عَنْ عَاصِمِ بْنِ مُحَمَّدِ بْنِ زَيْدِ بْنِ عَبْدِ اللَّهِ بْنِ عُمَرَ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ نَهَانَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ نَشْرَبَ عَلَى بُطُونِنَا وَهُوَ الْكَرْعُ وَنَهَانَا أَنْ نَغْتَرِفَ بِالْيَدِ الْوَاحِدَةِ وَقَالَ ‏\"‏ لاَ يَلَغْ أَحَدُكُمْ كَمَا يَلَغُ الْكَلْبُ وَلاَ يَشْرَبْ بِالْيَدِ الْوَاحِدَةِ كَمَا يَشْرَبُ الْقَوْمُ الَّذِينَ سَخِطَ اللَّهُ عَلَيْهِمْ وَلاَ يَشْرَبْ بِاللَّيْلِ مِنْ إِنَاءٍ حَتَّى يُحَرِّكَهُ إِلاَّ أَنْ يَكُونَ إِنَاءً مُخَمَّرًا وَمَنْ شَرِبَ بِيَدِهِ وَهُوَ يَقْدِرُ عَلَى إِنَاءٍ يُرِيدُ التَّوَاضُعَ كَتَبَ اللَّهُ لَهُ بِعَدَدِ أَصَابِعِهِ حَسَنَاتٍ وَهُوَ إِنَاءُ عِيسَى ابْنِ مَرْيَمَ عَلَيْهِمَا السَّلاَمُ إِذْ طَرَحَ الْقَدَحَ فَقَالَ أُفٍّ هَذَا مَعَ الدُّنْيَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "25.00",
            "hadithNumber": "3432",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "25",
                    "chapterTitle": "Drinking from one’s hand and lapping up water (like an animal)",
                    "urn": 1277930,
                    "body": "<p>It was\nnarrated that Jabir bin ‘Abdullah said: “The Messenger of\nAllah\n(ﷺ) entered upon a man among the Ansar when he was watering\nhis\ngarden. The Messenger of Allah (ﷺ) said to him: ‘If you have any\nwater that has been kept overnight in a water skin, then give us some\nto drink, otherwise we will drink by putting out mouths in the\nbasin.’\nHe said: ‘I have water that has been kept in a water\nskin. So he went\nand we went with him, to the shelter, where he\nmilked a sheep for him\nand (mixed it with) the water that had been\nkept overnight in a water\nskin. He drank from it, then he did\nlikewise for his Companion who was\nwith him.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "25",
                    "chapterTitle": "باب الشُّرْبِ بِالأَكُفِّ وَالْكَرْعِ",
                    "urn": 1335590,
                    "body": "<p>حَدَّثَنَا أَحْمَدُ بْنُ مَنْصُورٍ أَبُو بَكْرٍ، حَدَّثَنَا يُونُسُ بْنُ مُحَمَّدٍ، حَدَّثَنَا فُلَيْحُ بْنُ سُلَيْمَانَ، عَنْ سَعِيدِ بْنِ الْحَارِثِ، عَنْ جَابِرِ بْنِ عَبْدِ اللَّهِ، قَالَ دَخَلَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَلَى رَجُلٍ مِنَ الأَنْصَارِ وَهُوَ يُحَوِّلُ الْمَاءَ فِي حَائِطِهِ فَقَالَ لَهُ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنْ كَانَ عِنْدَكَ مَاءٌ بَاتَ فِي شَنٍّ فَاسْقِنَا وَإِلاَّ كَرَعْنَا ‏\"‏ ‏.‏ قَالَ عِنْدِي مَاءٌ بَاتَ فِي شَنٍّ ‏.‏ فَانْطَلَقَ وَانْطَلَقْنَا مَعَهُ إِلَى الْعَرِيشِ فَحَلَبَ لَهُ شَاةً عَلَى مَاءٍ بَاتَ فِي شَنٍّ فَشَرِبَ ثُمَّ فَعَلَ مِثْلَ ذَلِكَ بِصَاحِبِهِ الَّذِي مَعَهُ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "25.00",
            "hadithNumber": "3433",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "25",
                    "chapterTitle": "Drinking from one’s hand and lapping up water (like an animal)",
                    "urn": 1277940,
                    "body": "<p>It was\nnarrated that Ibn ‘Umar said: “We passed by a pond and we\nstarted\nto lap up water from it. The Messenger of Allah (ﷺ) said:\n‘Do not\nlap up the water, rather wash your hands then drink from them,\nfor\nthere is no better vessel than the hand.’”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da’if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "25",
                    "chapterTitle": "باب الشُّرْبِ بِالأَكُفِّ وَالْكَرْعِ",
                    "urn": 1335600,
                    "body": "<p>حَدَّثَنَا وَاصِلُ بْنُ عَبْدِ الأَعْلَى، حَدَّثَنَا ابْنُ فُضَيْلٍ، عَنْ لَيْثٍ، عَنْ سَعِيدِ بْنِ عَامِرٍ، عَنِ ابْنِ عُمَرَ، قَالَ مَرَرْنَا عَلَى بِرْكَةٍ فَجَعَلْنَا نَكْرَعُ فِيهَا فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَكْرَعُوا وَلَكِنِ اغْسِلُوا أَيْدِيَكُمْ ثُمَّ اشْرَبُوا فِيهَا فَإِنَّهُ لَيْسَ إِنَاءٌ أَطْيَبَ مِنَ الْيَدِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "26.00",
            "hadithNumber": "3434",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "26",
                    "chapterTitle": "The one who serves water to others should be the last one to drink from it",
                    "urn": 1277950,
                    "body": "<p>It was\nnarrated from Abu Qatadah that the Messenger of Allah (ﷺ) said:\n“The oen who serves water to others should be the last one to drink\nfrom it.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "26",
                    "chapterTitle": "باب سَاقِي الْقَوْمِ آخِرُهُمْ شُرْبًا",
                    "urn": 1335610,
                    "body": "<p>حَدَّثَنَا أَحْمَدُ بْنُ عَبْدَةَ، وَسُوَيْدُ بْنُ سَعِيدٍ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ زَيْدٍ، عَنْ ثَابِتٍ الْبُنَانِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ رَبَاحٍ، عَنْ أَبِي قَتَادَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ سَاقِي الْقَوْمِ آخِرُهُمْ شُرْبًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "30",
            "chapterId": "27.00",
            "hadithNumber": "3435",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "27",
                    "chapterTitle": "Drinking from a glass",
                    "urn": 1277960,
                    "body": "<p>It was\nnarrated that Ibn ‘Abbas said: “The Messenger of Allah (ﷺ)\nhad\na glass cup from which he would drink.”</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da’if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "27",
                    "chapterTitle": "باب الشُّرْبِ فِي الزُّجَاجِ",
                    "urn": 1335620,
                    "body": "<p>حَدَّثَنَا أَحْمَدُ بْنُ سِنَانٍ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، حَدَّثَنَا مِنْدَلُ بْنُ عَلِيٍّ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَبْدِ اللَّهِ، عَنِ ابْنِ عَبَّاسٍ، قَالَ كَانَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَدَحٌ مِنْ قَوَارِيرَ يَشْرَبُ فِيهِ ‏.‏</p>",
                    "grades": []
                }
            ]
        }
    ],
    "total": 65,
    "limit": 100,
    "previous": null,
    "next": null
}