{
    "data": [
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "1.00",
            "hadithNumber": "3657",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Honoring One's Parents",
                    "urn": 1258020,
                    "body": "<p>Ibn Salamah As-Sulami narrated that the Prophet (ﷺ) said: \"I enjoin each one to honor his mother,I enjoin each one to honor his mother,I enjoin each one to honor his mother(three times), I enjoin each one to honor his guardian who is taking care of him, even if he is causing him some annoyance.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب بِرِّ الْوَالِدَيْنِ",
                    "urn": 1337880,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا شَرِيكُ بْنُ عَبْدِ اللَّهِ، عَنْ مَنْصُورٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ عَلِيٍّ، عَنِ ابْنِ سَلاَمَةَ السُّلَمِيِّ، قَالَ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ أُوصِي امْرَأً بِأُمِّهِ أُوصِي امْرَأً بِأُمِّهِ أُوصِي امْرَأً بِأُمِّهِ - ثَلاَثًا - أُوصِي امْرَأً بِأَبِيهِ أُوصِي امْرَءًا بِمَوْلاَهُ الَّذِي يَلِيهِ وَإِنْ كَانَ عَلَيْهِ مِنْهُ أَذًى يُؤْذِيهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "1.00",
            "hadithNumber": "3658",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Honoring One's Parents",
                    "urn": 1258030,
                    "body": "<p>Abu Hurairah, may Allah be pleased with them, said that:\nAllah's Messenger (ﷺ) said: \"They said: 'O Messenger of Allah, whom should I treat kindly?' He said: 'Your mother.' He said: 'Then who?' He said :'Your mother.\" He said: 'Then who?' He said: 'Your father'. He said : 'Then who?' He said: 'The next closest and the next closest.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب بِرِّ الْوَالِدَيْنِ",
                    "urn": 1337890,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، مُحَمَّدُ بْنُ مَيْمُونٍ الْمَكِّيُّ حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالُوا يَا رَسُولَ اللَّهِ مَنْ أَبَرُّ قَالَ ‏\"‏ أُمَّكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ أُمَّكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ أَبَاكَ ‏\"‏ ‏.‏ قَالَ ثُمَّ مَنْ قَالَ ‏\"‏ الأَدْنَى فَالأَدْنَى ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "1.00",
            "hadithNumber": "3659",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Honoring One's Parents",
                    "urn": 1258040,
                    "body": "<p>Abu Hurairah, may Allah be pleased with them, narrated that:\nAllah's Messenger (ﷺ) said: \"No child can compensate his father unless he finds a slave, and buys him and sets him free.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب بِرِّ الْوَالِدَيْنِ",
                    "urn": 1337900,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ يَجْزِي وَلَدٌ وَالِدَهُ إِلاَّ أَنْ يَجِدَهُ مَمْلُوكًا فَيَشْتَرِيَهُ فَيُعْتِقَهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "1.00",
            "hadithNumber": "3660",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Honoring One's Parents",
                    "urn": 1258050,
                    "body": "<p>Abu Hurairah, may Allah be pleased with them, narrated that:\nAllah's Messenger (ﷺ) said: \"Qintar is twelve thousand 'Uqiyah, each 'Uqiyah of which is better than what is between heaven and earth.\" And the Messenger of Allah(ﷺ) said: \"A man will be raised in status in Paradise and will say: 'Where did this come from?' And it will be said:'From your son's praying for forgiveness for you.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب بِرِّ الْوَالِدَيْنِ",
                    "urn": 1337910,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الصَّمَدِ بْنُ عَبْدِ الْوَارِثِ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ عَاصِمٍ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ الْقِنْطَارُ اثْنَا عَشَرَ أَلْفَ أُوقِيَّةٍ كُلُّ أُوقِيَّةٍ خَيْرٌ مِمَّا بَيْنَ السَّمَاءِ وَالأَرْضِ ‏\"‏ ‏.‏ وَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ الرَّجُلَ لَتُرْفَعُ دَرَجَتُهُ فِي الْجَنَّةِ فَيَقُولُ أَنَّى هَذَا فَيُقَالُ بِاسْتِغْفَارِ وَلَدِكَ لَكَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "1.00",
            "hadithNumber": "3661",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Honoring One's Parents",
                    "urn": 1258060,
                    "body": "<p>Miqdam bin Ma'dikarib, may Allah be pleased with them, narrated that:\nAllah's Messenger (ﷺ) said: \"Allah enjoins you to treat your mother's kindly\"-three times- \"Allah enjoins you to treat your fathers kindly, Allah enjoins you to treat the closest and the next closest kindly.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب بِرِّ الْوَالِدَيْنِ",
                    "urn": 1337920,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ بَحِيرِ بْنِ سَعْدٍ، عَنْ خَالِدِ بْنِ مَعْدَانَ، عَنِ الْمِقْدَامِ بْنِ مَعْدِيكَرِبَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِنَّ اللَّهَ يُوصِيكُمْ بِأُمَّهَاتِكُمْ - ثَلاَثًا - إِنَّ اللَّهَ يُوصِيكُمْ بِآبَائِكُمْ إِنَّ اللَّهَ يُوصِيكُمْ بِالأَقْرَبِ فَالأَقْرَبِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "1.00",
            "hadithNumber": "3662",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Honoring One's Parents",
                    "urn": 1258070,
                    "body": "<p>Abu Umamah narrated that a man said that:\n\"O Allah's Messenger(ﷺ), what are the rights of parents over their child?\" He said:\"They are your Paradise and your Hell.\" (Daif)</p>",
                    "grades": []
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب بِرِّ الْوَالِدَيْنِ",
                    "urn": 1337930,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا صَدَقَةُ بْنُ خَالِدٍ، حَدَّثَنَا عُثْمَانُ بْنُ أَبِي الْعَاتِكَةِ، عَنْ عَلِيِّ بْنِ يَزِيدَ، عَنِ الْقَاسِمِ، عَنْ أَبِي أُمَامَةَ، أَنَّ رَجُلاً، قَالَ يَا رَسُولَ اللَّهِ مَا حَقُّ الْوَالِدَيْنِ عَلَى وَلَدِهِمَا قَالَ ‏\"‏ هُمَا جَنَّتُكَ وَنَارُكَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "1.00",
            "hadithNumber": "3663",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Honoring One's Parents",
                    "urn": 1258080,
                    "body": "<p>Abu Darda' heard the Prophet (ﷺ) say that:\n\"The father is the middle door of Paradise (i.e. the best way to Paradise), so it is up to you whether you take advantage of it or not.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب بِرِّ الْوَالِدَيْنِ",
                    "urn": 1337940,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَطَاءٍ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الدَّرْدَاءِ، سَمِعَ النَّبِيَّ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ الْوَالِدُ أَوْسَطُ أَبْوَابِ الْجَنَّةِ فَأَضِعْ ذَلِكَ الْبَابَ أَوِ احْفَظْهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "2.00",
            "hadithNumber": "3664",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "2",
                    "chapterTitle": "Uphold ties with those whom your father used to uphold ties",
                    "urn": 1258090,
                    "body": "<p>It was narrated that Abu Usaid, Malik bin Rabi'ah, said:\n\"While we were with the Prophet(ﷺ), a man from the Banu Salamah came to him and said: \" O messenger of Allah, is there anyway of honoring my parents that I can still do for them after they die?' He said: \"Yes offering the funeral prayer for them, praying for forgiveness for them, fulfilling their promises after their death, honoring their freinds and upholding the ties of kinship which you would not have were it nor for them.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "2",
                    "chapterTitle": "باب صِلْ مَنْ كَانَ أَبُوكَ يَصِلُ",
                    "urn": 1337950,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سُلَيْمَانَ، عَنْ أَسِيدِ بْنِ عَلِيِّ بْنِ عُبَيْدٍ، مَوْلَى بَنِي سَاعِدَةَ عَنْ أَبِيهِ، عَنْ أَبِي أُسَيْدٍ، مَالِكِ بْنِ رَبِيعَةَ قَالَ بَيْنَمَا نَحْنُ عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ إِذْ جَاءَهُ رَجُلٌ مِنْ بَنِي سُلَيْمٍ فَقَالَ يَا رَسُولَ اللَّهِ أَبَقِيَ مِنْ بِرِّ أَبَوَىَّ شَىْءٌ أَبَرُّهُمَا بِهِ مِنْ بَعْدِ مَوْتِهِمَا قَالَ ‏\"‏ نَعَمْ الصَّلاَةُ عَلَيْهِمَا وَالاِسْتِغْفَارُ لَهُمَا وَإِيفَاءٌ بِعُهُودِهِمَا مِنْ بَعْدِ مَوْتِهِمَا وَإِكْرَامُ صَدِيقِهِمَا وَصِلَةُ الرَّحِمِ الَّتِي لاَ تُوصَلُ إِلاَّ بِهِمَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "3.00",
            "hadithNumber": "3665",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "Honoring one's father and being kind to daughters",
                    "urn": 1258100,
                    "body": "<p>It was narrated that Aisha, said:\n\"Some Bedouin people came to the Prophet(ﷺ) and said: 'Do you kiss your children?' He said: 'Yes'. He said: 'But we, by Allah, never kiss (our children)'. The Prophet(ﷺ) said: 'What can I do if Allah has taken away mercy from you?'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب بِرِّ الْوَالِدِ وَالإِحْسَانِ إِلَى الْبَنَاتِ",
                    "urn": 1337960,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ أَبِيهِ، عَنْ عَائِشَةَ، قَالَتْ قَدِمَ نَاسٌ مِنَ الأَعْرَابِ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالُوا أَتُقَبِّلُونَ صِبْيَانَكُمْ قَالُوا نَعَمْ ‏.‏ فَقَالُوا لَكِنَّا وَاللَّهِ مَا نُقَبِّلُ ‏.‏ فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ وَأَمْلِكُ أَنْ كَانَ اللَّهُ قَدْ نَزَعَ مِنْكُمُ الرَّحْمَةَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "3.00",
            "hadithNumber": "3666",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "Honoring one's father and being kind to daughters",
                    "urn": 1258110,
                    "body": "<p>It was narrated from Ya'la Al -Amir that he said:\n\"Hasan and Hussain came running to the Prophet (ﷺ) and he embraced them and said: 'Children make a man a miser and a coward.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب بِرِّ الْوَالِدِ وَالإِحْسَانِ إِلَى الْبَنَاتِ",
                    "urn": 1337970,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا وُهَيْبٌ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ خُثَيْمٍ، عَنْ سَعِيدِ بْنِ أَبِي رَاشِدٍ، عَنْ يَعْلَى الْعَامِرِيِّ، أَنَّهُ قَالَ جَاءَ الْحَسَنُ وَالْحُسَيْنُ يَسْعَيَانِ إِلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَضَمَّهُمَا إِلَيْهِ وَقَالَ ‏\"‏ إِنَّ الْوَلَدَ مَبْخَلَةٌ مَجْبَنَةٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "3.00",
            "hadithNumber": "3667",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "Honoring one's father and being kind to daughters",
                    "urn": 1258120,
                    "body": "<p>It was narrated from Suraqah bin Malik that the Prophet(ﷺ) said:\n\"Shall I not tell you of the best charity? A daughter who comes back to you and has no other breadwinner apart from you.\" (Daif)</p>",
                    "grades": []
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب بِرِّ الْوَالِدِ وَالإِحْسَانِ إِلَى الْبَنَاتِ",
                    "urn": 1337980,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، عَنْ مُوسَى بْنِ عُلَىٍّ، سَمِعْتُ أَبِي يَذْكُرُ، عَنْ سُرَاقَةَ بْنِ مَالِكٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ أَلاَ أَدُلُّكُمْ عَلَى أَفْضَلِ الصَّدَقَةِ ابْنَتُكَ مَرْدُودَةً إِلَيْكَ لَيْسَ لَهَا كَاسِبٌ غَيْرُكَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "3.00",
            "hadithNumber": "3668",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "Honoring one's father and being kind to daughters",
                    "urn": 1258130,
                    "body": "<p>It was narrated that Sa'sa'ah the paternal uncle of Ahnaf, said:\n\"A woman entered upon Aisha with her two daughters, and she gave her three dates. (The woman) gave each of her daughters a date, then she split the last one between them. She (Aisha) said: 'Then the Prophet(ﷺ) came and I told him about that.' He said:' Why are you surprised? She will enter Paradise because of that.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب بِرِّ الْوَالِدِ وَالإِحْسَانِ إِلَى الْبَنَاتِ",
                    "urn": 1337990,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مِسْعَرٍ، أَخْبَرَنِي سَعْدُ بْنُ إِبْرَاهِيمَ، عَنِ الْحَسَنِ، عَنْ صَعْصَعَةَ، عَمِّ الأَحْنَفِ قَالَ دَخَلَتْ عَلَى عَائِشَةَ امْرَأَةٌ مَعَهَا ابْنَتَانِ لَهَا فَأَعْطَتْهَا ثَلاَثَ تَمَرَاتٍ فَأَعْطَتْ كُلَّ وَاحِدَةٍ مِنْهُمَا تَمْرَةً ثُمَّ صَدَعَتِ الْبَاقِيَةَ بَيْنَهُمَا ‏.‏ قَالَتْ فَأَتَى النَّبِيُّ ـ صلى الله عليه وسلم ـ فَحَدَّثْتُهُ فَقَالَ ‏\"‏ مَا عَجَبُكِ لَقَدْ دَخَلَتْ بِهِ الْجَنَّةَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "3.00",
            "hadithNumber": "3669",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "Honoring one's father and being kind to daughters",
                    "urn": 1258140,
                    "body": "<p>Uqbah bin Amir said, I heard the Messenger of Allah(ﷺ) say:\n\"Whoever has three daughters and is patient towards them, and feeds them, gives them to drink, and clothes them from his wealth; they will be a shield for him from the Fire on the Day of Resurrection.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب بِرِّ الْوَالِدِ وَالإِحْسَانِ إِلَى الْبَنَاتِ",
                    "urn": 1338000,
                    "body": "<p>حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ الْمَرْوَزِيُّ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ حَرْمَلَةَ بْنِ عِمْرَانَ، قَالَ سَمِعْتُ أَبَا عُشَّانَةَ الْمَعَافِرِيَّ، قَالَ سَمِعْتُ عُقْبَةَ بْنَ عَامِرٍ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ مَنْ كَانَ لَهُ ثَلاَثُ بَنَاتٍ فَصَبَرَ عَلَيْهِنَّ وَأَطْعَمَهُنَّ وَسَقَاهُنَّ وَكَسَاهُنَّ مِنْ جِدَتِهِ - كُنَّ لَهُ حِجَابًا مِنَ النَّارِ يَوْمَ الْقِيَامَةِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "3.00",
            "hadithNumber": "3670",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "Honoring one's father and being kind to daughters",
                    "urn": 1258150,
                    "body": "<p>It was narrated from Ibn Abbas that the Messenger of Allah(ﷺ) said:\n\"There is no man whose two daughters reach the age of puberty and he treats them kindly for the time they are together, but they will gain him admittance to Paradise.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب بِرِّ الْوَالِدِ وَالإِحْسَانِ إِلَى الْبَنَاتِ",
                    "urn": 1338010,
                    "body": "<p>حَدَّثَنَا الْحُسَيْنُ بْنُ الْحَسَنِ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ فِطْرٍ، عَنْ أَبِي سَعْدٍ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَا مِنْ رَجُلٍ تُدْرِكُ لَهُ ابْنَتَانِ فَيُحْسِنُ إِلَيْهِمَا مَا صَحِبَتَاهُ أَوْ صَحِبَهُمَا إِلاَّ أَدْخَلَتَاهُ الْجَنَّةَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "3.00",
            "hadithNumber": "3671",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "Honoring one's father and being kind to daughters",
                    "urn": 1258160,
                    "body": "<p>Anas bin Malik narrated that the Messenger of Allah(ﷺ) said:\n\"Be kind to your children, and perfect their manners.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب بِرِّ الْوَالِدِ وَالإِحْسَانِ إِلَى الْبَنَاتِ",
                    "urn": 1338020,
                    "body": "<p>حَدَّثَنَا الْعَبَّاسُ بْنُ الْوَلِيدِ الدِّمَشْقِيُّ، حَدَّثَنَا عَلِيُّ بْنُ عَيَّاشٍ، حَدَّثَنَا سَعِيدُ بْنُ عُمَارَةَ، أَخْبَرَنِي الْحَارِثُ بْنُ النُّعْمَانِ، سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يُحَدِّثُ عَنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ أَنَّهُ قَالَ ‏\"‏ أَكْرِمُوا أَوْلاَدَكُمْ وَأَحْسِنُوا أَدَبَهُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "4.00",
            "hadithNumber": "3672",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "4",
                    "chapterTitle": "The neighbour's rights",
                    "urn": 1258170,
                    "body": "<p>It was narrated from Abu Shuraih Al-Khuzai that the Prophet(ﷺ) said:\n\"Whoever believes in the Last Day, let him treat his neighbour well. Whoever believes in Allah and Last Day, let him honor his guest. Whoever believes in Allah and the Last Day, let him say something good or else remain silent\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "4",
                    "chapterTitle": "باب حَقِّ الْجِوَارِ",
                    "urn": 1338030,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَمْرِو بْنِ دِينَارٍ، سَمِعَ نَافِعَ بْنَ جُبَيْرٍ، يُخْبِرُ عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُحْسِنْ إِلَى جَارِهِ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَمَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيَقُلْ خَيْرًا أَوْ لِيَسْكُتْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "4.00",
            "hadithNumber": "3673",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "4",
                    "chapterTitle": "The neighbour's rights",
                    "urn": 1258180,
                    "body": "<p>Aisha narrated that the Messenger of Allah(ﷺ) said:\n\"Jibra'il kept enjoining good treatment of neighbours untol I thought that he would make neigbours heirs.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "4",
                    "chapterTitle": "باب حَقِّ الْجِوَارِ",
                    "urn": 1338040,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، وَعَبْدَةُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، جَمِيعًا عَنْ يَحْيَى بْنِ سَعِيدٍ، عَنْ أَبِي بَكْرِ بْنِ مُحَمَّدِ بْنِ عَمْرِو بْنِ حَزْمٍ، عَنْ عَمْرَةَ، عَنْ عَائِشَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَا زَالَ جِبْرِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "4.00",
            "hadithNumber": "3674",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "4",
                    "chapterTitle": "The neighbour's rights",
                    "urn": 1258190,
                    "body": "<p>It was narrated from Abu Hurayrah that the Messenger of Allah(ﷺ) said:\n\"Jibra'il kept enjoining good treatment of neighbours until I thought he would make neighbours heirs.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "4",
                    "chapterTitle": "باب حَقِّ الْجِوَارِ",
                    "urn": 1338050,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا يُونُسُ بْنُ أَبِي إِسْحَاقَ، عَنْ مُجَاهِدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَا زَالَ جِبْرَائِيلُ يُوصِينِي بِالْجَارِ حَتَّى ظَنَنْتُ أَنَّهُ سَيُوَرِّثُهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "5.00",
            "hadithNumber": "3675",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "5",
                    "chapterTitle": "The guest's rights",
                    "urn": 1258200,
                    "body": "<p>It was narrated from Abu Shuraih Al-Khuza'i that the Messenger of Allah(ﷺ) said:\n\"Whoever believes in the Last Day, let him honor his guest, and grant him reward for a day and a night. And it is not permissible for him to stay so long that he causes annoyance to his host. Hospitality is for three days, and whatever he spends on him after three days is charity.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "5",
                    "chapterTitle": "باب حَقِّ الضَّيْفِ",
                    "urn": 1338060,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدِ بْنِ أَبِي سَعِيدٍ، عَنْ أَبِي شُرَيْحٍ الْخُزَاعِيِّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ كَانَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَلْيُكْرِمْ ضَيْفَهُ وَجَائِزَتُهُ يَوْمٌ وَلَيْلَةٌ وَلاَ يَحِلُّ لَهُ أَنْ يَثْوِيَ عِنْدَ صَاحِبِهِ حَتَّى يُحْرِجَهُ الضِّيَافَةُ ثَلاَثَةُ أَيَّامٍ وَمَا أَنْفَقَ عَلَيْهِ بَعْدَ ثَلاَثَةِ أَيَّامٍ فَهُوَ صَدَقَةٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "5.00",
            "hadithNumber": "3676",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "5",
                    "chapterTitle": "The guest's rights",
                    "urn": 1258210,
                    "body": "<p>It was narrated that Uqbah bin Amir said:\n\"We said to the Messenger of Allah(ﷺ): ' You send us and we stay with people who do not show us any hospitality. WHat do you think of that?' The MEssenger of Allah (ﷺ) said: 'If you stay with people and they give you what a guest deserves, then accept it. If they do not do that , then take from them what they should have offered, which a guest is entitled to.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "5",
                    "chapterTitle": "باب حَقِّ الضَّيْفِ",
                    "urn": 1338070,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ رُمْحٍ، أَنْبَأَنَا اللَّيْثُ بْنُ سَعْدٍ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ أَبِي الْخَيْرِ، عَنْ عُقْبَةَ بْنِ عَامِرٍ، أَنَّهُ قَالَ قُلْنَا لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِنَّكَ تَبْعَثُنَا فَنَنْزِلُ بِقَوْمٍ فَلاَ يَقْرُونَا فَمَا تَرَى فِي ذَلِكَ ‏.‏ قَالَ لَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنْ نَزَلْتُمْ بِقَوْمٍ فَأَمَرُوا لَكُمْ بِمَا يَنْبَغِي لِلضَّيْفِ فَاقْبَلُوا وَإِنْ لَمْ يَفْعَلُوا فَخُذُوا مِنْهُمْ حَقَّ الضَّيْفِ الَّذِي يَنْبَغِي لَهُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "5.00",
            "hadithNumber": "3677",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "5",
                    "chapterTitle": "The guest's rights",
                    "urn": 1258220,
                    "body": "<p>It was narrated that Miqdam Abu Karimah said:\n\"The Messenger of Allah(ﷺ) said: ' Putting up a guest for one night is obligatory. If you find a guest at your door in the morning, then this (hospitality) is (like) a debt that you (the host) owe him. If he (the guest) wants, he may request it, and if he wants, he may leave it'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "5",
                    "chapterTitle": "باب حَقِّ الضَّيْفِ",
                    "urn": 1338080,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنْ مَنْصُورٍ، عَنِ الشَّعْبِيِّ، عَنِ الْمِقْدَامِ أَبِي كَرِيمَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لَيْلَةُ الضَّيْفِ وَاجِبَةٌ فَإِنْ أَصْبَحَ بِفِنَائِهِ فَهُوَ دَيْنٌ عَلَيْهِ فَإِنْ شَاءَ اقْتَضَى وَإِنْ شَاءَ تَرَكَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "6.00",
            "hadithNumber": "3678",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "6",
                    "chapterTitle": "The orphan's rights",
                    "urn": 1258230,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:\n\"O Allah, bear witness that I have issued a warning concerning (failure to fulfill) the rights of the two weak ones: Orphans and women.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "6",
                    "chapterTitle": "باب حَقِّ الْيَتِيمِ",
                    "urn": 1338090,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ الْقَطَّانُ، عَنِ ابْنِ عَجْلاَنَ، عَنْ سَعِيدِ بْنِ سَعِيدٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اللَّهُمَّ إِنِّي أُحَرِّجُ حَقَّ الضَّعِيفَيْنِ الْيَتِيمِ وَالْمَرْأَةِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "6.00",
            "hadithNumber": "3679",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "6",
                    "chapterTitle": "The orphan's rights",
                    "urn": 1258240,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:\n\"The best house among the Muslims is a house in which there is an orphan who is treated well. And the worst house among the Muslims is a house in which there is an orphan who is treated badly.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "6",
                    "chapterTitle": "باب حَقِّ الْيَتِيمِ",
                    "urn": 1338100,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا ابْنُ الْمُبَارَكِ، عَنْ سَعِيدِ بْنِ أَبِي أَيُّوبَ، عَنْ يَحْيَى بْنِ أَبِي سُلَيْمَانَ، عَنْ زَيْدِ بْنِ أَبِي عَتَّابٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ خَيْرُ بَيْتٍ فِي الْمُسْلِمِينَ بَيْتٌ فِيهِ يَتِيمٌ يُحْسَنُ إِلَيْهِ وَشَرُّ بَيْتٍ فِي الْمُسْلِمِينَ بَيْتٌ فِيهِ يَتِيمٌ يُسَاءُ إِلَيْهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "6.00",
            "hadithNumber": "3680",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "6",
                    "chapterTitle": "The orphan's rights",
                    "urn": 1258250,
                    "body": "<p>It was narrated from `Abdullah bin `Abbas that the Messenger of Allah(ﷺ) said:\n\"Whoever raises three orphans, is like the one who spends his nights in prayer and fasts during the day, and goes out morning and evening drawing his sword in the cause of Allah. In Paradise, he and I will be brothers like these two sisters,'and he held up his forefinger and middle finger together.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "6",
                    "chapterTitle": "باب حَقِّ الْيَتِيمِ",
                    "urn": 1338110,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا حَمَّادُ بْنُ عَبْدِ الرَّحْمَنِ الْكَلْبِيُّ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ إِبْرَاهِيمَ الأَنْصَارِيُّ، عَنْ عَطَاءِ بْنِ أَبِي رَبَاحٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ عَالَ ثَلاَثَةً مِنَ الأَيْتَامِ كَانَ كَمَنْ قَامَ لَيْلَهُ وَصَامَ نَهَارَهُ وَغَدَا وَرَاحَ شَاهِرًا سَيْفَهُ فِي سَبِيلِ اللَّهِ وَكُنْتُ أَنَا وَهُوَ فِي الْجَنَّةِ أَخَوَيْنِ كَهَاتَيْنِ أُخْتَانِ ‏\"‏ ‏.‏ وَأَلْصَقَ إِصْبَعَيْهِ السَّبَّابَةَ وَالْوُسْطَى ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "7.00",
            "hadithNumber": "3681",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "7",
                    "chapterTitle": "Removing a harmful thing from the road",
                    "urn": 1258260,
                    "body": "<p>It was narrated that Abu Barzah Al-Aslami said:\n\"O Messenger of Allah! Tell me of an action by which I may benefit.' He said: 'Remove harmful things from the path of the Muslims.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "7",
                    "chapterTitle": "باب إِمَاطَةِ الأَذَى عَنِ الطَّرِيقِ",
                    "urn": 1338120,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنْ أَبَانَ بْنِ صَمْعَةَ، عَنْ أَبِي الْوَازِعِ الرَّاسِبِيِّ، عَنْ أَبِي بَرْزَةَ الأَسْلَمِيِّ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ دُلَّنِي عَلَى عَمَلٍ أَنْتَفِعُ بِهِ ‏.‏ قَالَ ‏\"‏ اعْزِلِ الأَذَى عَنْ طَرِيقِ الْمُسْلِمِينَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "7.00",
            "hadithNumber": "3682",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "7",
                    "chapterTitle": "Removing a harmful thing from the road",
                    "urn": 1258270,
                    "body": "<p>It was narrated from Abu Hurayrah that the Prophet(ﷺ) said:\n\"There was a branch of a tree that annoyed the people. A man removed it, so he was admitted to Paradise.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "7",
                    "chapterTitle": "باب إِمَاطَةِ الأَذَى عَنِ الطَّرِيقِ",
                    "urn": 1338130,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ كَانَ عَلَى الطَّرِيقِ غُصْنُ شَجَرَةٍ يُؤْذِي النَّاسَ فَأَمَاطَهَا رَجُلٌ فَأُدْخِلَ الْجَنَّةَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "7.00",
            "hadithNumber": "3683",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "7",
                    "chapterTitle": "Removing a harmful thing from the road",
                    "urn": 1258280,
                    "body": "<p>It was narrated from Abu Dharr that the Prophet(ﷺ) said:\n\"My nation was shown to me with their good deeds and bad deeds. Among their good deeds I saw a harmful thing being removed from the road. And among their bad deeds I saw sputum in the mosque that had not been removed.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "7",
                    "chapterTitle": "باب إِمَاطَةِ الأَذَى عَنِ الطَّرِيقِ",
                    "urn": 1338140,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا هِشَامُ بْنُ حَسَّانَ، عَنْ وَاصِلٍ، مَوْلَى أَبِي عُيَيْنَةَ عَنْ يَحْيَى بْنِ عُقَيْلٍ، عَنْ يَحْيَى بْنِ يَعْمَرَ، عَنْ أَبِي ذَرٍّ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ عُرِضَتْ عَلَىَّ أُمَّتِي بِأَعْمَالِهَا حَسَنِهَا وَسَيِّئِهَا فَرَأَيْتُ فِي مَحَاسِنِ أَعْمَالِهَا الأَذَى يُنَحَّى عَنِ الطَّرِيقِ وَرَأَيْتُ فِي سَيِّئِ أَعْمَالِهَا النُّخَاعَةَ فِي الْمَسْجِدِ لاَ تُدْفَنُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "8.00",
            "hadithNumber": "3684",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "8",
                    "chapterTitle": "The Virtue of giving water in charity",
                    "urn": 1258290,
                    "body": "<p>It was narrated that Sad bin Ubadah said:\n\"I said: 'O Messenger of Allah, what charity is best?' He said: 'Giving water to drink.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "8",
                    "chapterTitle": "باب فَضْلِ صَدَقَةِ الْمَاءِ",
                    "urn": 1338150,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامٍ، صَاحِبِ الدَّسْتَوَائِيِّ عَنْ قَتَادَةَ، عَنْ سَعِيدِ بْنِ الْمُسَيَّبِ، عَنْ سَعْدِ بْنِ عُبَادَةَ، قَالَ قُلْتُ يَا رَسُولَ اللَّهِ أَىُّ الصَّدَقَةِ أَفْضَلُ قَالَ ‏\"‏ سَقْىُ الْمَاءِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "8.00",
            "hadithNumber": "3685",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "8",
                    "chapterTitle": "The Virtue of giving water in charity",
                    "urn": 1258300,
                    "body": "<p>It was narrated from Anas bin Malik that the Messenger of Allah(ﷺ) said:\n\"On the Day of Resurrection, people will be lined up in rows, (one of the narrators) Ibn NUmair said: i.e., the people of Paradise, and a man from among the people of Hell will pass by a man (from the people of Paradise) and say: 'O so and so! Do you not remember the day when you asked for water and I gave you water to drink?\" So he will intercede for him. And another man will come and say: \" Do you not remember the day when I gave you water with which to purify yourself?\" and he will intercede for him.\" (In his narration, one of the narrators) Ibn NUmair said: \"And he will remember the day when you sent me to do such and such for you, and I went and did it for you?' and he will intercede for him.\" \"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "8",
                    "chapterTitle": "باب فَضْلِ صَدَقَةِ الْمَاءِ",
                    "urn": 1338160,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ يَزِيدَ الرَّقَاشِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يَصُفُّ النَّاسُ يَوْمَ الْقِيَامَةِ صُفُوفًا - وَقَالَ ابْنُ نُمَيْرٍ أَهْلُ الْجَنَّةِ - فَيَمُرُّ الرَّجُلُ مِنْ أَهْلِ النَّارِ عَلَى الرَّجُلِ فَيَقُولُ يَا فُلاَنُ أَمَا تَذْكُرُ يَوْمَ اسْتَسْقَيْتَ فَسَقَيْتُكَ شَرْبَةً قَالَ فَيَشْفَعُ لَهُ وَيَمُرُّ الرَّجُلُ فَيَقُولُ أَمَا تَذْكُرُ يَوْمَ نَاوَلْتُكَ طَهُورًا فَيَشْفَعُ لَهُ ‏\"‏ ‏.‏ قَالَ ابْنُ نُمَيْرٍ ‏\"‏ وَيَقُولُ يَا فُلاَنُ أَمَا تَذْكُرُ يَوْمَ بَعَثْتَنِي فِي حَاجَةِ كَذَا وَكَذَا فَذَهَبْتُ لَكَ فَيَشْفَعُ لَهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "8.00",
            "hadithNumber": "3686",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "8",
                    "chapterTitle": "The Virtue of giving water in charity",
                    "urn": 1258310,
                    "body": "<p>It was narrated that Suraqah bin Ju'shum said:\n\"I asked the Messenger of Allah(ﷺ) about a lost camel that comes to my cisterns that I have prepared for my own camels - will I be rewarded if I give it some water to drink? He said: Yes, in every living being there is reward.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "8",
                    "chapterTitle": "باب فَضْلِ صَدَقَةِ الْمَاءِ",
                    "urn": 1338170,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ إِسْحَاقَ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ جُعْشُمٍ، عَنْ أَبِيهِ، عَنْ عَمِّهِ، سُرَاقَةَ بْنِ جُعْشُمٍ قَالَ سَأَلْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ ضَالَّةِ الإِبِلِ تَغْشَى حِيَاضِي قَدْ لُطْتُهَا لإِبِلِي فَهَلْ لِي مِنْ أَجْرٍ إِنْ سَقَيْتُهَا فَقَالَ ‏\"‏ نَعَمْ فِي كُلِّ ذَاتِ كَبِدٍ حَرَّى أَجْرٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "9.00",
            "hadithNumber": "3687",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Gentleness",
                    "urn": 1258320,
                    "body": "<p>It was narrated from Jarir bin Abdullah Al-Bajali that the Messenger of Allah(ﷺ) said:\n\"Whoever is deprived of gentleness, he is deprived of goodness.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب الرِّفْقِ",
                    "urn": 1338180,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ تَمِيمِ بْنِ سَلَمَةَ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ هِلاَلٍ الْعَبْسِيِّ، عَنْ جَرِيرِ بْنِ عَبْدِ اللَّهِ الْبَجَلِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ يُحْرَمِ الرِّفْقَ يُحْرَمِ الْخَيْرَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "9.00",
            "hadithNumber": "3688",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Gentleness",
                    "urn": 1258330,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:\n\"Allah is Gentle and loves gentleness, and He grants reward for it that He does not grant for harshness.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب الرِّفْقِ",
                    "urn": 1338190,
                    "body": "<p>حَدَّثَنَا إِسْمَاعِيلُ بْنُ حَفْصٍ الأُبُلِّيُّ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ وَيُعْطِي عَلَيْهِ مَا لاَ يُعْطِي عَلَى الْعُنْفِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "9.00",
            "hadithNumber": "3689",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "9",
                    "chapterTitle": "Gentleness",
                    "urn": 1258340,
                    "body": "<p>It was narrated from Aishah that the Prophet(ﷺ) said:\n\"Allah is Gentle and loves gentleness in all things.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "9",
                    "chapterTitle": "باب الرِّفْقِ",
                    "urn": 1338200,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ، عَنِ الأَوْزَاعِيِّ، ح وَحَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، وَعَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ، قَالاَ حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنِ الزُّهْرِيِّ، عَنْ عُرْوَةَ، عَنْ عَائِشَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِنَّ اللَّهَ رَفِيقٌ يُحِبُّ الرِّفْقَ فِي الأَمْرِ كُلِّهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "10.00",
            "hadithNumber": "3690",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "10",
                    "chapterTitle": "Beneficence Towards Slaves",
                    "urn": 1258350,
                    "body": "<p>It was narrated that Abu Dhar said:\n\"The Messenger of Allah (ﷺ) said: '(Slaves are) your brothers whom Allah has put under your control, so feed them with the same food that you eat, clothe them with the same clothes you wear, and do not burden them with so much that htey are overwhelmed; if you do burden them, then help them.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "10",
                    "chapterTitle": "باب الإِحْسَانِ إِلَى الْمَمَالِيكِ",
                    "urn": 1338210,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا الأَعْمَشُ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِخْوَانُكُمْ جَعَلَهُمُ اللَّهُ تَحْتَ أَيْدِيكُمْ فَأَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ وَأَلْبِسُوهُمْ مِمَّا تَلْبَسُونَ وَلاَ تُكَلِّفُوهُمْ مَا يَغْلِبُهُمْ فَإِنْ كَلَّفْتُمُوهُمْ فَأَعِينُوهُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "10.00",
            "hadithNumber": "3691",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "10",
                    "chapterTitle": "Beneficence Towards Slaves",
                    "urn": 1258360,
                    "body": "<p>It was narrated from Abu Bakr Siddiq(RA) that the Messenger of Allah(ﷺ) said:\n\"No person who mistreats his slave will enter Paradise.\" They said: \" O Messenger of Allah, did you not tell us that this nation will have more slaves and orphans than any other nation?\" He said: \" Yes, so be as kind to them as you are to your own children, and feed them with the same food that you eat.\" They said: \"What will benefit us in this world?\" He said: \"A horse that is kept ready for fighting in the cause of Allah, and your slave to take care of you, and if he performs prayer, then he is your brother(in Islam).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "10",
                    "chapterTitle": "باب الإِحْسَانِ إِلَى الْمَمَالِيكِ",
                    "urn": 1338220,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا إِسْحَاقُ بْنُ سُلَيْمَانَ، عَنْ مُغِيرَةَ بْنِ مُسْلِمٍ، عَنْ فَرْقَدٍ السَّبَخِيِّ، عَنْ مُرَّةَ الطَّيِّبِ، عَنْ أَبِي بَكْرٍ الصِّدِّيقِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ يَدْخُلُ الْجَنَّةَ سَيِّئُ الْمَلَكَةِ ‏\"‏ ‏.‏ قَالُوا يَا رَسُولَ اللَّهِ أَلَيْسَ أَخْبَرْتَنَا أَنَّ هَذِهِ الأُمَّةَ أَكْثَرُ الأُمَمِ مَمْلُوكِينَ وَيَتَامَى قَالَ ‏\"‏ نَعَمْ فَأَكْرِمُوهُمْ كَكَرَامَةِ أَوْلاَدِكُمْ وَأَطْعِمُوهُمْ مِمَّا تَأْكُلُونَ ‏\"‏ ‏.‏ قَالُوا فَمَا يَنْفَعُنَا فِي الدُّنْيَا قَالَ ‏\"‏ فَرَسٌ تَرْتَبِطُهُ تُقَاتِلُ عَلَيْهِ فِي سَبِيلِ اللَّهِ مَمْلُوكُكَ يَكْفِيكَ فَإِذَا صَلَّى فَهُوَ أَخُوكَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "11.00",
            "hadithNumber": "3692",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "11",
                    "chapterTitle": "Spreading (the Greeting of) Peace",
                    "urn": 1258370,
                    "body": "<p>It was narrated from Abu Hurairah(RA) that the Messenger of Allah(ﷺ) said:\n\"By the One in Whose Hand is my soul, you will not enter Paradise until you believe, and you will not believe until you love one another. Shall I not tell you of something which, if you do it, you will love one another? Spread (the greeting of) peace among yourselves.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "11",
                    "chapterTitle": "باب إِفْشَاءِ السَّلاَمِ",
                    "urn": 1338230,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَابْنُ، نُمَيْرٍ عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهُ ـ صلى الله عليه وسلم ـ ‏\"‏ وَالَّذِي نَفْسِي بِيَدِهِ لاَ تَدْخُلُوا الْجَنَّةَ حَتَّى تُؤْمِنُوا وَلاَ تُؤْمِنُوا حَتَّى تَحَابُّوا ‏.‏ أَوَلاَ أَدُلُّكُمْ عَلَى شَىْءٍ إِذَا فَعَلْتُمُوهُ تَحَابَبْتُمْ أَفْشُوا السَّلاَمَ بَيْنَكُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "11.00",
            "hadithNumber": "3693",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "11",
                    "chapterTitle": "Spreading (the Greeting of) Peace",
                    "urn": 1258380,
                    "body": "<p>It was narrated that Abu Umamah said:\n\"Our Prophet(ﷺ) commanded us to spread (the greeting of) peace.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "11",
                    "chapterTitle": "باب إِفْشَاءِ السَّلاَمِ",
                    "urn": 1338240,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَيَّاشٍ، عَنْ مُحَمَّدِ بْنِ زِيَادٍ، عَنْ أَبِي أُمَامَةَ، قَالَ أَمَرَنَا نَبِيُّنَا ـ صلى الله عليه وسلم ـ أَنْ نُفْشِيَ السَّلاَمَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "11.00",
            "hadithNumber": "3694",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "11",
                    "chapterTitle": "Spreading (the Greeting of) Peace",
                    "urn": 1258390,
                    "body": "<p>It was narrated from Abdullah bin 'Amr that the Messenger of Allah(ﷺ) said:\n\"Worship the Most Merciful and spread (the greeting of) peace.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "11",
                    "chapterTitle": "باب إِفْشَاءِ السَّلاَمِ",
                    "urn": 1338250,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ عَطَاءِ بْنِ السَّائِبِ، عَنْ أَبِيهِ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اعْبُدُوا الرَّحْمَنَ وَأَفْشُوا السَّلاَمَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "12.00",
            "hadithNumber": "3695",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "12",
                    "chapterTitle": "Returning (the greeting of) peace",
                    "urn": 1258400,
                    "body": "<p>It was narrated from Abu Hurairah that:\n\"a man entered the masjid, and the Messenger of Allah(ﷺ) was sitting in a corner of the mosque. He prayed, then he came and greeted him with Salam(peace), and he said: 'Wa 'alaikassalm.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "12",
                    "chapterTitle": "باب رَدِّ السَّلاَمِ",
                    "urn": 1338260,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ عُمَرَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي سَعِيدٍ الْمَقْبُرِيُّ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَجُلاً، دَخَلَ الْمَسْجِدَ وَرَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ جَالِسٌ فِي نَاحِيَةِ الْمَسْجِدِ فَصَلَّى ثُمَّ جَاءَ فَسَلَّمَ فَقَالَ ‏\"‏ وَعَلَيْكَ السَّلاَمُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "12.00",
            "hadithNumber": "3696",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "12",
                    "chapterTitle": "Returning (the greeting of) peace",
                    "urn": 1258410,
                    "body": "<p>It was narrated from Abu Salamah that 'Aishah told him that the Messenger of Allah(ﷺ) said to her:\n\"Jibrail send (greetings of) Salam to you.\" She said: \"Wa 'alahisalam wa rahmatullah (and upon him be peace and mercy of Allah).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "12",
                    "chapterTitle": "باب رَدِّ السَّلاَمِ",
                    "urn": 1338270,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ زَكَرِيَّا، عَنِ الشَّعْبِيِّ، عَنْ أَبِي سَلَمَةَ، أَنَّ عَائِشَةَ، حَدَّثَتْهُ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ لَهَا ‏\"‏ إِنَّ جِبْرَائِيلَ يَقْرَأُ عَلَيْكِ السَّلاَمَ ‏\"‏ ‏.‏ قَالَتْ وَعَلَيْهِ السَّلاَمُ وَرَحْمَةُ اللَّهِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "13.00",
            "hadithNumber": "3697",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "13",
                    "chapterTitle": "Returning (the greeting of) peace to Ahludh-Dhimmah(Non Muslim living under the protectio",
                    "urn": 1258420,
                    "body": "<p>It was narrated that Anas bin Malik said \"the Messenger of Allah(ﷺ) said\":\n\"When any of the People of the Book greets you with Salam (peace), then say, Wa 'alaikum(and also upon you).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "13",
                    "chapterTitle": "باب رَدِّ السَّلاَمِ عَلَى أَهْلِ الذِّمَّةِ",
                    "urn": 1338280,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، وَمُحَمَّدُ بْنُ بِشْرٍ، عَنْ سَعِيدٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا سَلَّمَ عَلَيْكُمْ أَحَدٌ مِنْ أَهْلِ الْكِتَابِ فَقُولُوا وَعَلَيْكُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "13.00",
            "hadithNumber": "3698",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "13",
                    "chapterTitle": "Returning (the greeting of) peace to Ahludh-Dhimmah(Non Muslim living under the protectio",
                    "urn": 1258430,
                    "body": "<p>It was narrated from Aishah that some of the Jews came to the Prophet(ﷺ) and said:\n\"Assam o alaika (death be upon you), O Abul-Qasim!\" He said: \"Wa 'alayikum (and also upon you).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "13",
                    "chapterTitle": "باب رَدِّ السَّلاَمِ عَلَى أَهْلِ الذِّمَّةِ",
                    "urn": 1338290,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ مُسْلِمٍ، عَنْ مَسْرُوقٍ، عَنْ عَائِشَةَ، أَنَّهُ أَتَى النَّبِيَّ ـ صلى الله عليه وسلم ـ نَاسٌ مِنَ الْيَهُودِ فَقَالُوا السَّامُ عَلَيْكَ يَا أَبَا الْقَاسِمِ ‏.‏ فَقَالَ ‏\"‏ وَعَلَيْكُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "13.00",
            "hadithNumber": "3699",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "13",
                    "chapterTitle": "Returning (the greeting of) peace to Ahludh-Dhimmah(Non Muslim living under the protectio",
                    "urn": 1258440,
                    "body": "<p>It was narrated from Abu 'Abdur-Rahman Al Juhani that the Messenger of Allah(ﷺ) said:\n\"I am riding to the Jews tomorrow. Do not initiate the greeting with them, and if they greet you, then say: Wa 'alaikum (and also upon you)\".</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "13",
                    "chapterTitle": "باب رَدِّ السَّلاَمِ عَلَى أَهْلِ الذِّمَّةِ",
                    "urn": 1338300,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا ابْنُ نُمَيْرٍ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ يَزِيدَ بْنِ أَبِي حَبِيبٍ، عَنْ مَرْثَدِ بْنِ عَبْدِ اللَّهِ الْيَزَنِيِّ، عَنْ أَبِي عَبْدِ الرَّحْمَنِ الْجُهَنِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنِّي رَاكِبٌ غَدًا إِلَى الْيَهُودِ فَلاَ تَبْدَءُوهُمْ بِالسَّلاَمِ فَإِذَا سَلَّمُوا عَلَيْكُمْ فَقُولُوا وَعَلَيْكُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "14.00",
            "hadithNumber": "3700",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "14",
                    "chapterTitle": "Greeting children and women",
                    "urn": 1258450,
                    "body": "<p>It was narrated that Anas said:\n\"The Messenger of Allah(ﷺ) came to us, and we were young boys, and he greeted us with (the greeting of) peace\".</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "14",
                    "chapterTitle": "باب السَّلاَمِ عَلَى الصِّبْيَانِ وَالنِّسَاءِ",
                    "urn": 1338310,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ أَتَانَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَنَحْنُ صِبْيَانٌ فَسَلَّمَ عَلَيْنَا ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "14.00",
            "hadithNumber": "3701",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "14",
                    "chapterTitle": "Greeting children and women",
                    "urn": 1258460,
                    "body": "<p>Asma bint Yazid said:\n\"The Messenger of Allah(ﷺ) passed by us, among (a group of) women, and he greeted us with (the greeting of) peace.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "14",
                    "chapterTitle": "باب السَّلاَمِ عَلَى الصِّبْيَانِ وَالنِّسَاءِ",
                    "urn": 1338320,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ ابْنِ أَبِي حُسَيْنٍ، سَمِعَهُ مِنْ، شَهْرِ بْنِ حَوْشَبٍ يَقُولُ أَخْبَرَتْهُ أَسْمَاءُ بِنْتُ يَزِيدَ، قَالَتْ مَرَّ عَلَيْنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فِي نِسْوَةٍ فَسَلَّمَ عَلَيْنَا ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "15.00",
            "hadithNumber": "3702",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "15",
                    "chapterTitle": "Shaking hands",
                    "urn": 1258470,
                    "body": "<p>It was narrated that Anas bin Malik said:\n\"O Messenger of Allah! Should we bow to one another?\" He said: \"No.\" We said: \"Should we embrace one another?\" He said: \"No, but shake hands with one another.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "15",
                    "chapterTitle": "باب الْمُصَافَحَةِ",
                    "urn": 1338330,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ جَرِيرِ بْنِ حَازِمٍ، عَنْ حَنْظَلَةَ بْنِ عَبْدِ الرَّحْمَنِ السَّدُوسِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ أَيَنْحَنِي بَعْضُنَا لِبَعْضٍ قَالَ ‏\"‏ لاَ ‏\"‏ ‏.‏ قُلْنَا أَيُعَانِقُ بَعْضُنَا بَعْضًا قَالَ ‏\"‏ لاَ وَلَكِنْ تَصَافَحُوا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "15.00",
            "hadithNumber": "3703",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "15",
                    "chapterTitle": "Shaking hands",
                    "urn": 1258480,
                    "body": "<p>It was narrated from Bara bin Azib that the Messenger of Allah(ﷺ) said:\n\"There are no two Muslims who meet and shake hands, but they will be forgiven before they part.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "15",
                    "chapterTitle": "باب الْمُصَافَحَةِ",
                    "urn": 1338340,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو خَالِدٍ الأَحْمَرُ، وَعَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنِ الأَجْلَحِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الْبَرَاءِ بْنِ عَازِبٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَا مِنْ مُسْلِمَيْنِ يَلْتَقِيَانِ فَيَتَصَافَحَانِ إِلاَّ غُفِرَ لَهُمَا قَبْلَ أَنْ يَتَفَرَّقَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "16.00",
            "hadithNumber": "3704",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "16",
                    "chapterTitle": "A man kissing another man's hand",
                    "urn": 1258490,
                    "body": "<p>It was narrated that Ibn Umar said:\n\"We kissed the hand of the Prophet(ﷺ).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "16",
                    "chapterTitle": "باب الرَّجُلِ يُقَبِّلُ يَدَ الرَّجُلِ",
                    "urn": 1338350,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، حَدَّثَنَا يَزِيدُ بْنُ أَبِي زِيَادٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنِ ابْنِ عُمَرَ، قَالَ قَبَّلْنَا يَدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "16.00",
            "hadithNumber": "3705",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "16",
                    "chapterTitle": "A man kissing another man's hand",
                    "urn": 1258500,
                    "body": "<p>It was narrated from Safwan bin 'Assal that:\n\"Some people among the Jews kissed the hands and feet of the Prophet(ﷺ).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "16",
                    "chapterTitle": "باب الرَّجُلِ يُقَبِّلُ يَدَ الرَّجُلِ",
                    "urn": 1338360,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، وَغُنْدَرٌ، وَأَبُو أُسَامَةَ عَنْ شُعْبَةَ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ عَبْدِ اللَّهِ بْنِ سَلِمَةَ، عَنْ صَفْوَانَ بْنِ عَسَّالٍ، أَنَّ قَوْمًا، مِنَ الْيَهُودِ قَبَّلُوا يَدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَرِجْلَيْهِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "17.00",
            "hadithNumber": "3706",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "17",
                    "chapterTitle": "Seeking Permission to Enter",
                    "urn": 1258510,
                    "body": "<p>It was narrated from Abu Saeed Khudri that Abu Musa asked permission to enter upon 'Umar three times, and he did not give him permission, so he went away.'Umar sent word to him saying:\n\"Why did you go back?\" He said: \"I asked permission to enter three times, as the Messenger of Allah(ﷺ) enjoined upon us, then if we are given permission we should enter, otherwise we should go back.\" He said: \"You should bring me proof of that, or else!\" Then he came to a gathering of his people and asked them to swear by Allah concerning that, and they did so, so he let him go.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "17",
                    "chapterTitle": "باب الاِسْتِئْذَانِ",
                    "urn": 1338370,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا دَاوُدُ بْنُ أَبِي هِنْدٍ، عَنْ أَبِي نَضْرَةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، أَنَّ أَبَا مُوسَى، اسْتَأْذَنَ عَلَى عُمَرَ ثَلاَثًا فَلَمْ يُؤْذَنْ لَهُ فَانْصَرَفَ فَأَرْسَلَ إِلَيْهِ عُمَرُ مَا رَدَّكَ قَالَ اسْتَأْذَنْتُ الاِسْتِئْذَانَ الَّذِي أَمَرَنَا بِهِ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ثَلاَثًا فَإِنْ أُذِنَ لَنَا دَخَلْنَا وَإِنْ لَمْ يُؤْذَنْ لَنَا رَجَعْنَا ‏.‏ قَالَ فَقَالَ لَتَأْتِيَنِّي عَلَى هَذَا بِبَيِّنَةٍ أَوْ لأَفْعَلَنَّ ‏.‏ فَأَتَى مَجْلِسَ قَوْمِهِ فَنَاشَدَهُمْ فَشَهِدُوا لَهُ فَخَلَّى سَبِيلَهُ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "17.00",
            "hadithNumber": "3707",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "17",
                    "chapterTitle": "Seeking Permission to Enter",
                    "urn": 1258520,
                    "body": "<p>It was narrated that Abu Ayyub Ansari said:\n\"We said: 'O Messenger of Allah(ﷺ), (we know) this (greeting of) Salam, but what does seeking permission to enter mean?' He said: 'It means a man saying SubhanAllah, and Allahu Akbar and Al Hamdulillah, and clearing his throat, announcing his arrival to the people in the house.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "17",
                    "chapterTitle": "باب الاِسْتِئْذَانِ",
                    "urn": 1338380,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ وَاصِلِ بْنِ السَّائِبِ، عَنْ أَبِي سَوْرَةَ، عَنْ أَبِي أَيُّوبَ الأَنْصَارِيِّ، قَالَ قُلْنَا يَا رَسُولَ اللَّهِ هَذَا السَّلاَمُ فَمَا الاِسْتِئْنَاسُ قَالَ ‏\"‏ يَتَكَلَّمُ الرَّجُلُ تَسْبِيحَةً وَتَكْبِيرَةً وَتَحْمِيدَةً وَيَتَنَحْنَحُ وَيُؤْذِنُ أَهْلَ الْبَيْتِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "17.00",
            "hadithNumber": "3708",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "17",
                    "chapterTitle": "Seeking Permission to Enter",
                    "urn": 1258530,
                    "body": "<p>It was narrated that Ali said:\n\"I had two times of visiting the Messenger of Allah(ﷺ), at night and during the day. If I came to him when he was praying, he would clear his throat (to let me know he was praying).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "17",
                    "chapterTitle": "باب الاِسْتِئْذَانِ",
                    "urn": 1338390,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ مُغِيرَةَ، عَنِ الْحَارِثِ، عَنْ عَبْدِ اللَّهِ بْنِ نُجَىٍّ، عَنْ عَلِيٍّ، قَالَ كَانَ لِي مِنْ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ مُدْخَلاَنِ مُدْخَلٌ بِاللَّيْلِ وَمُدْخَلٌ بِالنَّهَارِ فَكُنْتُ إِذَا أَتَيْتُهُ وَهُوَ يُصَلِّي يَتَنَحْنَحُ لِي ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "17.00",
            "hadithNumber": "3709",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "17",
                    "chapterTitle": "Seeking Permission to Enter",
                    "urn": 1258540,
                    "body": "<p>It was narrated that Jabir said:\n\"I asked the Prophet(ﷺ) for permission to enter, and he said: 'Who is that?' I said: 'Me'. The Prophet(ﷺ) said \" Me, me?!\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "17",
                    "chapterTitle": "باب الاِسْتِئْذَانِ",
                    "urn": 1338400,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ مُحَمَّدِ بْنِ الْمُنْكَدِرِ، عَنْ جَابِرٍ، قَالَ اسْتَأْذَنْتُ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ مَنْ هَذَا ‏\"‏ ‏.‏ فَقُلْتُ أَنَا فَقَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ أَنَا أَنَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "18.00",
            "hadithNumber": "3710",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "18",
                    "chapterTitle": "If a man is asked how are you this morning?",
                    "urn": 1258550,
                    "body": "<p>It was narrated that Jabir said:\n\"I said: 'How are you this morning, O Messenger of Allah?' He said: 'I am better than one who did not get up fasting, and who did not visit and sick.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "18",
                    "chapterTitle": "باب الرَّجُلِ يُقَالُ لَهُ كَيْفَ أَصْبَحْتَ",
                    "urn": 1338410,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عَبْدِ اللَّهِ بْنِ مُسْلِمٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَابِطٍ، عَنْ جَابِرٍ، قَالَ قُلْتُ كَيْفَ أَصْبَحْتَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ بِخَيْرٍ مِنْ رَجُلٍ لَمْ يُصْبِحْ صَائِمًا وَلَمْ يَعُدْ سَقِيمًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "18.00",
            "hadithNumber": "3711",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "18",
                    "chapterTitle": "If a man is asked how are you this morning?",
                    "urn": 1258560,
                    "body": "<p>It was narrated that Abu Usaid Sa'idi said:\n\"The Messenger of Allah(ﷺ) said to Abbas ibn Abdul Muttalib, when he entered upon them: \"Assalamu alaikum'. They said: 'Wa alaikas salamu wa ahmatullahi wa barakatuhu.' He said: 'How are you this morning?' They said: ' Well, praise is to Allah. And how are you this morning, may our fathers and mothers be ransomed for you, O Messenger of Allah?!' He said: 'I am well, praise is to Allah.'\"(Daif)</p>",
                    "grades": []
                },
                {
                    "lang": "ar",
                    "chapterNumber": "18",
                    "chapterTitle": "باب الرَّجُلِ يُقَالُ لَهُ كَيْفَ أَصْبَحْتَ",
                    "urn": 1338420,
                    "body": "<p>حَدَّثَنَا أَبُو إِسْحَاقَ الْهَرَوِيُّ، إِبْرَاهِيمُ بْنُ عَبْدِ اللَّهِ بْنِ حَاتِمٍ حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُثْمَانَ بْنِ إِسْحَاقَ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، حَدَّثَنِي جَدِّي أَبُو أُمِّي، مَالِكُ بْنُ حَمْزَةَ بْنِ أَبِي أُسَيْدٍ السَّاعِدِيُّ عَنْ أَبِيهِ، عَنْ جَدِّهِ أَبِي أُسَيْدٍ السَّاعِدِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ لِلْعَبَّاسِ بْنِ عَبْدِ الْمُطَّلِبِ وَدَخَلَ عَلَيْهِمْ فَقَالَ ‏\"‏ السَّلاَمُ عَلَيْكُمْ ‏\"‏ ‏.‏ قَالُوا وَعَلَيْكَ السَّلاَمُ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ ‏.‏ قَالَ ‏\"‏ كَيْفَ أَصْبَحْتُمْ ‏\"‏ ‏.‏ قَالُوا بِخَيْرٍ نَحْمَدُ اللَّهَ فَكَيْفَ أَصْبَحْتَ بِأَبِينَا وَأُمِّنَا يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ أَصْبَحْتُ بِخَيْرٍ أَحْمَدُ اللَّهَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "19.00",
            "hadithNumber": "3712",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "19",
                    "chapterTitle": "If a man who is repspected comes to you, then honor him",
                    "urn": 1258570,
                    "body": "<p>It was narrated from Ibn Umar that the Messenger of Allah(ﷺ) said:\n\"If there comes to you a man who is respected among his own people, then honor him.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "19",
                    "chapterTitle": "باب إِذَا أَتَاكُمْ كَرِيمُ قَوْمٍ فَأَكْرِمُوهُ",
                    "urn": 1338430,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا سَعِيدُ بْنُ مَسْلَمَةَ، عَنِ ابْنِ عَجْلاَنَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا أَتَاكُمْ كَرِيمُ قَوْمٍ فَأَكْرِمُوهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "20.00",
            "hadithNumber": "3713",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "20",
                    "chapterTitle": "Replying to one who sneezes",
                    "urn": 1258580,
                    "body": "<p>It was narrated that Anas bin Malik said:\n\"Two men sneezed in he presence of the Prophet(ﷺ) and he replied (said: YarhamukAllah; may Allah have mercy on you') to one and not to the other. It was said: 'O Messenger of Allah(ﷺ), two men sneezed in your presence and you replied to one and not to the other?' He said: \"'This one praised Allah(said Al-Hamdulillah fter sneezing) but that one did not.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "20",
                    "chapterTitle": "باب تَشْمِيتِ الْعَاطِسِ",
                    "urn": 1338440,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ سُلَيْمَانَ التَّيْمِيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ عَطَسَ رَجُلاَنِ عِنْدَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَشَمَّتَ أَحَدَهُمَا - أَوْ سَمَّتَ - وَلَمْ يُشَمِّتِ الآخَرَ فَقِيلَ يَا رَسُولَ اللَّهِ عَطَسَ عِنْدَكَ رَجُلاَنِ فَشَمَّتَّ أَحَدَهُمَا وَلَمْ تُشَمِّتِ الآخَرَ فَقَالَ ‏\"‏ إِنَّ هَذَا حَمِدَ اللَّهَ وَإِنَّ هَذَا لَمْ يَحْمَدِ اللَّهَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "20.00",
            "hadithNumber": "3714",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "20",
                    "chapterTitle": "Replying to one who sneezes",
                    "urn": 1258590,
                    "body": "<p>It was narrated from Ilyas bin Salamah bin Akwa' that his father said:\n\"The Messenger of Allah(ﷺ) said: 'The one who sneezes may be responded to three times; if he sneezes more than that, he has a cold.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "20",
                    "chapterTitle": "باب تَشْمِيتِ الْعَاطِسِ",
                    "urn": 1338450,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ عِكْرِمَةَ بْنِ عَمَّارٍ، عَنْ إِيَاسِ بْنِ سَلَمَةَ بْنِ الأَكْوَعِ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يُشَمَّتُ الْعَاطِسُ ثَلاَثًا فَمَا زَادَ فَهُوَ مَزْكُومٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "20.00",
            "hadithNumber": "3715",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "20",
                    "chapterTitle": "Replying to one who sneezes",
                    "urn": 1258600,
                    "body": "<p>It was narrated from Ali that the Messenger of Allah(ﷺ) said:\n\"If anyone of you sneezes, let him say: Alhamdulillah (praise be to Allah). Those around him should respond by saying: Yarhamkullah (may Allah have mercy on you). And he should respond by saying: \"Yahdikum Allah wa yuslaha balakum (may Allah Guide you and set right your state).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "20",
                    "chapterTitle": "باب تَشْمِيتِ الْعَاطِسِ",
                    "urn": 1338460,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَلِيُّ بْنُ مُسْهِرٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ عِيسَى، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ عَلِيٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا عَطَسَ أَحَدُكُمْ فَلْيَقُلِ الْحَمْدُ لِلَّهِ ‏.‏ وَلْيَرُدَّ عَلَيْهِ مَنْ حَوْلَهُ يَرْحَمُكَ اللَّهُ ‏.‏ وَلْيَرُدَّ عَلَيْهِمْ يَهْدِيكُمُ اللَّهُ وَيُصْلِحُ بَالَكُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "21.00",
            "hadithNumber": "3716",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "21",
                    "chapterTitle": "A man honoring his companion",
                    "urn": 1258610,
                    "body": "<p>It was narrated that Anas bin Malik said:\n\"Whenever the Prophet(ﷺ) met a man, he would speak to him, and would not tun away until he (the other man) was the one who turned away. And if he shook hands with him, he would not withdraw his hand until he (the other man) withdrew his hand. And he was never seen sitting with his knees ahead of the knees of the one who was sitting next to him.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "21",
                    "chapterTitle": "باب إِكْرَامِ الرَّجُلِ جَلِيسَهُ",
                    "urn": 1338470,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ أَبِي يَحْيَى الطَّوِيلِ، - رَجُلٌ مِنْ أَهْلِ الْكُوفَةِ - عَنْ زَيْدٍ الْعَمِّيِّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ إِذَا لَقِيَ الرَّجُلَ فَكَلَّمَهُ لَمْ يَصْرِفْ وَجْهَهُ عَنْهُ حَتَّى يَكُونَ هُوَ الَّذِي يَنْصَرِفُ وَإِذَا صَافَحَهُ لَمْ يَنْزِعْ يَدَهُ مِنْ يَدِهِ حَتَّى يَكُونَ هُوَ الَّذِي يَنْزِعُهَا وَلَمْ يُرَ مُتَقَدِّمًا بِرُكْبَتَيْهِ جَلِيسًا لَهُ قَطُّ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "22.00",
            "hadithNumber": "3717",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "22",
                    "chapterTitle": "Whoever gets up from a spot then comes back, he has more right to it",
                    "urn": 1258620,
                    "body": "<p>It was narrated from Abu Hurairah that the Prophet(ﷺ) said:\n\"When one of you gets up from his spot, then comes back, he has more right to it.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "22",
                    "chapterTitle": "باب مَنْ قَامَ مِنْ مَجْلِسٍ فَرَجَعَ فَهُوَ أَحَقُّ بِهِ",
                    "urn": 1338480,
                    "body": "<p>حَدَّثَنَا عَمْرُو بْنُ رَافِعٍ، حَدَّثَنَا جَرِيرٌ، عَنْ سُهَيْلِ بْنِ أَبِي صَالِحٍ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِذَا قَامَ أَحَدُكُمْ عَنْ مَجْلِسِهِ ثُمَّ رَجَعَ فَهُوَ أَحَقُّ بِهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "23.00",
            "hadithNumber": "3718",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "23",
                    "chapterTitle": "Excuses",
                    "urn": 1258631,
                    "body": "<p>It was narrated from Jawdan that the Messenger of Allah(ﷺ) said:\n\"If a man makes an excuse to his bother and he does not accept it, he will bear a burden of sin like that of the tax-collector.\"\n</p>\n<p>\n<i>A hadith similar to the above has been narrated through a chain differing from the first at the 4th level of narrators.</i></p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if, "
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "23",
                    "chapterTitle": "باب الْمَعَاذِيرِ",
                    "urn": 1338491,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ جُرَيْجٍ، عَنِ ابْنِ مِينَاءَ، عَنْ جَوْدَانَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنِ اعْتَذَرَ إِلَى أَخِيهِ بِمَعْذِرَةٍ فَلَمْ يَقْبَلْهَا كَانَ عَلَيْهِ مِثْلُ خَطِيئَةِ صَاحِبِ مَكْسٍ ‏\"‏ ‏.‏ \n حَدَّثَنَا مُحَمَّدُ بْنُ إِسْمَاعِيلَ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنِ ابْنِ جُرَيْجٍ، عَنِ الْعَبَّاسِ بْنِ عَبْدِ الرَّحْمَنِ، - هُوَ ابْنُ مِينَاءَ - عَنْ جَوْدَانَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ مِثْلَهُ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "24.00",
            "hadithNumber": "3719",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "24",
                    "chapterTitle": "Joking",
                    "urn": 1258640,
                    "body": "<p>It was narrated that Umm Salamah said:\n\"Abu Bakr went out to trade in Busra, one year before the Prophet (ﷺ) died, and with him were Nu`aiman and Suwaibit the sons of Harmalah, who had been present at Badr. Nu`aiman was in charge of the provisions, and Suwaibit was a man who joked a lot. He said to Nu`aiman: 'Feed me'. He said: 'Not until Abu Bakr comes'. He said: 'Then I will have to annoy you'. Then they passed by some people, and Suwaibit said to them: 'Will you buy a slave from me?' They said: 'Yes'. He said 'He is a slave who talks a lot and he will tell you, \"I am a free man\". If you are going to let him go when he says that to you, do not bother buying him.' They said: 'We will buy him from you.' So they bought him from him in return for ten young she-camels, then they brought him and tied a turban or a rope around his neck. Nu`aiman said: 'This man is making fun of you. I am a free man, not a slave.' They said: 'He has already told us about you; and they took him off.' Then Abu Bakr came and he (Suwaibit) told him about that. So he followed those people and returned their camels to them, and took Nu`aiman back. When they came to the Prophet (ﷺ) they told him what had happened, and the Prophet (ﷺ) and his companions laughed about it for a year.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "24",
                    "chapterTitle": "باب الْمِزَاحِ",
                    "urn": 1338510,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا وَكِيعٌ، عَنْ زَمْعَةَ بْنِ صَالِحٍ، عَنِ الزُّهْرِيِّ، عَنْ وَهْبِ بْنِ عَبْدِ بْنِ زَمْعَةَ، عَنْ أُمِّ سَلَمَةَ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، حَدَّثَنَا زَمْعَةُ بْنُ صَالِحٍ، عَنِ الزُّهْرِيِّ، عَنْ عَبْدِ اللَّهِ بْنِ وَهْبِ بْنِ زَمْعَةَ، عَنْ أُمِّ سَلَمَةَ، قَالَتْ خَرَجَ أَبُو بَكْرٍ فِي تِجَارَةٍ إِلَى بُصْرَى قَبْلَ مَوْتِ النَّبِيِّ ـ صلى الله عليه وسلم ـ بِعَامٍ وَمَعَهُ نُعَيْمَانُ وَسُوَيْبِطُ بْنُ حَرْمَلَةَ وَكَانَا شَهِدَا بَدْرًا وَكَانَ نُعَيْمَانُ عَلَى الزَّادِ وَكَانَ سُوَيْبِطٌ رَجُلاً مَزَّاحًا فَقَالَ لِنُعَيْمَانَ أَطْعِمْنِي ‏.‏ قَالَ حَتَّى يَجِيءَ أَبُو بَكْرٍ ‏.‏ قَالَ فَلأُغِيظَنَّكَ ‏.‏ قَالَ فَمَرُّوا بِقَوْمٍ فَقَالَ لَهُمْ سُوَيْبِطٌ تَشْتَرُونَ مِنِّي عَبْدًا لِي قَالُوا نَعَمْ ‏.‏ قَالَ إِنَّهُ عَبْدٌ لَهُ كَلاَمٌ وَهُوَ قَائِلٌ لَكُمْ إِنِّي حُرٌّ ‏.‏ فَإِنْ كُنْتُمْ إِذَا قَالَ لَكُمْ هَذِهِ الْمَقَالَةَ تَرَكْتُمُوهُ فَلاَ تُفْسِدُوا عَلَىَّ عَبْدِي ‏.‏ قَالُوا لاَ بَلْ نَشْتَرِيهِ مِنْكَ ‏.‏ فَاشْتَرَوْهُ مِنْهُ بِعَشْرِ قَلاَئِصَ ثُمَّ أَتَوْهُ فَوَضَعُوا فِي عُنُقِهِ عِمَامَةً أَوْ حَبْلاً ‏.‏ فَقَالَ نُعَيْمَانُ إِنَّ هَذَا يَسْتَهْزِئُ بِكُمْ وَإِنِّي حُرٌّ لَسْتُ بِعَبْدٍ ‏.‏ فَقَالُوا قَدْ أَخْبَرَنَا خَبَرَكَ ‏.‏ فَانْطَلَقُوا بِهِ فَجَاءَ أَبُو بَكْرٍ فَأَخْبَرُوهُ بِذَلِكَ ‏.‏ قَالَ فَاتَّبَعَ الْقَوْمَ وَرَدَّ عَلَيْهِمُ الْقَلاَئِصَ وَأَخَذَ نُعَيْمَانَ ‏.‏ قَالَ فَلَمَّا قَدِمُوا عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ وَأَخْبَرُوهُ ‏.‏ قَالَ فَضَحِكَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَأَصْحَابُهُ مِنْهُ حَوْلاً ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "24.00",
            "hadithNumber": "3720",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "24",
                    "chapterTitle": "Joking",
                    "urn": 1258650,
                    "body": "<p>It was narrated that Abu Taiyah said:\n\"I heard Anas Bin Malik say: The Messenger of Allah (ﷺ) used to mix with us so much that he said to a little brother of mine: \"O Abu `Umair, what happened to the Nughair (one of the narrators Waki` said that it means a bird that he used to play with).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "24",
                    "chapterTitle": "باب الْمِزَاحِ",
                    "urn": 1338520,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ أَبِي التَّيَّاحِ، قَالَ سَمِعْتُ أَنَسَ بْنَ مَالِكٍ، يَقُولُ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يُخَالِطُنَا حَتَّى يَقُولَ لأَخٍ لِي صَغِيرٍ ‏\"‏ يَا أَبَا عُمَيْرٍ مَا فَعَلَ النُّغَيْرُ ‏\"‏ ‏.‏ قَالَ وَكِيعٌ يَعْنِي طَيْرًا كَانَ يَلْعَبُ بِهِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "25.00",
            "hadithNumber": "3721",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "25",
                    "chapterTitle": "Plucking out white hairs",
                    "urn": 1258660,
                    "body": "<p>It was narrated from 'Amr bin Sh'uaib from his father, that his grandfather said:\n\"The Messenger of Allah(ﷺ) forbade plucking out white hairs and said: 'It is the light of the believer.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "25",
                    "chapterTitle": "باب نَتْفِ الشَّيْبِ",
                    "urn": 1338530,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، عَنْ مُحَمَّدِ بْنِ إِسْحَاقَ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَنْ نَتْفِ الشَّيْبِ وَقَالَ ‏\"‏ هُوَ نُورُ الْمُؤْمِنِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "26.00",
            "hadithNumber": "3722",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "26",
                    "chapterTitle": "Sitting between the shade and the sun",
                    "urn": 1258670,
                    "body": "<p>It was narrated from Ibn Buraidah, from his father, that the Prophet(ﷺ) :\n\"forbade sitting between the shade and sun.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "26",
                    "chapterTitle": "باب الْجُلُوسِ بَيْنَ الظِّلِّ وَالشَّمْسِ",
                    "urn": 1338540,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، عَنْ أَبِي الْمُنِيبِ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى أَنْ يُقْعَدَ بَيْنَ الظِّلِّ وَالشَّمْسِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "27.00",
            "hadithNumber": "3723",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "27",
                    "chapterTitle": "Prohibition of lying's on one's face",
                    "urn": 1258680,
                    "body": "<p>It was narrated from Qais bin Tihfah Al-Ghifari that his father said:\n\"The Messenger of Allah(ﷺ) found me sleeping in the masjid on my stomach. He nudged me with his foot and said: 'Why are you sleeping like this? This is a kind of sleep that Allah dislikes,' or 'that Allah hates.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "27",
                    "chapterTitle": "باب النَّهْىِ عَنِ الاِضْطِجَاعِ، عَلَى الْوَجْهِ",
                    "urn": 1338550,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، عَنِ الأَوْزَاعِيِّ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ قَيْسِ بْنِ طِخْفَةَ الْغِفَارِيِّ، عَنْ أَبِيهِ، قَالَ أَصَابَنِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ نَائِمًا فِي الْمَسْجِدِ عَلَى بَطْنِي فَرَكَضَنِي بِرِجْلِهِ وَقَالَ ‏\"‏ مَا لَكَ وَلِهَذَا النَّوْمِ هَذِهِ نَوْمَةٌ يَكْرَهُهَا اللَّهُ أَوْ يُبْغِضُهَا اللَّهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "27.00",
            "hadithNumber": "3724",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "27",
                    "chapterTitle": "Prohibition of lying's on one's face",
                    "urn": 1258690,
                    "body": "<p>It was narrated that Abu Dharr said:\n\"The Prophet(ﷺ) passed by me and I was lying on my stomach. He nudged me with his foot and said: 'O Junaidib! This is how the people of Hell lie.'\"\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "27",
                    "chapterTitle": "باب النَّهْىِ عَنِ الاِضْطِجَاعِ، عَلَى الْوَجْهِ",
                    "urn": 1338560,
                    "body": "<p>حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا إِسْمَاعِيلُ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا مُحَمَّدُ بْنُ نُعَيْمِ بْنِ عَبْدِ اللَّهِ الْمُجْمِرِ، عَنْ أَبِيهِ، عَنِ ابْنِ طِخْفَةَ الْغِفَارِيِّ، عَنْ أَبِي ذَرٍّ، قَالَ مَرَّ بِيَ النَّبِيُّ ـ صلى الله عليه وسلم ـ وَأَنَا مُضْطَجِعٌ عَلَى بَطْنِي فَرَكَضَنِي بِرِجْلِهِ وَقَالَ ‏\"‏ يَا جُنَيْدِبُ إِنَّمَا هَذِهِ ضِجْعَةُ أَهْلِ النَّارِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "27.00",
            "hadithNumber": "3725",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "27",
                    "chapterTitle": "Prohibition of lying's on one's face",
                    "urn": 1258700,
                    "body": "<p>It was narrated that Abu Umamah said:\n\"The Prophet(ﷺ) passed by a man who was sleeping in the masjid, lying on his face. He struck him with his foot and said: 'Get up' or; 'Sit up, fo this is a hellish kind of sleep.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "27",
                    "chapterTitle": "باب النَّهْىِ عَنِ الاِضْطِجَاعِ، عَلَى الْوَجْهِ",
                    "urn": 1338570,
                    "body": "<p>حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا سَلَمَةُ بْنُ رَجَاءٍ، عَنِ الْوَلِيدِ بْنِ جَمِيلٍ الدِّمَشْقِيِّ، أَنَّهُ سَمِعَ الْقَاسِمَ بْنَ عَبْدِ الرَّحْمَنِ، يُحَدِّثُ عَنْ أَبِي أُمَامَةَ، قَالَ مَرَّ النَّبِيُّ ـ صلى الله عليه وسلم ـ عَلَى رَجُلٍ نَائِمٍ فِي الْمَسْجِدِ مُنْبَطِحٍ عَلَى وَجْهِهِ فَضَرَبَهُ بِرِجْلِهِ وَقَالَ ‏\"‏ قُمْ وَاقْعُدْ فَإِنَّهَا نَوْمَةٌ جَهَنَّمِيَّةٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "28.00",
            "hadithNumber": "3726",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "28",
                    "chapterTitle": "Learning about the stars",
                    "urn": 1258710,
                    "body": "<p>It was narrated from Ibn Abbas that the Messenger of Allah(ﷺ) said:\n\"Whoever learns about the stars, he learns a branch of magic; the more he learns (of the former) the more he learns (of the latter).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "28",
                    "chapterTitle": "باب تَعَلُّمِ النُّجُومِ",
                    "urn": 1338580,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنْ عُبَيْدِ اللَّهِ بْنِ الأَخْنَسِ، عَنِ الْوَلِيدِ بْنِ عَبْدِ اللَّهِ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنِ ابْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنِ اقْتَبَسَ عِلْمًا مِنَ النُّجُومِ اقْتَبَسَ شُعْبَةً مِنَ السِّحْرِ زَادَ مَا زَادَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "29.00",
            "hadithNumber": "3727",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "29",
                    "chapterTitle": "Prohibition of cursing the wind",
                    "urn": 1258720,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:\n\"Do not curse the wind, for it is from the mercy of Allah, bringing Rahmah (i.e., rain and breezes), or destruction. But ask Allah for its goodness, and seek refuge with Allah from its evil.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "29",
                    "chapterTitle": "باب النَّهْىِ عَنْ سَبِّ الرِّيحِ",
                    "urn": 1338590,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، عَنِ الأَوْزَاعِيِّ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا ثَابِتٌ الزُّرَقِيُّ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَسُبُّوا الرِّيحَ فَإِنَّهَا مِنْ رَوْحِ اللَّهِ تَأْتِي بِالرَّحْمَةِ وَالْعَذَابِ وَلَكِنْ سَلُوا اللَّهَ مِنْ خَيْرِهَا وَتَعَوَّذُوا بِاللَّهِ مِنْ شَرِّهَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "30.00",
            "hadithNumber": "3728",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "30",
                    "chapterTitle": "Names that are liked",
                    "urn": 1258730,
                    "body": "<p>It was narrated from Ibn 'Umar that the Prophet(ﷺ) said:\n\"The most beloved of names to Allah are 'Abdullah and 'Abdur-Rahman.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "30",
                    "chapterTitle": "باب مَا يُسْتَحَبُّ مِنَ الأَسْمَاءِ",
                    "urn": 1338600,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا الْعُمَرِيُّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ أَحَبُّ الأَسْمَاءِ إِلَى اللَّهِ عَزَّ وَجَلَّ عَبْدُ اللَّهِ وَعَبْدُ الرَّحْمَنِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "31.00",
            "hadithNumber": "3729",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "31",
                    "chapterTitle": "Names that are disliked",
                    "urn": 1258740,
                    "body": "<p>It was narrated from 'Umar ibn Al-Khattab that the Prophet(ﷺ) said:\n\"If I live- if Allah wills - I will forbid the names Rabah(profit), Najih(saved), Aflah (Successful), Nafi (beneficial) and Yasar(prosperity).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "31",
                    "chapterTitle": "باب مَا يُكْرَهُ مِنَ الأَسْمَاءِ",
                    "urn": 1338610,
                    "body": "<p>حَدَّثَنَا نَصْرُ بْنُ عَلِيٍّ، حَدَّثَنَا أَبُو أَحْمَدَ، حَدَّثَنَا سُفْيَانُ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، عَنْ عُمَرَ بْنِ الْخَطَّابِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لَئِنْ عِشْتُ إِنْ شَاءَ اللَّهُ لأَنْهَيَنَّ أَنْ يُسَمَّى رَبَاحٌ وَنَجِيحٌ وَأَفْلَحُ وَنَافِعٌ وَيَسَارٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "31.00",
            "hadithNumber": "3730",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "31",
                    "chapterTitle": "Names that are disliked",
                    "urn": 1258750,
                    "body": "<p>It was narrated that Samurah said:\n\"The Messenger of Allah(ﷺ) forbade giving our slaves four names: Aflah (successful), Nafi' (beneficial), Rabah (profit) and Yasar(prosperity).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "31",
                    "chapterTitle": "باب مَا يُكْرَهُ مِنَ الأَسْمَاءِ",
                    "urn": 1338620,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا الْمُعْتَمِرُ بْنُ سُلَيْمَانَ، عَنِ الرُّكَيْنِ، عَنْ أَبِيهِ، عَنْ سَمُرَةَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ نُسَمِّيَ رَقِيقَنَا أَرْبَعَةَ أَسْمَاءٍ أَفْلَحُ وَنَافِعٌ وَرَبَاحٌ وَيَسَارٌ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "31.00",
            "hadithNumber": "3731",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "31",
                    "chapterTitle": "Names that are disliked",
                    "urn": 1258760,
                    "body": "<p>It was narrated that Masruq said:\n\"I met 'Umar bin Khattab and he said: 'Who are you?' I said: 'Masruq bin Adja'.' 'Umar said: 'I heard the Messenger of Allah(ﷺ) saying,\"Ajda' is a devil.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "31",
                    "chapterTitle": "باب مَا يُكْرَهُ مِنَ الأَسْمَاءِ",
                    "urn": 1338630,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا هَاشِمُ بْنُ الْقَاسِمِ، حَدَّثَنَا أَبُو عَقِيلٍ، حَدَّثَنَا مُجَالِدُ بْنُ سَعِيدٍ، عَنِ الشَّعْبِيِّ، عَنْ مَسْرُوقٍ، قَالَ لَقِيتُ عُمَرَ بْنَ الْخَطَّابِ فَقَالَ مَنْ أَنْتَ فَقُلْتُ مَسْرُوقُ بْنُ الأَجْدَعِ ‏.‏ فَقَالَ عُمَرُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ الأَجْدَعُ شَيْطَانٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "32.00",
            "hadithNumber": "3732",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "32",
                    "chapterTitle": "Changing Names",
                    "urn": 1258770,
                    "body": "<p>It was narrated from Abu Hurairah that:\n\"Zainab used to be called \"Barrah\" (good), and it was said that she was praising herself. So the Messenger of Allah(ﷺ) changed her name to Zainab.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "32",
                    "chapterTitle": "باب تَغْيِيرِ الأَسْمَاءِ",
                    "urn": 1338640,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ عَطَاءِ بْنِ أَبِي مَيْمُونَةَ، قَالَ سَمِعْتُ أَبَا رَافِعٍ، يُحَدِّثُ عَنْ أَبِي هُرَيْرَةَ، أَنَّ زَيْنَبَ، كَانَ اسْمُهَا بَرَّةَ فَقِيلَ لَهَا تُزَكِّي نَفْسَهَا فَسَمَّاهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ زَيْنَبَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "32.00",
            "hadithNumber": "3733",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "32",
                    "chapterTitle": "Changing Names",
                    "urn": 1258780,
                    "body": "<p>It was narrated from Ibn Umar that:\n\"a daughter of 'Umar was Asiyah(disobedient) then the Messenger of Allah(ﷺ) named her 'Jamilah' (beautiful).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "32",
                    "chapterTitle": "باب تَغْيِيرِ الأَسْمَاءِ",
                    "urn": 1338650,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا الْحَسَنُ بْنُ مُوسَى، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ عُبَيْدِ اللَّهِ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، أَنَّ ابْنَةً لِعُمَرَ، كَانَ يُقَالُ لَهَا عَاصِيَةُ فَسَمَّاهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ جَمِيلَةَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "32.00",
            "hadithNumber": "3734",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "32",
                    "chapterTitle": "Changing Names",
                    "urn": 1258790,
                    "body": "<p>It was narrated that Abdullah bin Salam said:\n\"I came to the Messenger of Allah(ﷺ), and my name was not Abdullah bin Salam. The Messenger of Allah(ﷺ) named me Abdullah bin Salam.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "32",
                    "chapterTitle": "باب تَغْيِيرِ الأَسْمَاءِ",
                    "urn": 1338660,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يَحْيَى بْنُ يَعْلَى أَبُو الْمُحَيَّاةِ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، حَدَّثَنَى ابْنُ أَخِي عَبْدِ اللَّهِ بْنِ سَلاَمٍ، عَنْ عَبْدِ اللَّهِ بْنِ سَلاَمٍ، قَالَ قَدِمْتُ عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَلَيْسَ اسْمِي عَبْدَ اللَّهِ بْنَ سَلاَمٍ فَسَمَّانِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ عَبْدَ اللَّهِ بْنَ سَلاَمٍ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "33.00",
            "hadithNumber": "3735",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "33",
                    "chapterTitle": "Combining the name and the kunyah of the Prophet(ﷺ)",
                    "urn": 1258800,
                    "body": "<p>It was narrated from Muhammad that they heard Abu Hurairah say:\n\"Abul Qasim(ﷺ) said: 'Call yourselves by my name but do not call yourselves by my Kunyah.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "33",
                    "chapterTitle": "باب الْجَمْعِ بَيْنَ اسْمِ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَكُنْيَتِهِ",
                    "urn": 1338670,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ أَيُّوبَ، عَنْ مُحَمَّدٍ، قَالَ سَمِعْتُ أَبَا هُرَيْرَةَ، يَقُولُ قَالَ أَبُو الْقَاسِمِ ـ صلى الله عليه وسلم ـ ‏\"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "33.00",
            "hadithNumber": "3736",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "33",
                    "chapterTitle": "Combining the name and the kunyah of the Prophet(ﷺ)",
                    "urn": 1258810,
                    "body": "<p>It was narrated from Jabir that the Messenger of Allah(ﷺ) said:\n\"Call yourselves by my name but do not call yourselves by my Kunyah.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "33",
                    "chapterTitle": "باب الْجَمْعِ بَيْنَ اسْمِ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَكُنْيَتِهِ",
                    "urn": 1338680,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي سُفْيَانَ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكَنَّوْا بِكُنْيَتِي ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "33.00",
            "hadithNumber": "3737",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "33",
                    "chapterTitle": "Combining the name and the kunyah of the Prophet(ﷺ)",
                    "urn": 1258820,
                    "body": "<p>It was narrated that Anas said:\n\"The Messenger of Allah(ﷺ) was in Baqi', and a man called out to another man: 'O Abul-Qasim!' The Messenger of Allah(ﷺ) turned to him, and he said: 'I didn't mean you.' The Messenger of Allah(ﷺ) said: 'Call yourselves by my name but do not call yourselves by my Kunyah.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "33",
                    "chapterTitle": "باب الْجَمْعِ بَيْنَ اسْمِ النَّبِيِّ ـ صلى الله عليه وسلم ـ وَكُنْيَتِهِ",
                    "urn": 1338690,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الْوَهَّابِ الثَّقَفِيُّ، عَنْ حُمَيْدٍ، عَنْ أَنَسٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِالْبَقِيعِ فَنَادَى رَجُلٌ رَجُلاً يَا أَبَا الْقَاسِمِ فَالْتَفَتَ إِلَيْهِ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ إِنِّي لَمْ أَعْنِكَ ‏.‏ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ تَسَمَّوْا بِاسْمِي وَلاَ تَكْتَنُوا بِكُنْيَتِي ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "34.00",
            "hadithNumber": "3738",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "34",
                    "chapterTitle": "A man being given a kunyah before he has a child",
                    "urn": 1258830,
                    "body": "<p>It was narrated from Hamzah bin Suhaib that Umar said to Suhaib:\n\"Why are you called Abu Yahya when you do not have a son?\" He said: \"The Messenger of Allah(ﷺ) gave me the Kunya of Abu Yahya.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "34",
                    "chapterTitle": "باب الرَّجُلِ يُكَنَّى قَبْلَ أَنْ يُولَدَ لَهُ",
                    "urn": 1338700,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ عَبْدِ اللَّهِ بْنِ مُحَمَّدِ بْنِ عَقِيلٍ، عَنْ حَمْزَةَ بْنِ صُهَيْبٍ، أَنَّ عُمَرَ، قَالَ لِصُهَيْبٍ مَا لَكَ تَكْتَنِي بِأَبِي يَحْيَى وَلَيْسَ لَكَ وَلَدٌ ‏.‏ قَالَ كَنَّانِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ بِأَبِي يَحْيَى ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "34.00",
            "hadithNumber": "3739",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "34",
                    "chapterTitle": "A man being given a kunyah before he has a child",
                    "urn": 1258840,
                    "body": "<p>It was narrated from Aisha that she said to the Prophet(ﷺ):\n\"All of your wives have a Kunyah except me.\" He said: \"You are Umm Abdullah\".</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "34",
                    "chapterTitle": "باب الرَّجُلِ يُكَنَّى قَبْلَ أَنْ يُولَدَ لَهُ",
                    "urn": 1338710,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا وَكِيعٌ، عَنْ هِشَامِ بْنِ عُرْوَةَ، عَنْ مَوْلًى، لِلزُّبَيْرِ عَنْ عَائِشَةَ، ‏.‏ أَنَّهَا قَالَتْ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ كُلُّ أَزْوَاجِكَ كَنَّيْتَهُ غَيْرِي ‏.‏ قَالَ ‏\"‏ فَأَنْتِ أُمُّ عَبْدِ اللَّهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "34.00",
            "hadithNumber": "3740",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "34",
                    "chapterTitle": "A man being given a kunyah before he has a child",
                    "urn": 1258850,
                    "body": "<p>It was narrated that Anas said:\n\"The Prophet(ﷺ) used to come to us and say to a brother of mine, who was small: 'O Abu Umair.'\".</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "34",
                    "chapterTitle": "باب الرَّجُلِ يُكَنَّى قَبْلَ أَنْ يُولَدَ لَهُ",
                    "urn": 1338720,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ شُعْبَةَ، عَنْ أَبِي التَّيَّاحِ، عَنْ أَنَسٍ، قَالَ كَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ يَأْتِينَا فَيَقُولُ لأَخٍ لِي وَكَانَ صَغِيرًا ‏\"‏ يَا أَبَا عُمَيْرٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "35.00",
            "hadithNumber": "3741",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "35",
                    "chapterTitle": "Nicknames",
                    "urn": 1258860,
                    "body": "<p>It was narrated that Abu Jabirah bin Dahhak said:\n\"(Allah's saying) \"Nor insult one another by nicknames(Surah Al Hujarat 49:11)\" was revealed concerning us, the Ansar. When the Prophet(ﷺ) came to us, a man among us would have two or three names, and the Prophet(ﷺ) might call him by one of those names, only to be told: \"O Messenger of Allah(ﷺ), he does not like that name.\" Then:\"Nor insult one another by nicknames.\" was revealed.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "35",
                    "chapterTitle": "باب الأَلْقَابِ",
                    "urn": 1338730,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ إِدْرِيسَ، عَنْ دَاوُدَ، عَنِ الشَّعْبِيِّ، عَنْ أَبِي جَبِيرَةَ بْنِ الضَّحَّاكِ، قَالَ فِينَا نَزَلَتْ مَعْشَرَ الأَنْصَارِ ‏<a href=\"https://quran.com/49/11-11\">{وَلاَ تَنَابَزُوا بِالأَلْقَابِ‏)</a>‏ قَدِمَ عَلَيْنَا النَّبِيُّ ـ صلى الله عليه وسلم ـ وَالرَّجُلُ مِنَّا لَهُ الاِسْمَانِ وَالثَّلاَثَةُ فَكَانَ النَّبِيُّ ـ صلى الله عليه وسلم ـ رُبَّمَا دَعَاهُمْ بِبَعْضِ تِلْكَ الأَسْمَاءِ فَيُقَالُ يَا رَسُولَ اللَّهِ إِنَّهُ يَغْضَبُ مِنْ هَذَا ‏.‏ فَنَزَلَتْ ‏<a href=\"https://quran.com/49/11-11\">{وَلاَ تَنَابَزُوا بِالأَلْقَابِ}</a>‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "36.00",
            "hadithNumber": "3742",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "36",
                    "chapterTitle": "Praise",
                    "urn": 1258870,
                    "body": "<p>It was narrated that Miqdad bin 'Amr said:\n\"The Messenger of Allah(ﷺ) commanded us to throw dust in the faces of those who praise others.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "36",
                    "chapterTitle": "باب الْمَدْحِ",
                    "urn": 1338740,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، عَنْ سُفْيَانَ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ مُجَاهِدٍ، عَنْ أَبِي مَعْمَرٍ، عَنِ الْمِقْدَادِ بْنِ عَمْرٍو، قَالَ أَمَرَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ نَحْثُوَ فِي وُجُوهِ الْمَدَّاحِينَ التُّرَابَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "36.00",
            "hadithNumber": "3743",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "36",
                    "chapterTitle": "Praise",
                    "urn": 1258880,
                    "body": "<p>It was narrated that Muawiyah said:\n\"I heard the Messenger of Allah(ﷺ) say: 'Beware of praising one another, for it is slaughtering (one another).'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "36",
                    "chapterTitle": "باب الْمَدْحِ",
                    "urn": 1338750,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ سَعْدِ بْنِ إِبْرَاهِيمَ بْنِ عَبْدِ الرَّحْمَنِ بْنِ عَوْفٍ، عَنْ مَعْبَدٍ الْجُهَنِيِّ، عَنْ مُعَاوِيَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِيَّاكُمْ وَالتَّمَادُحَ فَإِنَّهُ الذَّبْحُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "36.00",
            "hadithNumber": "3744",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "36",
                    "chapterTitle": "Praise",
                    "urn": 1258890,
                    "body": "<p>It was narrated from Abdur-Rahman bin Abu Bakrah that his father said:\n\"A man praised another man in the presence of Messenger of Allah(ﷺ). The Messenger of Allah(ﷺ) said: 'Woe to you,you have cut the neck of your companion,'several times. Then he said: 'If anyone of you praises his brother, let him say: \"I think he is lie this, but I do not sanctify anyone before Allah.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "36",
                    "chapterTitle": "باب الْمَدْحِ",
                    "urn": 1338760,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا شَبَابَةُ، حَدَّثَنَا شُعْبَةُ، عَنْ خَالِدٍ الْحَذَّاءِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي بَكْرَةَ، عَنْ أَبِيهِ، قَالَ مَدَحَ رَجُلٌ رَجُلاً عِنْدَ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ وَيْحَكَ قَطَعْتَ عُنُقَ صَاحِبِكَ ‏\"‏ ‏.‏ مِرَارًا ثُمَّ قَالَ ‏\"‏ إِنْ كَانَ أَحَدُكُمْ مَادِحًا أَخَاهُ فَلْيَقُلْ أَحْسِبُهُ وَلاَ أُزَكِّي عَلَى اللَّهِ أَحَدًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "37.00",
            "hadithNumber": "3745",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "37",
                    "chapterTitle": "One who is consulted is entrusted",
                    "urn": 1258900,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:\n\"One who is consulted is entrusted.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "37",
                    "chapterTitle": "باب الْمُسْتَشَارُ مُؤْتَمَنٌ",
                    "urn": 1338770,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ أَبِي بُكَيْرٍ، عَنْ شَيْبَانَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ الْمُسْتَشَارُ مُؤْتَمَنٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "37.00",
            "hadithNumber": "3746",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "37",
                    "chapterTitle": "One who is consulted is entrusted",
                    "urn": 1258910,
                    "body": "<p>It was narrated from Abu Mas'ud that the Messenger of Allah(ﷺ) said:\n\"One who is consulted is entrusted.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "37",
                    "chapterTitle": "باب الْمُسْتَشَارُ مُؤْتَمَنٌ",
                    "urn": 1338781,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَسْوَدُ بْنُ عَامِرٍ، عَنْ شَرِيكٍ، عَنِ الأَعْمَشِ، عَنْ أَبِي عَمْرٍو الشَّيْبَانِيِّ، عَنْ أَبِي مَسْعُودٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ الْمُسْتَشَارُ مُؤْتَمَنٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "37.00",
            "hadithNumber": "3747",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "37",
                    "chapterTitle": "One who is consulted is entrusted",
                    "urn": 1258920,
                    "body": "<p>It was narrated from Jabir that that the Messenger of Allah(ﷺ) said:\n\"If one of you consults his brother, then let him advise him.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "37",
                    "chapterTitle": "باب الْمُسْتَشَارُ مُؤْتَمَنٌ",
                    "urn": 1338782,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا يَحْيَى بْنُ زَكَرِيَّا بْنِ أَبِي زَائِدَةَ، وَعَلِيُّ بْنُ هَاشِمٍ، عَنِ ابْنِ أَبِي لَيْلَى، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا اسْتَشَارَ أَحَدُكُمْ أَخَاهُ فَلْيُشِرْ عَلَيْهِ ‏\"‏ ‏.</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "38.00",
            "hadithNumber": "3748",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "38",
                    "chapterTitle": "Entering Bathhouses",
                    "urn": 1258930,
                    "body": "<p>It was narrated that Abdullah bin Amr said:\n\"The Messenger of Allah(ﷺ) said: 'You will conquer the lands of the non-Arabs, where you will find houses called Hammamat (bathhouses). Men Should only enter them wearing a waist wrap, and do not let women enter them unless they are sick or bleeding following childbirth.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "38",
                    "chapterTitle": "باب دُخُولِ الْحَمَّامِ",
                    "urn": 1338790,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدَةُ بْنُ سُلَيْمَانَ، ح وَحَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا خَالِي، يَعْلَى وَجَعْفَرُ بْنُ عَوْنٍ جَمِيعًا عَنْ عَبْدِ الرَّحْمَنِ بْنِ زِيَادِ بْنِ أَنْعُمٍ الإِفْرِيقِيِّ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ رَافِعٍ، عَنْ عَبْدِ اللَّهِ بْنِ عَمْرٍو، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ تُفْتَحُ لَكُمْ أَرْضُ الأَعَاجِمِ وَسَتَجِدُونَ فِيهَا بُيُوتًا يُقَالُ لَهَا الْحَمَّامَاتُ فَلاَ يَدْخُلْهَا الرِّجَالُ إِلاَّ بِإِزَارٍ وَامْنَعُوا النِّسَاءَ أَنْ يَدْخُلْنَهَا إِلاَّ مَرِيضَةً أَوْ نُفَسَاءَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "38.00",
            "hadithNumber": "3749",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "38",
                    "chapterTitle": "Entering Bathhouses",
                    "urn": 1258940,
                    "body": "<p>It was narrated from Aisha that the Prophet(ﷺ):\nforbade men and women to enter bathhouses, then he allowed men to enter them wearing a waist wrap, but he did not make the same allowance for women.</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "38",
                    "chapterTitle": "باب دُخُولِ الْحَمَّامِ",
                    "urn": 1338800,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، ح وَحَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، قَالاَ حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، أَنْبَأَنَا عَبْدُ اللَّهِ بْنُ شَدَّادٍ، عَنْ أَبِي عُذْرَةَ، - قَالَ وَكَانَ قَدْ أَدْرَكَ النَّبِيَّ ـ صلى الله عليه وسلم ـ - عَنْ عَائِشَةَ أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَهَى الرِّجَالَ وَالنِّسَاءَ مِنَ الْحَمَّامَاتِ ثُمَّ رَخَّصَ لِلرِّجَالِ أَنْ يَدْخُلُوهَا فِي الْمَيَازِرِ وَلَمْ يُرَخِّصْ لِلنِّسَاءِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "38.00",
            "hadithNumber": "3750",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "38",
                    "chapterTitle": "Entering Bathhouses",
                    "urn": 1258950,
                    "body": "<p>It was narrated from Abu Malih AL-HUdhail that some women from the people of Hims asked permission to enter upon Aisha. She said:\n\"Perhaps you are among those (women) who enter bathhouses? I heard the Messenger of Allah(ﷺ) say: 'Any woman who takes off her clothes anywhere but in her husband's house, has torn the screen between her and Allah.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "38",
                    "chapterTitle": "باب دُخُولِ الْحَمَّامِ",
                    "urn": 1338810,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ مَنْصُورٍ، عَنْ سَالِمِ بْنِ أَبِي الْجَعْدِ، عَنْ أَبِي الْمَلِيحِ الْهُذَلِيِّ، أَنَّ نِسْوَةً، مِنْ أَهْلِ حِمْصَ اسْتَأْذَنَّ عَلَى عَائِشَةَ فَقَالَتْ لَعَلَّكُنَّ مِنَ اللَّوَاتِي يَدْخُلْنَ الْحَمَّامَاتِ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ أَيُّمَا امْرَأَةٍ وَضَعَتْ ثِيَابَهَا فِي غَيْرِ بَيْتِ زَوْجِهَا فَقَدْ هَتَكَتْ سِتْرَ مَا بَيْنَهَا وَبَيْنَ اللَّهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "39.00",
            "hadithNumber": "3751",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "39",
                    "chapterTitle": "Applying Hair removing chemical",
                    "urn": 1258960,
                    "body": "<p>It was narrated from Umm Salamah that when the Prophet(ﷺ) would apply (it):\nhe began with his private area, coating it with hair removing chemical. And his wife would do the remainder of his body.</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "39",
                    "chapterTitle": "باب الاِطِّلاَءِ بِالنُّورَةِ",
                    "urn": 1338820,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ عَبْدِ اللَّهِ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي هَاشِمٍ الرُّمَّانِيِّ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أُمِّ سَلَمَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ إِذَا اطَّلَى بَدَأَ بِعَوْرَتِهِ فَطَلاَهَا بِالنُّورَةِ وَسَائِرَ جَسَدِهِ أَهْلُهُ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "39.00",
            "hadithNumber": "3752",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "39",
                    "chapterTitle": "Applying Hair removing chemical",
                    "urn": 1258970,
                    "body": "<p>It was narrated from Umm Salamah that:\n\"the Prophet(ﷺ) would coat (with hair removing chemical) and remove the pubic hairs with his hand.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "39",
                    "chapterTitle": "باب الاِطِّلاَءِ بِالنُّورَةِ",
                    "urn": 1338830,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنِي إِسْحَاقُ بْنُ مَنْصُورٍ، عَنْ كَامِلٍ أَبِي الْعَلاَءِ، عَنْ حَبِيبِ بْنِ أَبِي ثَابِتٍ، عَنْ أُمِّ سَلَمَةَ، أَنَّ النَّبِيَّ اطَّلَى وَوَلِيَ عَانَتَهُ بِيَدِهِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "40.00",
            "hadithNumber": "3753",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "40",
                    "chapterTitle": "Stories (for the purpose of exhortation)",
                    "urn": 1258980,
                    "body": "<p>It was narrated from Amr bin Shuaib, from his father, from his grandfather, that the Messenger of Allah(ﷺ) said:\n\"No one tells the stories to the people (for the purpose of exhortation) except a ruler, one appointed by a ruler, or a show-off.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "40",
                    "chapterTitle": "باب الْقَصَصِ",
                    "urn": 1338840,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْهِقْلُ بْنُ زِيَادٍ، حَدَّثَنَا الأَوْزَاعِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ عَامِرٍ الأَسْلَمِيِّ، عَنْ عَمْرِو بْنِ شُعَيْبٍ، عَنْ أَبِيهِ، عَنْ جَدِّهِ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ لاَ يَقُصُّ عَلَى النَّاسِ إِلاَّ أَمِيرٌ أَوْ مَأْمُورٌ أَوْ مُرَاءٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "40.00",
            "hadithNumber": "3754",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "40",
                    "chapterTitle": "Stories (for the purpose of exhortation)",
                    "urn": 1258990,
                    "body": "<p>It was narrated that Ibn Umar said:\n\"Stories (for the purpose of exhortation) were unknown at the time of the Messenger of Allah(ﷺ), the time of Abu Bakr and Umar.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "40",
                    "chapterTitle": "باب الْقَصَصِ",
                    "urn": 1338850,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الْعُمَرِيِّ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ لَمْ يَكُنِ الْقَصَصُ فِي زَمَنِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ وَلاَ زَمَنِ أَبِي بَكْرٍ وَلاَ زَمَنِ عُمَرَ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "41.00",
            "hadithNumber": "3755",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "41",
                    "chapterTitle": "Poetry",
                    "urn": 1259000,
                    "body": "<p>It was narrated from Ubbay bin Ka'b that the Messenger of Allah(ﷺ) said:\n\"In some poetry there is wisdom.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "41",
                    "chapterTitle": "باب الشِّعْرِ",
                    "urn": 1338860,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ الْمُبَارَكِ، عَنْ يُونُسَ، عَنِ الزُّهْرِيِّ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَبْدِ الرَّحْمَنِ بْنِ الْحَارِثِ، عَنْ مَرْوَانَ بْنِ الْحَكَمِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ الأَسْوَدِ بْنِ عَبْدِ يَغُوثَ، عَنْ أُبَىِّ بْنِ كَعْبٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِنَّ مِنَ الشِّعْرِ لَحِكْمَةً ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "41.00",
            "hadithNumber": "3756",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "41",
                    "chapterTitle": "Poetry",
                    "urn": 1259010,
                    "body": "<p>It was narrated from Ibn Abbas that the Prophet(ﷺ) said:\n\"In some poetry there is wisdom.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "41",
                    "chapterTitle": "باب الشِّعْرِ",
                    "urn": 1338870,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ زَائِدَةَ، عَنِ سِمَاكٍ، عَنْ عِكْرِمَةَ، عَنِ ابْنِ عَبَّاسٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَقُولُ ‏\"‏ إِنَّ مِنَ الشِّعْرِ حِكَمًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "41.00",
            "hadithNumber": "3757",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "41",
                    "chapterTitle": "Poetry",
                    "urn": 1259020,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:\n\"The truest of wods spoken by the poet are the words of Labid: Everything except Allah is false.' And Abu Umayyah bin Abu Salt nearly accepted Islam.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "41",
                    "chapterTitle": "باب الشِّعْرِ",
                    "urn": 1338880,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ الْمَلِكِ بْنِ عُمَيْرٍ، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ أَصْدَقُ كَلِمَةٍ قَالَهَا الشَّاعِرُ كَلِمَةُ لَبِيدٍ أَلاَ كُلُّ شَىْءٍ مَا خَلاَ اللَّهَ بَاطِلُ وَكَادَ أُمَيَّةُ بْنُ أَبِي الصَّلْتِ أَنْ يُسْلِمَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "41.00",
            "hadithNumber": "3758",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "41",
                    "chapterTitle": "Poetry",
                    "urn": 1259030,
                    "body": "<p>It was narrated from Amr bin Sharid that his father said:\n\"I recited one hundered verses of the poetry of Umayyah bin Abu Salt to the Messenger of Allah(ﷺ), and after every line he said, \"More\". And he said: \"He nearly accepted Islam.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "41",
                    "chapterTitle": "باب الشِّعْرِ",
                    "urn": 1338890,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، عَنْ عَبْدِ اللَّهِ بْنِ عَبْدِ الرَّحْمَنِ بْنِ يَعْلَى، عَنْ عَمْرِو بْنِ الشَّرِيدِ، عَنْ أَبِيهِ، قَالَ أَنْشَدْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مِائَةَ قَافِيَةٍ مِنْ شِعْرِ أُمَيَّةَ بْنِ أَبِي الصَّلْتِ يَقُولُ بَيْنَ كُلِّ قَافِيَةٍ ‏\"‏ هِيهِ ‏\"‏ ‏.‏ وَقَالَ ‏\"‏ كَادَ أَنْ يُسْلِمَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "42.00",
            "hadithNumber": "3759",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "42",
                    "chapterTitle": "What kind of poetry is undesirable",
                    "urn": 1259040,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:\n\"If a man were to fill his stomach completely with pus until it destroyed him, that would be better for him than filling (his mind) with poetry.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "42",
                    "chapterTitle": "باب مَا كُرِهَ مِنَ الشِّعْرِ",
                    "urn": 1338900,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا حَفْصٌ، وَأَبُو مُعَاوِيَةَ وَوَكِيعٌ عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لأَنْ يَمْتَلِئَ جَوْفُ الرَّجُلِ قَيْحًا حَتَّى يَرِيَهُ خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"‏ ‏.‏ إِلاَّ أَنَّ حَفْصًا لَمْ يَقُلْ يَرِيَهُ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "42.00",
            "hadithNumber": "3760",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "42",
                    "chapterTitle": "What kind of poetry is undesirable",
                    "urn": 1259050,
                    "body": "<p>It was narrated from Sad bin Abu Waqas that the Prophet(ﷺ) said:\n\"If a man were to fill his stomach completely with pus until it destroyed him, that would be better for him than filling (his mind) with poetry.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "42",
                    "chapterTitle": "باب مَا كُرِهَ مِنَ الشِّعْرِ",
                    "urn": 1338910,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ بَشَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سَعِيدٍ، وَمُحَمَّدُ بْنُ جَعْفَرٍ، قَالاَ حَدَّثَنَا شُعْبَةُ، حَدَّثَنِي قَتَادَةُ، عَنْ يُونُسَ بْنِ جُبَيْرٍ، عَنْ مُحَمَّدِ بْنِ سَعْدِ بْنِ أَبِي وَقَّاصٍ، عَنْ سَعْدِ بْنِ أَبِي وَقَّاصٍ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ لأَنْ يَمْتَلِئَ جَوْفُ أَحَدِكُمْ قَيْحًا حَتَّى يَرِيَهُ خَيْرٌ لَهُ مِنْ أَنْ يَمْتَلِئَ شِعْرًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "42.00",
            "hadithNumber": "3761",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "42",
                    "chapterTitle": "What kind of poetry is undesirable",
                    "urn": 1259060,
                    "body": "<p>It was narrated from Aisha that the Messenger of Allah(ﷺ) said:\n\"The worst of all people lying is a man who trades insults with another man, disparaging the entire tribe, and a man who denies his father and accuses his mother of adultery.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "42",
                    "chapterTitle": "باب مَا كُرِهَ مِنَ الشِّعْرِ",
                    "urn": 1338920,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عُبَيْدُ اللَّهِ، عَنْ شَيْبَانَ، عَنِ الأَعْمَشِ، عَنْ عَمْرِو بْنِ مُرَّةَ، عَنْ يُوسُفَ بْنِ مَاهَكَ، عَنْ عُبَيْدِ بْنِ عُمَيْرٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ أَعْظَمَ النَّاسِ فِرْيَةً لَرَجُلٌ هَاجَى رَجُلاً فَهَجَا الْقَبِيلَةَ بِأَسْرِهَا وَرَجُلٌ انْتَفَى مِنْ أَبِيهِ وَزَنَّى أُمَّهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "43.00",
            "hadithNumber": "3762",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "43",
                    "chapterTitle": "Playing Backgammon",
                    "urn": 1259070,
                    "body": "<p>It was narrated that Abu Musa said:\n\"The Messenger of Allah(ﷺ) said: 'Whoever plays backgammon has disobeyed Allah and His Messenger.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "43",
                    "chapterTitle": "باب اللَّعِبِ بِالنَّرْدِ",
                    "urn": 1338930,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، وَأَبُو أُسَامَةَ عَنْ عُبَيْدِ اللَّهِ بْنِ عُمَرَ، عَنْ نَافِعٍ، عَنْ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ أَبِي مُوسَى، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ لَعِبَ بِالنَّرْدِ فَقَدْ عَصَى اللَّهَ وَرَسُولَهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "43.00",
            "hadithNumber": "3763",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "43",
                    "chapterTitle": "Playing Backgammon",
                    "urn": 1259080,
                    "body": "<p>It was narrated from Sulaiman bin Buraidah from his father that the Prophet(ﷺ) said:\n\"Whoever plays backgammon, it is as if he dipped his hand in the flesh and blood of a pig.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "43",
                    "chapterTitle": "باب اللَّعِبِ بِالنَّرْدِ",
                    "urn": 1338940,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، وَأَبُو أُسَامَةَ عَنْ سُفْيَانَ، عَنْ عَلْقَمَةَ بْنِ مَرْثَدٍ، عَنْ سُلَيْمَانَ بْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ لَعِبَ بِالنَّرْدَشِيرِ فَكَأَنَّمَا غَمَسَ يَدَهُ فِي لَحْمِ خِنْزِيرٍ وَدَمِهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "44.00",
            "hadithNumber": "3764",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "44",
                    "chapterTitle": "Playing with Pigeons",
                    "urn": 1259090,
                    "body": "<p>It was narrated from 'Aishah that the Prophet(ﷺ) looked at a man who was chasing a bird and said:\n\"A devil chasing a devil.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "44",
                    "chapterTitle": "باب اللَّعِبِ بِالْحَمَامِ",
                    "urn": 1338950,
                    "body": "<p>حَدَّثَنَا عَبْدُ اللَّهِ بْنُ عَامِرِ بْنِ زُرَارَةَ، حَدَّثَنَا شَرِيكٌ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ نَظَرَ إِلَى إِنْسَانٍ يَتْبَعُ طَائِرًا فَقَالَ ‏\"‏ شَيْطَانٌ يَتْبَعُ شَيْطَانًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "44.00",
            "hadithNumber": "3765",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "44",
                    "chapterTitle": "Playing with Pigeons",
                    "urn": 1259100,
                    "body": "<p>It was narrated from Abu Hurairah that the Prophet(ﷺ) saw a man chasing a pigeon and said:\n\"A male devil following a female devil.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "44",
                    "chapterTitle": "باب اللَّعِبِ بِالْحَمَامِ",
                    "urn": 1338960,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا الأَسْوَدُ بْنُ عَامِرٍ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ رَأَى رَجُلاً يَتْبَعُ حَمَامَةً فَقَالَ ‏\"‏ شَيْطَانٌ يَتْبَعُ شَيْطَانَةً ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "44.00",
            "hadithNumber": "3766",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "44",
                    "chapterTitle": "Playing with Pigeons",
                    "urn": 1259110,
                    "body": "<p>It was narrated from Uthman bin Affan that the Messenger of Allah(ﷺ) saw a man following a pigeon and said:\n\"A male devil chasing a female devil.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "44",
                    "chapterTitle": "باب اللَّعِبِ بِالْحَمَامِ",
                    "urn": 1338970,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا يَحْيَى بْنُ سُلَيْمٍ الطَّائِفِيُّ، حَدَّثَنَا ابْنُ جُرَيْجٍ، عَنِ الْحَسَنِ بْنِ أَبِي الْحَسَنِ، عَنْ عُثْمَانَ بْنِ عَفَّانَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ رَأَى رَجُلاً وَرَاءَ حَمَامَةٍ فَقَالَ ‏\"‏ شَيْطَانٌ يَتْبَعُ شَيْطَانَةً ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "44.00",
            "hadithNumber": "3767",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "44",
                    "chapterTitle": "Playing with Pigeons",
                    "urn": 1259120,
                    "body": "<p>It was narrated that Anas bin Malik said:\n\"The Messenger of Allah(ﷺ) saw a man chasing a pigeon and said: 'A devil chasing a devil.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "44",
                    "chapterTitle": "باب اللَّعِبِ بِالْحَمَامِ",
                    "urn": 1338980,
                    "body": "<p>حَدَّثَنَا أَبُو نَصْرٍ، مُحَمَّدُ بْنُ خَلَفٍ الْعَسْقَلاَنِيُّ حَدَّثَنَا رَوَّادُ بْنُ الْجَرَّاحِ، حَدَّثَنَا أَبُو سَعْدٍ السَّاعِدِيُّ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ رَأَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ رَجُلاً يَتْبَعُ حَمَامًا فَقَالَ ‏\"‏ شَيْطَانٌ يَتْبَعُ شَيْطَانًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "45.00",
            "hadithNumber": "3768",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "45",
                    "chapterTitle": "It is undesirable to be alone",
                    "urn": 1259130,
                    "body": "<p>It was narrated from Ibn 'Umar that the Messenger of Allah(ﷺ) said:\n\"If anyone of you knew what is wrong with being alone, no one would travel at night by himself.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "45",
                    "chapterTitle": "باب كَرَاهِيَةِ الْوَحْدَةِ",
                    "urn": 1338990,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا وَكِيعٌ، عَنْ عَاصِمِ بْنِ مُحَمَّدٍ، عَنْ أَبِيهِ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لَوْ يَعْلَمُ أَحَدُكُمْ مَا فِي الْوَحْدَةِ مَا سَارَ أَحَدٌ بِلَيْلٍ وَحْدَهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "46.00",
            "hadithNumber": "3769",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "46",
                    "chapterTitle": "Extinguishing the fire when going to sleep",
                    "urn": 1259140,
                    "body": "<p>It was narrated from Salim, from his father, that the Prophet(ﷺ) said:\n\"Do not leave fire in your houses when you go to sleep.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "46",
                    "chapterTitle": "باب إِطْفَاءِ النَّارِ عِنْدَ الْمَبِيتِ",
                    "urn": 1339000,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنِ الزُّهْرِيِّ، عَنْ سَالِمٍ، عَنْ أَبِيهِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ لاَ تَتْرُكُوا النَّارَ فِي بُيُوتِكُمْ حِينَ تَنَامُونَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "46.00",
            "hadithNumber": "3770",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "46",
                    "chapterTitle": "Extinguishing the fire when going to sleep",
                    "urn": 1259150,
                    "body": "<p>It was narrated that Abu Musa said:\n\"A house burned down in Al-Madinah, with its occupants inside. The Prophet(ﷺ) was told of what had happened, and he said: 'This fire is an enemy to you. When you go to sleep, extinguish it.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "46",
                    "chapterTitle": "باب إِطْفَاءِ النَّارِ عِنْدَ الْمَبِيتِ",
                    "urn": 1339010,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، قَالَ احْتَرَقَ بَيْتٌ بِالْمَدِينَةِ عَلَى أَهْلِهِ فَحُدِّثَ النَّبِيُّ ـ صلى الله عليه وسلم ـ بِشَأْنِهِمْ فَقَالَ ‏\"‏ إِنَّمَا هَذِهِ النَّارُ عَدُوٌّ لَكُمْ فَإِذَا نِمْتُمْ فَأَطْفِئُوهَا عَنْكُمْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "46.00",
            "hadithNumber": "3771",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "46",
                    "chapterTitle": "Extinguishing the fire when going to sleep",
                    "urn": 1259160,
                    "body": "<p>It was narrated that Jabir said:\n\"The Messenger of Allah(ﷺ) commanded us (to do some things) and forbade us (to do some things), and he commanded us to extinguish our lamps.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "46",
                    "chapterTitle": "باب إِطْفَاءِ النَّارِ عِنْدَ الْمَبِيتِ",
                    "urn": 1339020,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ اللَّهِ بْنُ نُمَيْرٍ، عَنْ عَبْدِ الْمَلِكِ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، قَالَ أَمَرَنَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ وَنَهَانَا فَأَمَرَنَا أَنْ نُطْفِئَ سِرَاجَنَا ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "47.00",
            "hadithNumber": "3772",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "47",
                    "chapterTitle": "Prohibition of camping in the road",
                    "urn": 1259170,
                    "body": "<p>It was narrated from Jabir that the Messenger of Allah(ﷺ) said:\n\"Do not camp on the middle of the road, or relieve yourselves there.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "47",
                    "chapterTitle": "باب النَّهْىِ عَنِ النُّزُولِ، عَلَى الطَّرِيقِ",
                    "urn": 1339030,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا هِشَامٌ، عَنِ الْحَسَنِ، عَنْ جَابِرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ تَنْزِلُوا عَلَى جَوَادِّ الطَّرِيقِ وَلاَ تَقْضُوا عَلَيْهَا الْحَاجَاتِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "48.00",
            "hadithNumber": "3773",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "48",
                    "chapterTitle": "Three people riding on one animal",
                    "urn": 1259180,
                    "body": "<p>Abdullah bin Ja'far said:\n\"Whenever the Messenger of Allah(ﷺ) came back from a journey, he would be met by us(children). (One day) he was met by me and Hasan or Husain. He made one of us ride in front of him and the other behind him, until we came to Al-Madinah.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "48",
                    "chapterTitle": "باب رُكُوبِ ثَلاَثَةٍ عَلَى دَابَّةٍ",
                    "urn": 1339040,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَبْدُ الرَّحِيمِ بْنُ سُلَيْمَانَ، عَنْ عَاصِمٍ، حَدَّثَنَا مُوَرِّقٌ الْعِجْلِيُّ، حَدَّثَنِي عَبْدُ اللَّهِ بْنُ جَعْفَرٍ، قَالَ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا قَدِمَ مِنْ سَفَرٍ تُلُقِّيَ بِنَا ‏.‏ قَالَ فَتُلُقِّيَ بِي وَبِالْحَسَنِ أَوْ بِالْحُسَيْنِ ‏.‏ قَالَ فَحَمَلَ أَحَدَنَا بَيْنَ يَدَيْهِ وَالآخَرَ خَلْفَهُ حَتَّى قَدِمْنَا الْمَدِينَةَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "49.00",
            "hadithNumber": "3774",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "49",
                    "chapterTitle": "Putting dust on writings",
                    "urn": 1259190,
                    "body": "<p>It was narrated from Jabir that the Messenger of Allah(ﷺ) said:\n\"Put dust on your writings, because it is better, and dust is blessed (being humble in correspondence brings good results).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "49",
                    "chapterTitle": "باب تَتْرِيبِ الْكِتَابِ",
                    "urn": 1339050,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، أَنْبَأَنَا بَقِيَّةُ، أَنْبَأَنَا أَبُو أَحْمَدَ الدِّمَشْقِيُّ، عَنْ أَبِي الزُّبَيْرِ، عَنْ جَابِرٍ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ تَرِّبُوا صُحُفَكُمْ أَنْجَحُ لَهَا إِنَّ التُّرَابَ مُبَارَكٌ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "50.00",
            "hadithNumber": "3775",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "50",
                    "chapterTitle": "Two should not converse to the exclusion of a third",
                    "urn": 1259200,
                    "body": "<p>It was narrated from Abdullah that the Messenger of Allah(ﷺ) said:\n\"When you are three, two should not converse (privately) to the exclusion of their companion, because that makes him sad.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "50",
                    "chapterTitle": "باب لاَ يَتَنَاجَى اثْنَانِ دُونَ الثَّالِثِ",
                    "urn": 1339060,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ اللَّهِ بْنِ نُمَيْرٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ شَقِيقٍ، عَنْ عَبْدِ اللَّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِذَا كُنْتُمْ ثَلاَثَةً فَلاَ يَتَنَاجَى اثْنَانِ دُونَ صَاحِبِهِمَا فَإِنَّ ذَلِكَ يُحْزِنُهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "50.00",
            "hadithNumber": "3776",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "50",
                    "chapterTitle": "Two should not converse to the exclusion of a third",
                    "urn": 1259210,
                    "body": "<p>It was narrated that Ibn 'Umar said:\n\"The Messenger of Allah(ﷺ) forbade two to converse (privately) to the exclusion of a third.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "50",
                    "chapterTitle": "باب لاَ يَتَنَاجَى اثْنَانِ دُونَ الثَّالِثِ",
                    "urn": 1339070,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفْيَانُ بْنُ عُيَيْنَةَ، عَنْ عَبْدِ اللَّهِ بْنِ دِينَارٍ، عَنِ ابْنِ عُمَرَ، قَالَ نَهَى رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ أَنْ يَتَنَاجَى اثْنَانِ دُونَ الثَّالِثِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "51.00",
            "hadithNumber": "3777",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "51",
                    "chapterTitle": "A person who has arrows should carry them by their heads",
                    "urn": 1259220,
                    "body": "<p>Jabir bin 'Abdullah said:\n\"A man passed through the masjid with some arrows, and the Messenger of Allah(ﷺ) said: 'Hold them by their heads!' He said: 'Yes(ok).'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "51",
                    "chapterTitle": "باب مَنْ كَانَ مَعَهُ سِهَامٌ فَلْيَأْخُذْ بِنِصَالِهَا",
                    "urn": 1339080,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا سُفَيْانُ بْنُ عُيَيْنَةَ، قَالَ قُلْتُ لِعَمْرِو بْنِ دِينَارٍ سَمِعْتَ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ مَرَّ رَجُلٌ بِسِهَامٍ فِي الْمَسْجِدِ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَمْسِكْ بِنِصَالِهَا ‏\"‏ ‏.‏ قَالَ نَعَمْ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "51.00",
            "hadithNumber": "3778",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "51",
                    "chapterTitle": "A person who has arrows should carry them by their heads",
                    "urn": 1259230,
                    "body": "<p>It was narrated from Abu Musa that the Prophet(ﷺ) said:\n\"When anyone of you passes through our masjid or our marketplace carrying arrows, let him hold them by their heads, lest he hurt any Muslims.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "51",
                    "chapterTitle": "باب مَنْ كَانَ مَعَهُ سِهَامٌ فَلْيَأْخُذْ بِنِصَالِهَا",
                    "urn": 1339090,
                    "body": "<p>حَدَّثَنَا مَحْمُودُ بْنُ غَيْلاَنَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ بُرَيْدٍ، عَنْ جَدِّهِ أَبِي بُرْدَةَ، عَنْ أَبِي مُوسَى، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِذَا مَرَّ أَحَدُكُمْ فِي مَسْجِدِنَا أَوْ فِي سُوقِنَا وَمَعَهُ نَبْلٌ فَلْيُمْسِكْ عَلَى نِصَالِهَا بِكَفِّهِ أَنْ تُصِيبَ أَحَدًا مِنَ الْمُسْلِمِينَ بِشَىْءٍ أَوْ فَلْيَقْبِضْ عَلَى نِصَالِهَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3779",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259240,
                    "body": "<p>It was narrated from Aisha that the Messenger of Allah (ﷺ) said:\n\"The one who is proficient with the Qur'an will be with the noble and righteous scribes (the angels), and the one who reads it and stumbles over it, finding it difficult, will have two rewards.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339100,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا عِيسَى بْنُ يُونُسَ، حَدَّثَنَا سَعِيدُ بْنُ أَبِي عَرُوبَةَ، عَنْ قَتَادَةَ، عَنْ زُرَارَةَ بْنِ أَوْفَى، عَنْ سَعْدِ بْنِ هِشَامٍ، عَنْ عَائِشَةَ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ الْمَاهِرُ بِالْقُرْآنِ مَعَ السَّفَرَةِ الْكِرَامِ الْبَرَرَةِ وَالَّذِي يَقْرَؤُهُ يَتَتَعْتَعُ فِيهِ وَهُوَ عَلَيْهِ شَاقٌّ لَهُ أَجْرَانِ اثْنَانِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3780",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259250,
                    "body": "<p>It was narrated from Abu Sa`eed Al-Khudri that the Messenger of Allah (ﷺ) said:\n\"It will be said to the companion of the Qur'an, when he enters Paradise: 'Recite and rise one degree for every Verse,' until he recites the last thing that he knows.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339110,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا عُبَيْدُ اللَّهِ بْنُ مُوسَى، أَنْبَأَنَا شَيْبَانُ، عَنْ فِرَاسٍ، عَنْ عَطِيَّةَ، عَنْ أَبِي سَعِيدٍ الْخُدْرِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يُقَالُ لِصَاحِبِ الْقُرْآنِ إِذَا دَخَلَ الْجَنَّةَ اقْرَأْ وَاصْعَدْ ‏.‏ فَيَقْرَأُ وَيَصْعَدُ بِكُلِّ آيَةٍ دَرَجَةً حَتَّى يَقْرَأَ آخِرَ شَىْءٍ مَعَهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3781",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259260,
                    "body": "<p>It was narrated from Ibn Buraidah that his father told that the Messenger of Allah(ﷺ) said:\n\"The Quran will come on the Day of Resurrection, like a pale man, and will say: 'I am the one that kept you awake at night and made you thirsty during the day.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339120,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ بَشِيرِ بْنِ مُهَاجِرٍ، عَنِ ابْنِ بُرَيْدَةَ، عَنْ أَبِيهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يَجِيءُ الْقُرْآنُ يَوْمَ الْقِيَامَةِ كَالرَّجُلِ الشَّاحِبِ فَيَقُولُ أَنَا الَّذِي أَسْهَرْتُ لَيْلَكَ وَأَظْمَأْتُ نَهَارَكَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3782",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259270,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger of Allah(ﷺ) said:\n\"Wouldn't anyone of you like to find three great, fat pregnant she-camels when he returns to his family?\" We said: \"Yes.\" He said: \"Three verses that one of you recites during the praer are better for him than three great, fat pregnant she-camels.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339130,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَيُحِبُّ أَحَدُكُمْ إِذَا رَجَعَ إِلَى أَهْلِهِ أَنْ يَجِدَ فِيهِ ثَلاَثَ خَلِفَاتٍ عِظَامٍ سِمَانٍ ‏\"‏ ‏.‏ قُلْنَا نَعَمْ ‏.‏ قَالَ ‏\"‏ فَثَلاَثُ آيَاتٍ يَقْرَؤُهُنَّ أَحَدُكُمْ فِي صَلاَتِهِ خَيْرٌ لَهُ مِنْ ثَلاَثِ خَلِفَاتٍ سِمَانٍ عِظَامٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3783",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259280,
                    "body": "<p>It was narrated from Ibn Umar that the Messenger of Allah(ﷺ) said:\n\"The likeness of the Quran is that of a hobbled camel. If its owner ties its rope, he will keep it, but if he loosens its rope it will go away.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339140,
                    "body": "<p>حَدَّثَنَا أَحْمَدُ بْنُ الأَزْهَرِ، حَدَّثَنَا عَبْدُ الرَّزَّاقِ، أَنْبَأَنَا مَعْمَرٌ، عَنْ أَيُّوبَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَثَلُ الْقُرْآنِ مَثَلُ الإِبِلِ الْمُعَقَّلَةِ إِنْ تَعَاهَدَهَا صَاحِبُهَا بِعُقُلِهَا أَمْسَكَهَا عَلَيْهِ وَإِنْ أَطْلَقَ عُقُلَهَا ذَهَبَتْ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3784",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259290,
                    "body": "<p>It was narrated that Abu Hurairah said, 'I heard the Messenger of Allah(ﷺ) say':\n\"Allah said: 'I have divided the prayer between Myself and My slave into two halves, and My slave shall have what he has asked for.'When the slave says: 'Al-hamdulillah i rabbil Alameen (All the praise is to Allah, the Lord of all that exists),' Allah says:'My slave has praised Me, and My slave shall have what he has asked for.' And when he says: 'Ar-Rahmanir-Rahim (The Mos Gracious, the Most Merciful),' Allah says: 'My slave has extolled Me, and My slave shall have what he has asked for.' And when he says: 'Maliki yawmiddin [The Only Owner (and he Ruling Judge] if the Day of Recompense],' Allahs says: 'My slave has Glorified Me. This is for Me, and this Verse is between me and My slave in two halves.' And when he says: ' Iyyaka na'budu wa iyyaka nastain [You (Alone) we worship, and You (Alone) we ask for help],' He says: 'This is between Me an My slave, and My slave shall have what he has asked for.' And the end of the Surah is for My slave.' And when he says: 'Ihdinas-siratal-mustaqeema, siratal-alldhina an'amta alayhim a lad-dallin [Guide us to the Straight Way, the way of those on whom You have bestowed Your Grace, not(the way) of those who earned Your Anger, nor of those who went astray],' He says: 'THis is for My slave, and My slave shall have what he has asked for.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339150,
                    "body": "<p>حَدَّثَنَا أَبُو مَرْوَانَ، مُحَمَّدُ بْنُ عُثْمَانَ الْعُثْمَانِيُّ حَدَّثَنَا عَبْدُ الْعَزِيزِ بْنُ أَبِي حَازِمٍ، عَنِ الْعَلاَءِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ قَالَ اللَّهُ عَزَّ وَجَلَّ قَسَمْتُ الصَّلاَةَ بَيْنِي وَبَيْنَ عَبْدِي شَطْرَيْنِ فَنِصْفُهَا لِي وَنِصْفُهَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ ‏\"‏ ‏.‏ قَالَ فَقَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اقْرَءُوا يَقُولُ الْعَبْدُ ‏<a href=\"https://quran.com/1/2-2\">{الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ}</a>‏ فَيَقُولُ اللَّهُ عَزَّ وَجَلَّ حَمِدَنِي عَبْدِي وَلِعَبْدِي مَا سَأَلَ ‏.‏ فَيَقُولُ ‏{الرَّحْمَنِ الرَّحِيمِ}‏ فَيَقُولُ أَثْنَى عَلَىَّ عَبْدِي وَلِعَبْدِي مَا سَأَلَ ‏.‏ يَقُولُ ‏<a href=\"https://quran.com/1/4-4\">{مَالِكِ يَوْمِ الدِّينِ }</a>‏ فَيَقُولُ اللَّهُ مَجَّدَنِي عَبْدِي فَهَذَا لِي وَهَذِهِ الآيَةُ بَيْنِي وَبَيْنَ عَبْدِي نِصْفَيْنِ يَقُولُ الْعَبْدُ ‏<a href=\"https://quran.com/1/5-5\">{إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُ}</a>‏ يَعْنِي فَهَذِهِ بَيْنِي وَبَيْنَ عَبْدِي وَلِعَبْدِي مَا سَأَلَ وَآخِرُ السُّورَةِ لِعَبْدِي يَقُولُ الْعَبْدُ ‏<a href=\"https://quran.com/1/6-6\">{اهْدِنَا الصِّرَاطَ الْمُسْتَقِيمَ * صِرَاطَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ الْمَغْضُوبِ عَلَيْهِمْ وَلاَ الضَّالِّينَ}</a>‏ فَهَذَا لِعَبْدِي وَلِعَبْدِي مَا سَأَلَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3785",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259300,
                    "body": "<p>It was narrated that Abu Sa'eed bin Mu'alla said:\n\"The Messenger of Allah(ﷺ) said to me: 'Shall I not teach you the greatest Surah in the QUran before I leave the masjid?' Then the Propeht(ﷺ) went to leave, so I reminded him, and he said: Al-hamdulillahi Rabbil-Alameen (All the praise is to Allah, the Lord of all that exists). It is the Seven Oft-Recited Verses, and it is the Grand Quran that has been given to me.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339160,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا غُنْدَرٌ، عَنْ شُعْبَةَ، عَنْ خُبَيْبِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ حَفْصِ بْنِ عَاصِمٍ، عَنْ أَبِي سَعِيدِ بْنِ الْمُعَلَّى، قَالَ قَالَ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَلاَ أُعَلِّمُكَ أَعْظَمَ سُورَةٍ فِي الْقُرْآنِ قَبْلَ أَنْ أَخْرُجَ مِنَ الْمَسْجِدِ ‏\"‏ ‏.‏ قَالَ فَذَهَبَ النَّبِيُّ ـ صلى الله عليه وسلم ـ لِيَخْرُجَ فَأَذْكَرْتُهُ فَقَالَ ‏\"‏ ‏<a href=\"https://quran.com/1/2-2\">{‏ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ}</a>‏ وَهِيَ السَّبْعُ الْمَثَانِي وَالْقُرْآنُ الْعَظِيمُ الَّذِي أُوتِيتُهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3786",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259310,
                    "body": "<p>It was narrated from Abu Hurairah that the Prophet (ﷺ) said:\n\"There is a surah in the Qur'an, with thirty verses, which will intercede for its companion (the one who recites it) until he is forgiven: Tabarakal-ladhi bi yadihil mulk (Blessed is He in Whose Hand is the Dominion).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339170,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو أُسَامَةَ، عَنْ شُعْبَةَ، عَنْ قَتَادَةَ، عَنْ عَبَّاسٍ الْجُشَمِيِّ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِنَّ سُورَةً فِي الْقُرْآنِ ثَلاَثُونَ آيَةً شَفَعَتْ لِصَاحِبِهَا حَتَّى غُفِرَ لَهُ ‏<a href=\"https://quran.com/67/1-1\">{تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ}</a>‏ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3787",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259320,
                    "body": "<p>It was narrated that Abu Hurairah said that the Messenger of Allah(ﷺ) said:\n\"Qul Huwa Allahu ahad [Say: He is Allah, (the) One] is equivalent to one third of the Quran.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339180,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا خَالِدُ بْنُ مَخْلَدٍ، حَدَّثَنَا سُلَيْمَانُ بْنُ بِلاَلٍ، حَدَّثَنِي سُهَيْلٌ، عَنْ أَبِيهِ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ ‏<a href=\"https://quran.com/112/1-1\">{قُلْ هُوَ اللَّهُ أَحَدٌ}</a>‏ تَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3788",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259330,
                    "body": "<p>It was narrated that Anas bin Malik said:\n\"The Messenger of Allah(ﷺ) said: Qul Huwa Allahu ahad [Say: He is Allah, (the) One] is equivalent to one third of the Quran.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339190,
                    "body": "<p>حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ جَرِيرِ بْنِ حَازِمٍ، عَنْ قَتَادَةَ، عَنْ أَنَسِ بْنِ مَالِكٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ ‏<a href=\"https://quran.com/112/1-1\">{قُلْ هُوَ اللَّهُ أَحَدٌ}</a>‏ تَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "52.00",
            "hadithNumber": "3789",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "52",
                    "chapterTitle": "The rewards associated with the Quran",
                    "urn": 1259340,
                    "body": "<p>It was narrated that Abu Masud Al Ansari said:\n\"The Messenger of Allah(ﷺ) said: \"Allahu ahad, Al-Wahidus-Samad [Allah (the) One, the One the Self-Sufficient Master] is equivalent to one third of the Quran.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "52",
                    "chapterTitle": "باب ثَوَابِ الْقُرْآنِ",
                    "urn": 1339200,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ سُفْيَانَ، عَنْ أَبِي قَيْسٍ الأَوْدِيِّ، عَنْ عَمْرِو بْنِ مَيْمُونٍ، عَنْ أَبِي مَسْعُودٍ الأَنْصَارِيِّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ اللَّهُ أَحَدٌ الْوَاحِدُ الصَّمَدُ تَعْدِلُ ثُلُثَ الْقُرْآنِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "53.00",
            "hadithNumber": "3790",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "53",
                    "chapterTitle": "The Virtues of Remembrance (Dhikr)",
                    "urn": 1259350,
                    "body": "<p>It was narrated from Abu Darda that the Prophet(ﷺ) said:\n\"Shall I not tell you of the best of your deeds, the most pleasing to your Sovereign, those that raise you most in status, that are better than your gold and silver, or meeting you enemy (in battle) and you strike their necks and they strike your necks?\" They said: \" WHat is that, O Messenger of Allah?\" He said: \"Remembering Allah(Dhikr).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "53",
                    "chapterTitle": "باب فَضْلِ الذِّكْرِ",
                    "urn": 1339210,
                    "body": "<p>حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدِ بْنِ كَاسِبٍ، حَدَّثَنَا الْمُغِيرَةُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ عَبْدِ اللَّهِ بْنِ سَعِيدِ بْنِ أَبِي هِنْدٍ، عَنْ زِيَادِ بْنِ أَبِي زِيَادٍ، مَوْلَى ابْنِ عَيَّاشٍ عَنْ أَبِي بَحْرِيَّةَ، عَنْ أَبِي الدَّرْدَاءِ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ أَلاَ أُنَبِّئُكُمْ بِخَيْرِ أَعْمَالِكُمْ وَأَرْضَاهَا عِنْدَ مَلِيكِكُمْ وَأَرْفَعِهَا فِي دَرَجَاتِكُمْ وَخَيْرٍ لَكُمْ مِنْ إِعْطَاءِ الذَّهَبِ وَالْوَرِقِ وَمِنْ أَنْ تَلْقَوْا عَدُوَّكُمْ فَتَضْرِبُوا أَعْنَاقَهُمْ وَيَضْرِبُوا أَعْنَاقَكُمْ ‏\"‏ ‏.‏ قَالُوا وَمَا ذَاكَ يَا رَسُولَ اللَّهِ قَالَ ‏\"‏ ذِكْرُ اللَّهِ ‏\"‏ ‏.‏ وَقَالَ مُعَاذُ بْنُ جَبَلٍ مَا عَمِلَ امْرُؤٌ بِعَمَلٍ أَنْجَى لَهُ مِنْ عَذَابِ اللَّهِ عَزَّ وَجَلَّ مِنْ ذِكْرِ اللَّهِ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "53.00",
            "hadithNumber": "3791",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "53",
                    "chapterTitle": "The Virtues of Remembrance (Dhikr)",
                    "urn": 1259360,
                    "body": "<p>It was narrated that Abu Hurairah and Abu Sa'eed bore witness that the Prophet(ﷺ) said:\n\"No people sit in a gathering remembering Allah, But the angels surround them, mercy covers them, tranquility descends upon them and Allah remembers them before those who are with Him.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "53",
                    "chapterTitle": "باب فَضْلِ الذِّكْرِ",
                    "urn": 1339220,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، عَنْ عَمَّارِ بْنِ رُزَيْقٍ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَغَرِّ أَبِي مُسْلِمٍ، عَنْ أَبِي هُرَيْرَةَ، وَأَبِي، سَعِيدٍ يَشْهَدَانِ بِهِ عَلَى النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَا جَلَسَ قَوْمٌ مَجْلِسًا يَذْكُرُونَ اللَّهَ فِيهِ إِلاَّ حَفَّتْهُمُ الْمَلاَئِكَةُ وَتَغَشَّتْهُمُ الرَّحْمَةُ وَتَنَزَّلَتْ عَلَيْهِمُ السَّكِينَةُ وَذَكَرَهُمُ اللَّهُ فِيمَنْ عِنْدَهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "53.00",
            "hadithNumber": "3792",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "53",
                    "chapterTitle": "The Virtues of Remembrance (Dhikr)",
                    "urn": 1259370,
                    "body": "<p>It was narrated from Abu Hurairah that the Prophet(ﷺ) said:\n\"Allah says: 'I am with My slave when he remembers Me and his lips move saying My Name.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "53",
                    "chapterTitle": "باب فَضْلِ الذِّكْرِ",
                    "urn": 1339230,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا مُحَمَّدُ بْنُ مُصْعَبٍ، عَنِ الأَوْزَاعِيِّ، عَنْ إِسْمَاعِيلَ بْنِ عُبَيْدِ اللَّهِ، عَنْ أُمِّ الدَّرْدَاءِ، عَنْ أَبِي هُرَيْرَةَ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِنَّ اللَّهَ عَزَّ وَجَلَّ يَقُولُ أَنَا مَعَ عَبْدِي إِذَا هُوَ ذَكَرَنِي وَتَحَرَّكَتْ بِي شَفَتَاهُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "53.00",
            "hadithNumber": "3793",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "53",
                    "chapterTitle": "The Virtues of Remembrance (Dhikr)",
                    "urn": 1259380,
                    "body": "<p>It was narrated from Abdullah bin Busr that a Bedouin said to the Messenger of Allah(ﷺ) said:\n\"The laws of Islam are burdensome for me. Tell me of something that I will be able to adhere to. He said: 'Always keep your tongue moist with the remembrance of Allah, the Mighty and Sublime.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "53",
                    "chapterTitle": "باب فَضْلِ الذِّكْرِ",
                    "urn": 1339240,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، أَخْبَرَنِي مُعَاوِيَةُ بْنُ صَالِحٍ، أَخْبَرَنِي عَمْرُو بْنُ قَيْسٍ الْكِنْدِيُّ، عَنْ عَبْدِ اللَّهِ بْنِ بُسْرٍ، أَنَّ أَعْرَابِيًّا، قَالَ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ إِنَّ شَرَائِعَ الإِسْلاَمِ قَدْ كَثُرَتْ عَلَىَّ فَأَنْبِئْنِي مِنْهَا بِشَىْءٍ أَتَشَبَّثُ بِهِ ‏.‏ قَالَ ‏\"‏ لاَ يَزَالُ لِسَانُكَ رَطْبًا مِنْ ذِكْرِ اللَّهِ عَزَّ وَجَلَّ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "54.00",
            "hadithNumber": "3794",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "54",
                    "chapterTitle": "The Virtue of (saying) None has the right to be Worshipped but Allah",
                    "urn": 1259390,
                    "body": "<p>It was narrated from Abu Hurairah and Abu Saeed bore witness that the Messenger of Allah(ﷺ) said:\n\"If a person says: 'La ilaha illallahu wa Allahu Akbar (None has the right to be worshipped but Allah and Allah is the Most Great),'Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, and I am the Most Great.' If a person says: La ilaha Illallah wahdahu (There is none worthy of worship except Allah alone), Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, alone.' If he says, La ilaha illallahu la sharikalahu (There is none worthy of worship except Allah with no partner or associate),' Allah says: 'My slave has spoken the truth; there is none worthy of worship except I, with no partner or associate.' If he says: 'La illah illallah, lahul mulku wa lahul hamdu (There is none worthy of worship except Allah, all dominion is His and all praise is to Him),' Allah says: 'My slave has spoken the truth; there is none of worthy of worship except I, all dominion Mine and all praise is due to Me.' If he says: ' La illaha illallah, la hawla wa la quwwata illa billah (There is none worthy of worship and there is no power and no strength except with Allah),' Allah says: 'My slave has spoken then truth; there is none worthy of worship except I, and tehre is no power and no strength except with Me.' One of the narrators Abu Ishaq said: \"Then Agharr (another narrator) said something that I did not understand. I said to Abu Jafar: 'What did he say?' He said: 'Whoever is blessed with (the ability to say) them (these words) at the time of death, the Fire will not touch him.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "54",
                    "chapterTitle": "باب فَضْلِ لاَ إِلَهَ إِلاَّ اللَّهُ",
                    "urn": 1339250,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا الْحُسَيْنُ بْنُ عَلِيٍّ، عَنْ حَمْزَةَ الزَّيَّاتِ، عَنْ أَبِي إِسْحَاقَ، عَنِ الأَغَرِّ أَبِي مُسْلِمٍ، أَنَّهُ شَهِدَ عَلَى أَبِي هُرَيْرَةَ وَأَبِي سَعِيدٍ أَنَّهُمَا شَهِدَا عَلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ إِذَا قَالَ الْعَبْدُ لاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ ‏.‏ قَالَ يَقُولُ اللَّهُ عَزَّ وَجَلَّ صَدَقَ عَبْدِي لاَ إِلَهَ إِلاَّ أَنَا وَأَنَا أَكْبَرُ ‏.‏ وَإِذَا قَالَ الْعَبْدُ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ ‏.‏ قَالَ صَدَقَ عَبْدِي لاَ إِلَهَ إِلاَّ أَنَا وَحْدِي ‏.‏ وَإِذَا قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ لاَ شَرِيكَ لَهُ ‏.‏ قَالَ صَدَقَ عَبْدِي لاَ إِلَهَ إِلاَّ أَنَا وَلاَ شَرِيكَ لِي ‏.‏ وَإِذَا قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ ‏.‏ قَالَ صَدَقَ عَبْدِي لاَ إِلَهَ إِلاَّ أَنَا لِيَ الْمُلْكُ وَلِيَ الْحَمْدُ ‏.‏ وَإِذَا قَالَ لاَ إِلَهَ إِلاَّ اللَّهُ وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏.‏ قَالَ صَدَقَ عَبْدِي لاَ إِلَهَ إِلاَّ أَنَا وَلاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِي ‏\"‏ ‏.‏ قَالَ أَبُو إِسْحَاقَ ثُمَّ قَالَ الأَغَرُّ شَيْئًا لَمْ أَفْهَمْهُ ‏.‏ قَالَ فَقُلْتُ لأَبِي جَعْفَرٍ مَا قَالَ فَقَالَ مَنْ رُزِقَهُنَّ عِنْدَ مَوْتِهِ لَمْ تَمَسَّهُ النَّارُ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "54.00",
            "hadithNumber": "3795",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "54",
                    "chapterTitle": "The Virtue of (saying) None has the right to be Worshipped but Allah",
                    "urn": 1259400,
                    "body": "<p>It was narrated from Yahya bin Talha that :\nhis mother Su'da Al-Murriyyah said: \"Umar bin Khattab passed by Talhah, after the Messenger of Allah(ﷺ) had died, and said: 'Why do you look so sad? Are you upset because your cousin has been appointed leader?' He said: 'No, but I heard the Messenger of Allah(ﷺ) say: \"I know a word which no one says at the time of death but it will be light in his record of deeds, and his body and soul will find comfort in it at the time of death,\" -but I did not ask him about it before he died.' He ('Umar) said: ' I know what it is. It is what he wanted his uncle (Abu Talib) to say, and if he had known anything that would be more effective in saving him, he would have told him to say it.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "54",
                    "chapterTitle": "باب فَضْلِ لاَ إِلَهَ إِلاَّ اللَّهُ",
                    "urn": 1339260,
                    "body": "<p>حَدَّثَنَا هَارُونُ بْنُ إِسْحَاقَ الْهَمْدَانِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الْوَهَّابِ، عَنْ مِسْعَرٍ، عَنْ إِسْمَاعِيلَ بْنِ أَبِي خَالِدٍ، عَنِ الشَّعْبِيِّ، عَنْ يَحْيَى بْنِ طَلْحَةَ، عَنْ أُمِّهِ، سُعْدَى الْمُرِّيَّةِ قَالَتْ مَرَّ عُمَرُ بِطَلْحَةَ بَعْدَ وَفَاةِ رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقَالَ مَا لَكَ مُكْتَئِبًا أَسَاءَتْكَ إِمْرَةُ ابْنِ عَمِّكَ قَالَ لاَ وَلَكِنْ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ إِنِّي لأَعْلَمُ كَلِمَةً لاَ يَقُولُهَا أَحَدٌ عِنْدَ مَوْتِهِ إِلاَّ كَانَتْ نُورًا لِصَحِيفَتِهِ وَإِنَّ جَسَدَهُ وَرُوحَهُ لَيَجِدَانِ لَهَا رَوْحًا عِنْدَ الْمَوْتِ ‏\"‏ ‏.‏ فَلَمْ أَسْأَلْهُ حَتَّى تُوُفِّيَ ‏.‏ قَالَ أَنَا أَعْلَمُهَا هِيَ الَّتِي أَرَادَ عَمَّهُ عَلَيْهَا وَلَوْ عَلِمَ أَنَّ شَيْئًا أَنْجَى لَهُ مِنْهَا لأَمَرَهُ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "54.00",
            "hadithNumber": "3796",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "54",
                    "chapterTitle": "The Virtue of (saying) None has the right to be Worshipped but Allah",
                    "urn": 1259410,
                    "body": "<p>It was narrated from Mu'adh bin Jabal that the :\nMessenger of Allah(ﷺ) said: \"There is no soul that died bearing witness to La ilaha illallah, and that I am the Messenger of Allah, from the heart with certainity, but Allah will forgive it.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "54",
                    "chapterTitle": "باب فَضْلِ لاَ إِلَهَ إِلاَّ اللَّهُ",
                    "urn": 1339270,
                    "body": "<p>حَدَّثَنَا عَبْدُ الْحَمِيدِ بْنُ بَيَانٍ الْوَاسِطِيُّ، حَدَّثَنَا خَالِدُ بْنُ عَبْدِ اللَّهِ، عَنْ يُونُسَ، عَنْ حُمَيْدِ بْنِ هِلاَلٍ، عَنْ هِصَّانَ بْنِ الْكَاهِلِ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ سَمُرَةَ، عَنْ مُعَاذِ بْنِ جَبَلٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَا مِنْ نَفْسٍ تَمُوتُ تَشْهَدُ أَنْ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَنِّي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ يَرْجِعُ ذَلِكَ إِلَى قَلْبٍ مُوقِنٍ إِلاَّ غَفَرَ اللَّهُ لَهَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "54.00",
            "hadithNumber": "3797",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "54",
                    "chapterTitle": "The Virtue of (saying) None has the right to be Worshipped but Allah",
                    "urn": 1259420,
                    "body": "<p>It was narrated that Umm Hani' said:\n\"The Messenger of Allah(ﷺ) said: (About saying) La ilaha illah - no deed takes precedence over it and it does not leave any sin.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "54",
                    "chapterTitle": "باب فَضْلِ لاَ إِلَهَ إِلاَّ اللَّهُ",
                    "urn": 1339280,
                    "body": "<p>حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا زَكَرِيَّا بْنُ مَنْظُورٍ، حَدَّثَنِي مُحَمَّدُ بْنُ عُقْبَةَ، عَنْ أُمِّ هَانِئٍ، قَالَتْ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ لاَ إِلَهَ إِلاَّ اللَّهُ لاَ يَسْبِقُهَا عَمَلٌ وَلاَ تَتْرُكُ ذَنْبًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "54.00",
            "hadithNumber": "3798",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "54",
                    "chapterTitle": "The Virtue of (saying) None has the right to be Worshipped but Allah",
                    "urn": 1259430,
                    "body": "<p>It was narrated from Abu Hurairah that :\nthe Messenger of Allah(ﷺ) said: \"Whoever says one hundered times each day: La ilaha illahu wahdahu la sharikalahu, wa lahul-mulku wa lahul hamduwa huwa ala kulli shayin qadeer (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion, all praise is to Him, and He is able to do all things), it will be equivalent to him freeing ten slaves, and one hundered merits will be recorded for him, and one hundered bad deeds will be erased from (his record), and it will be a protection for him against Satan all day until night comes. No one can do anything better then him except one who says more.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "54",
                    "chapterTitle": "باب فَضْلِ لاَ إِلَهَ إِلاَّ اللَّهُ",
                    "urn": 1339290,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرٍ، حَدَّثَنَا زَيْدُ بْنُ الْحُبَابِ، عَنْ مَالِكِ بْنِ أَنَسٍ، أَخْبَرَنِي سُمَىٌّ، مَوْلَى أَبِي بَكْرٍ عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ قَالَ فِي يَوْمٍ مِائَةَ مَرَّةٍ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ كَانَ لَهُ عَدْلَ عَشْرِ رِقَابٍ وَكُتِبَتْ لَهُ مِائَةُ حَسَنَةٍ وَمُحِيَ عَنْهُ مِائَةُ سَيِّئَةٍ وَكُنَّ لَهُ حِرْزًا مِنَ الشَّيْطَانِ سَائِرَ يَوْمِهِ إِلَى اللَّيْلِ وَلَمْ يَأْتِ أَحَدٌ بِأَفْضَلَ مِمَّا أَتَى بِهِ إِلاَّ مَنْ قَالَ أَكْثَرَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "54.00",
            "hadithNumber": "3799",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "54",
                    "chapterTitle": "The Virtue of (saying) None has the right to be Worshipped but Allah",
                    "urn": 1259440,
                    "body": "<p>It was narrated from Abu Saeed that :\nthe Prophet(ﷺ) said: \"Whoever says, following the morning prayer: La ilaha illallahu wahdahu la sahrikalau, lahul mulku wa lahul hamdu, bi yadihil khair, wa huwa ala kulli shay'in qadir (None has the right to be worshipped but Allah alone, with no partner or associate. His is the dominion, all praise is to Him, in His Hand is all goodness, and He is Able to do all things), it will be as if he freed slave from among the sons of Isma'il.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "54",
                    "chapterTitle": "باب فَضْلِ لاَ إِلَهَ إِلاَّ اللَّهُ",
                    "urn": 1339300,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا بَكْرُ بْنُ عَبْدِ الرَّحْمَنِ، حَدَّثَنَا عِيسَى بْنُ الْمُخْتَارِ، عَنْ مُحَمَّدِ بْنِ أَبِي لَيْلَى، عَنْ عَطِيَّةَ الْعَوْفِيِّ، عَنْ أَبِي سَعِيدٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ قَالَ فِي دُبُرِ صَلاَةِ الْغَدَاةِ لاَ إِلَهَ إِلاَّ اللَّهُ وَحْدَهُ لاَ شَرِيكَ لَهُ لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ بِيَدِهِ الْخَيْرُ وَهُوَ عَلَى كُلِّ شَىْءٍ قَدِيرٌ - كَانَ كَعَتَاقِ رَقَبَةٍ مِنْ وَلَدِ إِسْمَاعِيلَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "55.00",
            "hadithNumber": "3800",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "55",
                    "chapterTitle": "The Virtue Of Those Who Praise Allah",
                    "urn": 1259450,
                    "body": "<p>Jabir bin 'Abdullah said:\n\"I heard the Messenger of Allah (ﷺ) say: 'The best of remembrance is La ilaha illallah (None has the right to be worshipped but Allah), and the best of supplication is Al-Hamdu Lillah (praise is to Allah).'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "55",
                    "chapterTitle": "باب فَضْلِ الْحَامِدِينَ",
                    "urn": 1339310,
                    "body": "<p>حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ إِبْرَاهِيمَ الدِّمَشْقِيُّ، حَدَّثَنَا مُوسَى بْنُ إِبْرَاهِيمَ بْنِ كَثِيرِ بْنِ بَشِيرِ بْنِ الْفَاكِهِ، قَالَ سَمِعْتُ طَلْحَةَ بْنَ خِرَاشٍ ابْنَ عَمِّ، جَابِرٍ قَالَ سَمِعْتُ جَابِرَ بْنَ عَبْدِ اللَّهِ، يَقُولُ سَمِعْتُ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ يَقُولُ ‏\"‏ أَفْضَلُ الذِّكْرِ لاَ إِلَهَ إِلاَّ اللَّهُ وَأَفْضَلُ الدُّعَاءِ الْحَمْدُ لِلَّهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "55.00",
            "hadithNumber": "3801",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "55",
                    "chapterTitle": "The Virtue Of Those Who Praise Allah",
                    "urn": 1259460,
                    "body": "<p>It was narrated from 'Abdullah bin 'Umar that :\nthe Messenger of Allah (ﷺ) told them: \"One of the slaves of Allah said: 'Ya Rabb! Lakal-hamdu kama yanbagi li-jalali Wajhika wa li 'azima sultanika (O Lord, to You is praise as befits the Glory of Your Face and the greatness of Your Might.)' The angels were uncertain and did not know how to write this down, so they ascended to heaven and said: 'O our Lord, Your slave has said a word that we do not know how to write down.' Allah said - and He knows best what His slave said - 'What did My slave say?' They said: 'O Lord, he said \"Ya Rabb! Lakal-hamdu kama yanbagi li-jalali Wajhika wa li'azima sultanika (O Lord, to You is praise as befits the Glory of Your Face and the greatness of your Might).'\" Allah said to them: 'Write it down as My slave said it, until he meets Me and I shall reward him for it.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "55",
                    "chapterTitle": "باب فَضْلِ الْحَامِدِينَ",
                    "urn": 1339320,
                    "body": "<p>حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا صَدَقَةُ بْنُ بَشِيرٍ، مَوْلَى الْعُمَرِيِّينَ قَالَ سَمِعْتُ قُدَامَةَ بْنَ إِبْرَاهِيمَ الْجُمَحِيَّ، يُحَدِّثُ أَنَّهُ كَانَ يَخْتَلِفُ إِلَى عَبْدِ اللَّهِ بْنِ عُمَرَ بْنِ الْخَطَّابِ وَهُوَ غُلاَمٌ وَعَلَيْهِ ثَوْبَانِ مُعَصْفَرَانِ قَالَ فَحَدَّثَنَا عَبْدُ اللَّهِ بْنُ عُمَرَ أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ حَدَّثَهُمْ ‏\"‏ أَنَّ عَبْدًا مِنْ عِبَادِ اللَّهِ قَالَ يَا رَبِّ لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلاَلِ وَجْهِكَ وَلِعَظِيمِ سُلْطَانِكَ فَعَضَّلَتْ بِالْمَلَكَيْنِ فَلَمْ يَدْرِيَا كَيْفَ يَكْتُبَانِهَا فَصَعِدَا إِلَى السَّمَاءِ وَقَالاَ يَا رَبَّنَا إِنَّ عَبْدَكَ قَدْ قَالَ مَقَالَةً لاَ نَدْرِي كَيْفَ نَكْتُبُهَا ‏.‏ قَالَ اللَّهُ عَزَّ وَجَلَّ وَهُوَ أَعْلَمُ بِمَا قَالَ عَبْدُهُ مَاذَا قَالَ عَبْدِي قَالاَ يَا رَبِّ إِنَّهُ قَالَ يَا رَبِّ لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلاَلِ وَجْهِكَ وَعَظِيمِ سُلْطَانِكَ ‏.‏ فَقَالَ اللَّهُ عَزَّ وَجَلَّ لَهُمَا اكْتُبَاهَا كَمَا قَالَ عَبْدِي حَتَّى يَلْقَانِي فَأَجْزِيَهُ بِهَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "55.00",
            "hadithNumber": "3802",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "55",
                    "chapterTitle": "The Virtue Of Those Who Praise Allah",
                    "urn": 1259470,
                    "body": "<p>It was narrated from 'Abdul-Jabbar bin Wa'il that :\nhis father said: \"I prayed with the Prophet (ﷺ) and a man said: 'Alhamdu lillahi hamdan kathiran tayyiban mubarakan fihi (Praise is to Allah, much, good and blessed praise).' When the Prophet (ﷺ) finished praying, he said: 'Who said that?' The man said: 'It was me, but I did not mean anything but good.' He said: 'The gates of heaven were opened because of it and nothing prevented it from reaching the Throne.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "55",
                    "chapterTitle": "باب فَضْلِ الْحَامِدِينَ",
                    "urn": 1339330,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا يَحْيَى بْنُ آدَمَ، حَدَّثَنَا إِسْرَائِيلُ، عَنْ أَبِي إِسْحَاقَ، عَنْ عَبْدِ الْجَبَّارِ بْنِ وَائِلٍ، عَنْ أَبِيهِ، قَالَ صَلَّيْتُ مَعَ النَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ رَجُلٌ الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ ‏.‏ فَلَمَّا صَلَّى النَّبِيُّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ مَنْ ذَا الَّذِي قَالَ هَذَا ‏\"‏ ‏.‏ قَالَ الرَّجُلُ أَنَا وَمَا أَرَدْتُ إِلاَّ الْخَيْرَ ‏.‏ فَقَالَ ‏\"‏ لَقَدْ فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ فَمَا نَهْنَهَهَا شَىْءٌ دُونَ الْعَرْشِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "55.00",
            "hadithNumber": "3803",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "55",
                    "chapterTitle": "The Virtue Of Those Who Praise Allah",
                    "urn": 1259480,
                    "body": "<p>It was narrated that 'Aishah said:\n\"When the Messenger of Allah (ﷺ) saw something he liked, he would say: 'Al-hamdu lillahil-ladhi bi ni'matihi tatimmus-salihat (Praise is to Allah by Whose grace good deeds are completed).' And if he saw something that he disliked, he would say: 'Al-hamdu lillahi 'ala kulli hal (Praise is to Allah in all circumstances).'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "55",
                    "chapterTitle": "باب فَضْلِ الْحَامِدِينَ",
                    "urn": 1339340,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ خَالِدٍ الأَزْرَقُ أَبُو مَرْوَانَ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا زُهَيْرُ بْنُ مُحَمَّدٍ، عَنْ مَنْصُورِ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أُمِّهِ، صَفِيَّةَ بِنْتِ شَيْبَةَ عَنْ عَائِشَةَ، قَالَتْ كَانَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ إِذَا رَأَى مَا يُحِبُّ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ الَّذِي بِنِعْمَتِهِ تَتِمُّ الصَّالِحَاتُ ‏\"‏ ‏.‏ وَإِذَا رَأَى مَا يَكْرَهُ قَالَ ‏\"‏ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "55.00",
            "hadithNumber": "3804",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "55",
                    "chapterTitle": "The Virtue Of Those Who Praise Allah",
                    "urn": 1259490,
                    "body": "<p>It was narratd from Abu Hurairah that :\nthe Prophet (ﷺ) used to say: \"Al-hamdu lillahi 'ala kulli hal. Rabbi a'udhu bika min hali ahlin-nar (Praise is to Allah in all circumstances, O Allah, I seek refuge with You from the situation of the people of Hell).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "55",
                    "chapterTitle": "باب فَضْلِ الْحَامِدِينَ",
                    "urn": 1339350,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ مُوسَى بْنِ عُبَيْدَةَ، عَنْ مُحَمَّدِ بْنِ ثَابِتٍ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَقُولُ ‏\"‏ الْحَمْدُ لِلَّهِ عَلَى كُلِّ حَالٍ رَبِّ أَعُوذُ بِكَ مِنْ حَالِ أَهْلِ النَّارِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "55.00",
            "hadithNumber": "3805",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "55",
                    "chapterTitle": "The Virtue Of Those Who Praise Allah",
                    "urn": 1259500,
                    "body": "<p>It was narrated from Anas that :\nthe Messenger of Allah (ﷺ) said: 'Allah does not bestow a blessing upon any slave and he says: 'Al-hamdu Lillah (praise is to Allah),' except that what he gives (the praise) is better than what he received (the blessing).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "55",
                    "chapterTitle": "باب فَضْلِ الْحَامِدِينَ",
                    "urn": 1339360,
                    "body": "<p>حَدَّثَنَا الْحَسَنُ بْنُ عَلِيٍّ الْخَلاَّلُ، حَدَّثَنَا أَبُو عَاصِمٍ، عَنْ شَبِيبِ بْنِ بِشْرٍ، عَنْ أَنَسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَا أَنْعَمَ اللَّهُ عَلَى عَبْدٍ نِعْمَةً فَقَالَ الْحَمْدُ لِلَّهِ ‏.‏ إِلاَّ كَانَ الَّذِي أَعْطَاهُ أَفْضَلَ مِمَّا أَخَذَ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "56.00",
            "hadithNumber": "3806",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "56",
                    "chapterTitle": "The Virtue Of Glorifying Allah",
                    "urn": 1259510,
                    "body": "<p>It was narrated from Abu Hurairah that :\nthe Messenger of Allah (ﷺ) said: 'Two words which are light on the tongue and heavy in the Balance, and beloved to the Most Merciful: Subhan-Allah wa bi hamdihi, Subhan-Allahil-'Azim (Glory and praise is to Allah, glory is to Allah the Almighty).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "56",
                    "chapterTitle": "باب فَضْلِ التَّسْبِيحِ",
                    "urn": 1339370,
                    "body": "<p>حَدَّثَنَا أَبُو بِشْرٍ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا مُحَمَّدُ بْنُ فُضَيْلٍ، عَنْ عُمَارَةَ بْنِ الْقَعْقَاعِ، عَنْ أَبِي زُرْعَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ كَلِمَتَانِ خَفِيفَتَانِ عَلَى اللِّسَانِ ثَقِيلَتَانِ فِي الْمِيزَانِ حَبِيبَتَانِ إِلَى الرَّحْمَنِ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ سُبْحَانَ اللَّهِ الْعَظِيمِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "56.00",
            "hadithNumber": "3807",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "56",
                    "chapterTitle": "The Virtue Of Glorifying Allah",
                    "urn": 1259520,
                    "body": "<p>It was narrated from Abu Hurairah that :\nthe Messenger of Allah (ﷺ) passed by him when he was planting a plant, and said: \"O Abu Hurairah, what are you planting?\" I said: \"A plant for me.\" He said: \"Shall I not tell you of a plant that is better than this?\" He said: \"Of course, O Messenger of Allah.\" He said: \"Say: 'Subhan-Allah, wal-hamdu-lillah, wa la ilaha illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah and Allah is the Most Great.)' For each one a tree will be planted for you in Paradise.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "56",
                    "chapterTitle": "باب فَضْلِ التَّسْبِيحِ",
                    "urn": 1339380,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا عَفَّانُ، حَدَّثَنَا حَمَّادُ بْنُ سَلَمَةَ، عَنْ أَبِي سِنَانٍ، عَنْ عُثْمَانَ بْنِ أَبِي سَوْدَةَ، عَنْ أَبِي هُرَيْرَةَ، أَنَّ رَسُولَ اللَّهِ ـ صلى الله عليه وسلم ـ مَرَّ بِهِ وَهُوَ يَغْرِسُ غَرْسًا فَقَالَ ‏\"‏ يَا أَبَا هُرَيْرَةَ مَا الَّذِي تَغْرِسُ ‏\"‏ ‏.‏ قُلْتُ غِرَاسًا لِي ‏.‏ قَالَ ‏\"‏ أَلاَ أَدُلُّكَ عَلَى غِرَاسٍ خَيْرٍ لَكَ مِنْ هَذَا ‏\"‏ ‏.‏ قَالَ بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ قُلْ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ يُغْرَسْ لَكَ بِكُلِّ وَاحِدَةٍ شَجَرَةٌ فِي الْجَنَّةِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "56.00",
            "hadithNumber": "3808",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "56",
                    "chapterTitle": "The Virtue Of Glorifying Allah",
                    "urn": 1259530,
                    "body": "<p>It was narrated that Juwairiyah said:\n\"The Messenger of Allah (ﷺ) passed by her when he prayed the morning prayer, or after he prayed the morning prayer, and she was remembering Allah. He came back when the sun had risen\" - or he (one of the narrators) said, \"at midday - and she was still doing that. He said: 'I have said four words, three times, since I left you, and they are greater and weigh more heavily than what you have said. They are: Subhan-Allahi 'adada khalqiha, Subhan-Allahi rida nafsihi, Subhan-Allahi zinata 'arshihi, Subhan-Allah midada kalimatihi (Glory is to Allah, as much as the number of His creation, glory is to Allah as much as pleases Him, glory is to Allah as much as the weight of His Throne, glory is to Allah as much as the ink of His words'.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "56",
                    "chapterTitle": "باب فَضْلِ التَّسْبِيحِ",
                    "urn": 1339390,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، حَدَّثَنَا مِسْعَرٌ، حَدَّثَنِي مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي رِشْدِينَ، عَنِ ابْنِ عَبَّاسٍ، عَنْ جُوَيْرِيَةَ، قَالَتْ مَرَّ بِهَا رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ حِينَ صَلَّى الْغَدَاةَ أَوْ بَعْدَ مَا صَلَّى الْغَدَاةَ وَهِيَ تَذْكُرُ اللَّهَ فَرَجَعَ حِينَ ارْتَفَعَ النَّهَارُ - أَوْ قَالَ انْتَصَفَ - وَهِيَ كَذَلِكَ فَقَالَ ‏\"‏ لَقَدْ قُلْتُ مُنْذُ قُمْتُ عَنْكِ أَرْبَعَ كَلِمَاتٍ ثَلاَثَ مَرَّاتٍ هِيَ أَكْثَرُ وَأَرْجَحُ - أَوْ أَوْزَنُ - مِمَّا قُلْتِ سُبْحَانَ اللَّهِ عَدَدَ خَلْقِهِ سُبْحَانَ اللَّهِ رِضَا نَفْسِهِ سُبْحَانَ اللَّهِ زِنَةَ عَرْشِهِ سُبْحَانَ اللَّهِ مِدَادَ كَلِمَاتِهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "56.00",
            "hadithNumber": "3809",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "56",
                    "chapterTitle": "The Virtue Of Glorifying Allah",
                    "urn": 1259540,
                    "body": "<p>It was narrated from Nu'man bin Bashir that :\nthe Messenger of Allah (ﷺ) said: \"What you mention of glory of Allah, of Tabsih (Subhan-Allah), Tahlil (Allahu-Akbar) and Tahmid (Al-Hamdu lillah), revolves around the Throne, buzzing like bees, reminding of the one who said it. Wouldn't any one of you like to have, or continue to have, something that reminds of him (in the presence of Allah)?'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "56",
                    "chapterTitle": "باب فَضْلِ التَّسْبِيحِ",
                    "urn": 1339400,
                    "body": "<p>حَدَّثَنَا أَبُو بِشْرٍ، بَكْرُ بْنُ خَلَفٍ حَدَّثَنِي يَحْيَى بْنُ سَعِيدٍ، عَنْ مُوسَى بْنِ أَبِي عِيسَى الطَّحَّانِ، عَنْ عَوْنِ بْنِ عَبْدِ اللَّهِ، عَنْ أَبِيهِ، أَوْ عَنْ أَخِيهِ، عَنِ النُّعْمَانِ بْنِ بَشِيرٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنَّ مِمَّا تَذْكُرُونَ مِنْ جَلاَلِ اللَّهِ التَّسْبِيحَ وَالتَّهْلِيلَ وَالتَّحْمِيدَ يَنْعَطِفْنَ حَوْلَ الْعَرْشِ لَهُنَّ دَوِيٌّ كَدَوِيِّ النَّحْلِ تُذَكِّرُ بِصَاحِبِهَا أَمَا يُحِبُّ أَحَدُكُمْ أَنْ يَكُونَ لَهُ - أَوْ لاَ يَزَالَ لَهُ - مَنْ يُذَكِّرُ بِهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "56.00",
            "hadithNumber": "3810",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "56",
                    "chapterTitle": "The Virtue Of Glorifying Allah",
                    "urn": 1259550,
                    "body": "<p>It was narrated that Umm Hani' said:\n\"I came to the Messenger of Allah (ﷺ) and said: 'O Messenger of Allah, tell me of a (good) deed, for I have become old and weak and overweight.' He said: 'Proclaim the greatness of Allah (say Allahu Akbar) one hundred times, praise Allah (say Al-Hamdu Lillah) one hundred times, and glorify Allah (say Subhan-Allah) one hundred times. (That is) better than one hundred horses bridled and saddled for the sake of Allah, better than one hundred sacrificial camels, and better than (freeing) one hundred slaves.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "56",
                    "chapterTitle": "باب فَضْلِ التَّسْبِيحِ",
                    "urn": 1339410,
                    "body": "<p>حَدَّثَنَا إِبْرَاهِيمُ بْنُ الْمُنْذِرِ الْحِزَامِيُّ، حَدَّثَنَا أَبُو يَحْيَى، زَكَرِيَّا بْنُ مَنْظُورٍ حَدَّثَنِي مُحَمَّدُ بْنُ عُقْبَةَ بْنِ أَبِي مَالِكٍ، عَنْ أُمِّ هَانِئٍ، قَالَتْ أَتَيْتُ إِلَى رَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فَقُلْتُ يَا رَسُولَ اللَّهِ دُلَّنِي عَلَى عَمَلٍ فَإِنِّي قَدْ كَبِرْتُ وَضَعُفْتُ وَبَدَّنْتُ ‏.‏ فَقَالَ ‏\"‏ كَبِّرِي اللَّهَ مِائَةَ مَرَّةٍ وَاحْمَدِي اللَّهَ مِائَةَ مَرَّةٍ وَسَبِّحِي اللَّهَ مِائَةَ مَرَّةٍ خَيْرٌ مِنْ مِائَةِ فَرَسٍ مُلْجَمٍ مُسْرَجٍ فِي سَبِيلِ اللَّهِ وَخَيْرٌ مِنْ مِائَةِ بَدَنَةٍ وَخَيْرٌ مِنْ مِائَةِ رَقَبَةٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "56.00",
            "hadithNumber": "3811",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "56",
                    "chapterTitle": "The Virtue Of Glorifying Allah",
                    "urn": 1259560,
                    "body": "<p>It was narrated from Samurah bin Jundab that :\nthe Prophet (ﷺ) said: \"(There are) four that are the best of words, and it does not matter with which you begin: Subhan-Allah, wal-Hamdu-Lillah, wa la ilaha illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah and Allah is the Most Great).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "56",
                    "chapterTitle": "باب فَضْلِ التَّسْبِيحِ",
                    "urn": 1339420,
                    "body": "<p>حَدَّثَنَا أَبُو عُمَرَ، حَفْصُ بْنُ عَمْرٍو حَدَّثَنَا عَبْدُ الرَّحْمَنِ بْنُ مَهْدِيٍّ، حَدَّثَنَا سُفْيَانُ، عَنْ سَلَمَةَ بْنِ كُهَيْلٍ، عَنْ هِلاَلِ بْنِ يِسَافٍ، عَنْ سَمُرَةَ بْنِ جُنْدَبٍ، عَنِ النَّبِيِّ ـ صلى الله عليه وسلم ـ قَالَ ‏\"‏ أَرْبَعٌ أَفْضَلُ الْكَلاَمِ لاَ يَضُرُّكَ بِأَيِّهِنَّ بَدَأْتَ سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "56.00",
            "hadithNumber": "3812",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "56",
                    "chapterTitle": "The Virtue Of Glorifying Allah",
                    "urn": 1259570,
                    "body": "<p>It was narrated from Abu Hurairah that :\nthe Messenger of Allah (ﷺ) said: \"Whoever says: Subhan Allahi wa bi hamdihi (Glory and praise is to Allah) one hundred times, his sins will be forgiven even if they were like the foam of the sea.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "56",
                    "chapterTitle": "باب فَضْلِ التَّسْبِيحِ",
                    "urn": 1339430,
                    "body": "<p>حَدَّثَنَا نَصْرُ بْنُ عَبْدِ الرَّحْمَنِ الْوَشَّاءُ، حَدَّثَنَا عَبْدُ الرَّحْمَنِ الْمُحَارِبِيُّ، عَنْ مَالِكِ بْنِ أَنَسٍ، عَنْ سُمَىٍّ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ قَالَ سُبْحَانَ اللَّهِ وَبِحَمْدِهِ مِائَةَ مَرَّةٍ غُفِرَتْ لَهُ ذُنُوبُهُ وَلَوْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "56.00",
            "hadithNumber": "3813",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "56",
                    "chapterTitle": "The Virtue Of Glorifying Allah",
                    "urn": 1259580,
                    "body": "<p>It was narrated that Abu Darda' said:\n\"The Messenger of Allah (ﷺ) said to me: 'You should recite Subhan-Allah, wal-Hamdu-Lillah, wa la ilahah illallah, wa Allahu Akbar (Glory is to Allah, praise is to Allah, none has the right to be worshiped but Allah, and Allah is the Most Great), for it sheds sins like the tree sheds its leaves.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "56",
                    "chapterTitle": "باب فَضْلِ التَّسْبِيحِ",
                    "urn": 1339440,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنْ عُمَرَ بْنِ رَاشِدٍ، عَنْ يَحْيَى بْنِ أَبِي كَثِيرٍ، عَنْ أَبِي سَلَمَةَ بْنِ عَبْدِ الرَّحْمَنِ، عَنْ أَبِي الدَّرْدَاءِ، قَالَ قَالَ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ عَلَيْكَ بِسُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ وَلاَ إِلَهَ إِلاَّ اللَّهُ وَاللَّهُ أَكْبَرُ فَإِنَّهَا - يَعْنِي - يَحْطُطْنَ الْخَطَايَا كَمَا تَحُطُّ الشَّجَرَةُ وَرَقَهَا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "57.00",
            "hadithNumber": "3814",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "57",
                    "chapterTitle": "Seeking Forgiveness",
                    "urn": 1259590,
                    "body": "<p>It was narrated that Ibn `Umar said:\n\"We used to count that the Messenger of Allah (ﷺ) said one hundred times in a gathering: 'Rabbighfirli wa tub `alayya innaka Antat-Tawwabur-Rahim (O Allah forgive me and accept my repentance, for You are the Accepter of repentance, the Most Merciful).'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "57",
                    "chapterTitle": "باب الاِسْتِغْفَارِ",
                    "urn": 1339450,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو أُسَامَةَ، وَالْمُحَارِبِيُّ، عَنْ مَالِكِ بْنِ مِغْوَلٍ، عَنْ مُحَمَّدِ بْنِ سُوقَةَ، عَنْ نَافِعٍ، عَنِ ابْنِ عُمَرَ، قَالَ إِنْ كُنَّا لَنَعُدُّ لِرَسُولِ اللَّهِ ـ صلى الله عليه وسلم ـ فِي الْمَجْلِسِ يَقُولُ ‏\"‏ رَبِّ اغْفِرْ لِي وَتُبْ عَلَىَّ إِنَّكَ أَنْتَ التَّوَّابُ الرَّحِيمُ ‏\"‏ ‏.‏ مِائَةَ مَرَّةٍ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "57.00",
            "hadithNumber": "3815",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "57",
                    "chapterTitle": "Seeking Forgiveness",
                    "urn": 1259600,
                    "body": "<p>It was narrated from Abu Hurairah that :\nthe Messenger of Allah (saas) said: 'I seek the forgiveness of Allah and repent to Him one hundred times each day.'</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "57",
                    "chapterTitle": "باب الاِسْتِغْفَارِ",
                    "urn": 1339460,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا مُحَمَّدُ بْنُ بِشْرٍ، عَنْ مُحَمَّدِ بْنِ عَمْرٍو، عَنْ أَبِي سَلَمَةَ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنِّي لأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ مِائَةَ مَرَّةٍ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "57.00",
            "hadithNumber": "3816",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "57",
                    "chapterTitle": "Seeking Forgiveness",
                    "urn": 1259610,
                    "body": "<p>It was narrated from Sa'eed bin Abu Burdah bin Abu Musa, from his father, that :\nhis grandfather said: \"The Messenger of Allah (saas) said: 'I seek the forgivenenss of Allah and repent to Him seventy times each day.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "57",
                    "chapterTitle": "باب الاِسْتِغْفَارِ",
                    "urn": 1339470,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنْ مُغِيرَةَ بْنِ أَبِي الْحُرِّ، عَنْ سَعِيدِ بْنِ أَبِي بُرْدَةَ بْنِ أَبِي مُوسَى، عَنْ أَبِيهِ، عَنْ جَدِّهِ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ إِنِّي لأَسْتَغْفِرُ اللَّهَ وَأَتُوبُ إِلَيْهِ فِي الْيَوْمِ سَبْعِينَ مَرَّةً ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "57.00",
            "hadithNumber": "3817",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "57",
                    "chapterTitle": "Seeking Forgiveness",
                    "urn": 1259620,
                    "body": "<p>It was narrated that Hudhaifah said:\n\"I was harsh in the way I spoke to my family, but not to others. I mentioned that to the Prophet (saas) and he said: 'Why don't you ask for forgiveness? Ask Allah to forgive you, seventy times each day.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "57",
                    "chapterTitle": "باب الاِسْتِغْفَارِ",
                    "urn": 1339480,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا أَبُو بَكْرِ بْنُ عَيَّاشٍ، عَنْ أَبِي إِسْحَاقَ، عَنْ أَبِي الْمُغِيرَةِ، عَنْ حُذَيْفَةَ، قَالَ كَانَ فِي لِسَانِي ذَرَبٌ عَلَى أَهْلِي وَكَانَ لاَ يَعْدُوهُمْ إِلَى غَيْرِهِمْ فَذَكَرْتُ ذَلِكَ لِلنَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ ‏\"‏ أَيْنَ أَنْتَ مِنَ الاِسْتِغْفَارِ تَسْتَغْفِرُ اللَّهَ فِي الْيَوْمِ سَبْعِينَ مَرَّةً ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "57.00",
            "hadithNumber": "3818",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "57",
                    "chapterTitle": "Seeking Forgiveness",
                    "urn": 1259630,
                    "body": "<p>'Abdullah bin Busr said that :\nthe Prophet (saas) said: \"Glad tidings to those who find a lot of seeking forgiveness in the record of their deeds.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "57",
                    "chapterTitle": "باب الاِسْتِغْفَارِ",
                    "urn": 1339490,
                    "body": "<p>حَدَّثَنَا عَمْرُو بْنُ عُثْمَانَ بْنِ سَعِيدِ بْنِ كَثِيرِ بْنِ دِينَارٍ الْحِمْصِيُّ، حَدَّثَنَا أَبِي، حَدَّثَنَا مُحَمَّدُ بْنُ عَبْدِ الرَّحْمَنِ بْنِ عِرْقٍ، سَمِعْتُ عَبْدَ اللَّهِ بْنَ بُسْرٍ، يَقُولُ قَالَ النَّبِيُّ ـ صلى الله عليه وسلم ـ ‏\"‏ طُوبَى لِمَنْ وَجَدَ فِي صَحِيفَتِهِ اسْتِغْفَارًا كَثِيرًا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "57.00",
            "hadithNumber": "3819",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "57",
                    "chapterTitle": "Seeking Forgiveness",
                    "urn": 1259640,
                    "body": "<p>It was narrated from 'Abdullah bin 'Abbas that :\nthe Messenger of Allah (ﷺ) said: \"Whoever persists in asking for forgiveness, Allah will grant him relief from every worry, and a way out from every hardship, and will grant him provision from (sources) he could never imagine.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Da'if"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "57",
                    "chapterTitle": "باب الاِسْتِغْفَارِ",
                    "urn": 1339500,
                    "body": "<p>حَدَّثَنَا هِشَامُ بْنُ عَمَّارٍ، حَدَّثَنَا الْوَلِيدُ بْنُ مُسْلِمٍ، حَدَّثَنَا الْحَكَمُ بْنُ مُصْعَبٍ، عَنْ مُحَمَّدِ بْنِ عَلِيِّ بْنِ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، أَنَّهُ حَدَّثَهُ عَنْ عَبْدِ اللَّهِ بْنِ عَبَّاسٍ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ مَنْ لَزِمَ الاِسْتِغْفَارَ جَعَلَ اللَّهُ لَهُ مِنْ كُلِّ هَمٍّ فَرَجًا وَمِنْ كُلِّ ضِيقٍ مَخْرَجًا وَرَزَقَهُ مِنْ حَيْثُ لاَ يَحْتَسِبُ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "57.00",
            "hadithNumber": "3820",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "57",
                    "chapterTitle": "Seeking Forgiveness",
                    "urn": 1259650,
                    "body": "<p>It was narrated from 'Aishah that :\nthe Prophet (saas) used to say: \"Allahum-maj'alni minal-ladhina idha ahsanu istabsharu, wa idha asa'u istaghfaru (O Allah, make me one of those who, if they do good deeds, they rejoice, and if they do bad deeds, they seek forgiveness).\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "57",
                    "chapterTitle": "باب الاِسْتِغْفَارِ",
                    "urn": 1339510,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا يَزِيدُ بْنُ هَارُونَ، عَنْ حَمَّادِ بْنِ سَلَمَةَ، عَنْ عَلَىِّ بْنِ زَيْدٍ، عَنْ أَبِي عُثْمَانَ، عَنْ عَائِشَةَ، أَنَّ النَّبِيَّ ـ صلى الله عليه وسلم ـ كَانَ يَقُولُ ‏\"‏ اللَّهُمَّ اجْعَلْنِي مِنَ الَّذِينَ إِذَا أَحْسَنُوا اسْتَبْشَرُوا وَإِذَا أَسَاءُوا اسْتَغْفَرُوا ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "58.00",
            "hadithNumber": "3821",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "58",
                    "chapterTitle": "The Virtue of Good Deeds",
                    "urn": 1259660,
                    "body": "<p>It was narrated from Abu Dharr that :\nthe Messenger of Allah (saas) said: \"Allah, the Blessed and Exalted, said: 'Whoever does one good deed will have (the reward of) ten like it and more, and whoever does a bad deed will have one like it, or I will forgive him. Whoever draws near to Me a hand span, I draw near to him an arm's length; whoever comes to Me a forearm's length, I draw near him an arm's length; whoever comes to Me walking, I come to him in a hurry. Whoever meets Me with an earthful of sins, but does not associate anything in worship with Me, I will meet it (i.e., his sins) with forgiveness equal to that.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "58",
                    "chapterTitle": "باب فَضْلِ الْعَمَلِ",
                    "urn": 1339520,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنِ الْمَعْرُورِ بْنِ سُوَيْدٍ، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يَقُولُ اللَّهُ تَبَارَكَ وَتَعَالَى مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا وَأَزِيدُ وَمَنْ جَاءَ بِالسَّيِّئَةِ فَجَزَاءُ سَيِّئَةٍ مِثْلُهَا أَوْ أَغْفِرُ وَمَنْ تَقَرَّبَ مِنِّي شِبْرًا تَقَرَّبْتُ مِنْهُ ذِرَاعًا وَمَنْ تَقَرَّبَ مِنِّي ذِرَاعًا تَقَرَّبْتُ مِنْهُ بَاعًا وَمَنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً وَمَنْ لَقِيَنِي بِقِرَابِ الأَرْضِ خَطِيئَةً ثُمَّ لاَ يُشْرِكُ بِي شَيْئًا لَقِيتُهُ بِمِثْلِهَا مَغْفِرَةً ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "58.00",
            "hadithNumber": "3822",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "58",
                    "chapterTitle": "The Virtue of Good Deeds",
                    "urn": 1259670,
                    "body": "<p>It was narrated from Abu Hurairah that :\nthe Messenger of Allah (saas) said: \"Allah says, 'I am as My slave thinks I am, and I am with him when he mentions Me. If he makes mention of Me to himself, I make mention of him to Myself; and if he makes mention of Me in an assembly, I make mention of him in an assembly better than it. And if he draws to Me a hand-span length, I draw near to him a forearm's length. And if he comes to Me walking, I go to him in a hurry.\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "58",
                    "chapterTitle": "باب فَضْلِ الْعَمَلِ",
                    "urn": 1339530,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، وَعَلِيُّ بْنُ مُحَمَّدٍ، قَالاَ حَدَّثَنَا أَبُو مُعَاوِيَةَ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ يَقُولُ اللَّهُ سُبْحَانَهُ أَنَا عِنْدَ ظَنِّ عَبْدِي بِي وَأَنَا مَعَهُ حِينَ يَذْكُرُنِي فَإِنْ ذَكَرَنِي فِي نَفْسِهِ ذَكَرْتُهُ فِي نَفْسِي وَإِنْ ذَكَرَنِي فِي مَلإٍ ذَكَرْتُهُ فِي مَلإٍ خَيْرٍ مِنْهُمْ وَإِنِ اقْتَرَبَ إِلَىَّ شِبْرًا اقْتَرَبْتُ إِلَيْهِ ذِرَاعًا وَإِنْ أَتَانِي يَمْشِي أَتَيْتُهُ هَرْوَلَةً ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "58.00",
            "hadithNumber": "3823",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "58",
                    "chapterTitle": "The Virtue of Good Deeds",
                    "urn": 1259680,
                    "body": "<p>It was narrated from Abu Hurairah that the Messenger :\nof Allah (saas) said: \"Every deed of the son of Adam will be multiplied for him, between ten and seven hundred times for each merit. Allah said: 'Except for fasting, for it is for Me and I shall reward for it.'\" (sahih)</p>",
                    "grades": []
                },
                {
                    "lang": "ar",
                    "chapterNumber": "58",
                    "chapterTitle": "باب فَضْلِ الْعَمَلِ",
                    "urn": 1339540,
                    "body": "<p>حَدَّثَنَا أَبُو بَكْرِ بْنُ أَبِي شَيْبَةَ، حَدَّثَنَا أَبُو مُعَاوِيَةَ، وَوَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ أَبِي صَالِحٍ، عَنْ أَبِي هُرَيْرَةَ، قَالَ قَالَ رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ لَهُ الْحَسَنَةُ بِعَشْرِ أَمْثَالِهَا إِلَى سَبْعِمِائَةِ ضِعْفٍ ‏.‏ قَالَ اللَّهُ سُبْحَانَهُ إِلاَّ الصَّوْمَ فَإِنَّهُ لِي وَأَنَا أَجْزِي بِهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "59.00",
            "hadithNumber": "3824",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "59",
                    "chapterTitle": "What Was Narrated Concerning \"There Is No Power Nor Strength Except With Allah\"",
                    "urn": 1259690,
                    "body": "<p>It was narrated that Abu Musa said:\n\"The Prophet (saas) heard me saying: 'La hawla wa la quwwata illa billah (there is no power and no strength except with Allah).' He said: 'O 'Abdullah bin Qais! Shall I not tell you of a word which is one of the treasures of Paradise?' I said: 'Yes, O Messenger of Allah.' He said: 'Say: La hawla wa la quwwata illa billah (There is no power and no strength except with Allah).'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "59",
                    "chapterTitle": "باب مَا جَاءَ فِي ‏\"‏ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
                    "urn": 1339550,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ الصَّبَّاحِ، أَنْبَأَنَا جَرِيرٌ، عَنْ عَاصِمٍ الأَحْوَلِ، عَنْ أَبِي عُثْمَانَ، عَنْ أَبِي مُوسَى، قَالَ سَمِعَنِي النَّبِيُّ ـ صلى الله عليه وسلم ـ وَأَنَا أَقُولُ، لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏.‏ قَالَ ‏\"‏ يَا عَبْدَ اللَّهِ بْنَ قَيْسٍ أَلاَ أَدُلُّكَ عَلَى كَلِمَةٍ مِنْ كُنُوزِ الْجَنَّةِ ‏\"‏ ‏.‏ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ قُلْ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "59.00",
            "hadithNumber": "3825",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "59",
                    "chapterTitle": "What Was Narrated Concerning \"There Is No Power Nor Strength Except With Allah\"",
                    "urn": 1259700,
                    "body": "<p>It was narrated that Abu Dharr said:\n\"The Messenger of Allah (saas) said to me: \"Shall I not tell you of a treasure which is one of the treasures of Paradise?' I said: 'Yes, O Messenger of Allah.' He said: 'La hawla wa la quwwata illa billah (There is no power and no strength except with Allah).'\" (sahih)</p>",
                    "grades": []
                },
                {
                    "lang": "ar",
                    "chapterNumber": "59",
                    "chapterTitle": "باب مَا جَاءَ فِي ‏\"‏ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
                    "urn": 1339560,
                    "body": "<p>حَدَّثَنَا عَلِيُّ بْنُ مُحَمَّدٍ، حَدَّثَنَا وَكِيعٌ، عَنِ الأَعْمَشِ، عَنْ مُجَاهِدٍ، عَنْ عَبْدِ الرَّحْمَنِ بْنِ أَبِي لَيْلَى، عَنْ أَبِي ذَرٍّ، قَالَ قَالَ لِي رَسُولُ اللَّهِ ـ صلى الله عليه وسلم ـ ‏\"‏ أَلاَ أَدُلُّكَ عَلَى كَنْزٍ مِنْ كُنُوزِ الْجَنَّةِ ‏\"‏ ‏.‏ قُلْتُ بَلَى يَا رَسُولَ اللَّهِ ‏.‏ قَالَ ‏\"‏ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        },
        {
            "collection": "ibnmajah",
            "bookNumber": "33",
            "chapterId": "59.00",
            "hadithNumber": "3826",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "59",
                    "chapterTitle": "What Was Narrated Concerning \"There Is No Power Nor Strength Except With Allah\"",
                    "urn": 1259710,
                    "body": "<p>It was narrated that Hazim bin Harmalah said:\n\"I passed by the Prophet (saas) and he said to me: 'O Hazim, say often: \"La hawla wa la quwwata illa billah (there is no power and no strength except with Allah),\" for it is one of the treasures of Paradise.'\"</p>",
                    "grades": [
                        {
                            "graded_by": "Darussalam",
                            "grade": "Hasan"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "59",
                    "chapterTitle": "باب مَا جَاءَ فِي ‏\"‏ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ",
                    "urn": 1339570,
                    "body": "<p>حَدَّثَنَا يَعْقُوبُ بْنُ حُمَيْدٍ الْمَدَنِيُّ، حَدَّثَنَا مُحَمَّدُ بْنُ مَعْنٍ، حَدَّثَنَا خَالِدُ بْنُ سَعِيدٍ، عَنْ أَبِي زَيْنَبَ، مَوْلَى حَازِمِ بْنِ حَرْمَلَةَ عَنْ حَازِمِ بْنِ حَرْمَلَةَ، قَالَ مَرَرْتُ بِالنَّبِيِّ ـ صلى الله عليه وسلم ـ فَقَالَ لِي ‏\"‏ يَا حَازِمُ أَكْثِرْ مِنْ قَوْلِ لاَ حَوْلَ وَلاَ قُوَّةَ إِلاَّ بِاللَّهِ فَإِنَّهَا مِنْ كُنُوزِ الْجَنَّةِ ‏\"‏ ‏.‏</p>",
                    "grades": []
                }
            ]
        }
    ],
    "total": 170,
    "limit": 100,
    "previous": null,
    "next": 2
}