{
    "data": [
        {
            "collection": "bukhari",
            "bookNumber": "38",
            "chapterId": "1.00",
            "hadithNumber": "2287",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "1",
                    "chapterTitle": "Al-Hawala (the transference of a debt from one person to another)",
                    "urn": 21480,
                    "body": "<p>\nNarrated Abu Huraira:\n</p>\n<p>The Prophet (ﷺ) said, \"Procrastination (delay) in paying debts by a wealthy man is injustice. So, if your \ndebt is transferred from your debtor to a rich debtor, you should agree.\"</p>",
                    "grades": [
                        {
                            "graded_by": null,
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "1",
                    "chapterTitle": "باب فِي الْحَوَالَةِ، وَهَلْ يَرْجِعُ فِي الْحَوَالَةِ",
                    "urn": 122070,
                    "body": "<p>حَدَّثَنَا عَبْدُ اللَّهِ بْنُ يُوسُفَ، أَخْبَرَنَا مَالِكٌ، عَنْ أَبِي الزِّنَادِ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ أَنَّ رَسُولَ اللَّهِ صلى الله عليه وسلم قَالَ ‏\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ، فَإِذَا أُتْبِعَ أَحَدُكُمْ عَلَى مَلِيٍّ فَلْيَتْبَعْ ‏\"‏‏.‏</p>",
                    "grades": [
                        {
                            "graded_by": "",
                            "grade": "صحيح"
                        }
                    ]
                }
            ]
        },
        {
            "collection": "bukhari",
            "bookNumber": "38",
            "chapterId": "2.00",
            "hadithNumber": "2288",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "2",
                    "chapterTitle": "If somebody's debt are transferred to a rich debtor",
                    "urn": 21490,
                    "body": "<p>\nNarrated Abu Huraira:\n</p>\n<p>The Prophet (ﷺ) said, \"Procrastination (delay) in paying debts by a wealthy person is injustice. So, if your \ndebt is transferred from your debtor to a rich debtor, you should agree.\"</p>",
                    "grades": [
                        {
                            "graded_by": null,
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "2",
                    "chapterTitle": "باب إِذَا أَحَالَ عَلَى مَلِيٍّ فَلَيْسَ لَهُ رَدٌّ",
                    "urn": 122080,
                    "body": "<p>حَدَّثَنَا مُحَمَّدُ بْنُ يُوسُفَ، حَدَّثَنَا سُفْيَانُ، عَنِ ابْنِ ذَكْوَانَ، عَنِ الأَعْرَجِ، عَنْ أَبِي هُرَيْرَةَ ـ رضى الله عنه ـ عَنِ النَّبِيِّ صلى الله عليه وسلم قَالَ ‏\"‏ مَطْلُ الْغَنِيِّ ظُلْمٌ، وَمَنْ أُتْبِعَ عَلَى مَلِيٍّ فَلْيَتَّبِعْ ‏\"‏‏.‏</p>",
                    "grades": [
                        {
                            "graded_by": "",
                            "grade": "صحيح"
                        }
                    ]
                }
            ]
        },
        {
            "collection": "bukhari",
            "bookNumber": "38",
            "chapterId": "3.00",
            "hadithNumber": "2289",
            "hadith": [
                {
                    "lang": "en",
                    "chapterNumber": "3",
                    "chapterTitle": "If the debts due on a dead person are transferred to somebody, the transference is legal",
                    "urn": 21500,
                    "body": "<p>\n Narrated Salama bin Al-Akwa:\n</p>\n<p>\n Once, while we were sitting in the company of Prophet, a dead man was \n brought. The Prophet (ﷺ) was requested to lead the funeral prayer for the \n deceased. He said, \"Is he in debt?\" The people replied in the \n negative. He said, \"Has he left any wealth?\" They said, \"No.\" So, he \n led his funeral prayer. Another dead man was brought and the people \n said, \"O Allah's Messenger! Lead his funeral prayer.\" The Prophet (ﷺ) said, \n \"Is he in debt?\" They said, \"Yes.\" He said, \"Has he left any wealth?\" \n They said, ''Three Dinars.\" So, he led the prayer. Then a third dead \n man was brought and the people said (to the Prophet (ﷺ) ), Please lead his\n funeral prayer.\" He said, \"Has he left any wealth?\" They said, \"No.\" \n He asked, \"Is he in debt?\" They said, (\"Yes! He has to pay) three \n Diners.', He (refused to pray and) said, \"Then pray for your (dead) \n companion.\" Abu Qatada said, \"O Allah's Messenger! Lead his funeral \n prayer, and I will pay his debt.\" So, he led the prayer.\n</p>",
                    "grades": [
                        {
                            "graded_by": null,
                            "grade": "Sahih"
                        }
                    ]
                },
                {
                    "lang": "ar",
                    "chapterNumber": "3",
                    "chapterTitle": "باب إِنْ أَحَالَ دَيْنَ الْمَيِّتِ عَلَى رَجُلٍ جَازَ",
                    "urn": 122090,
                    "body": "<p>حَدَّثَنَا الْمَكِّيُّ بْنُ إِبْرَاهِيمَ، حَدَّثَنَا يَزِيدُ بْنُ أَبِي عُبَيْدٍ، عَنْ سَلَمَةَ بْنِ الأَكْوَعِ ـ رضى الله عنه ـ قَالَ كُنَّا جُلُوسًا عِنْدَ النَّبِيِّ صلى الله عليه وسلم إِذْ أُتِيَ بِجَنَازَةٍ، فَقَالُوا صَلِّ عَلَيْهَا‏.‏ فَقَالَ ‏\"‏ هَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ فَصَلَّى عَلَيْهِ ثُمَّ أُتِيَ بِجَنَازَةٍ أُخْرَى، فَقَالُوا يَا رَسُولَ اللَّهِ، صَلِّ عَلَيْهَا‏.‏ قَالَ ‏\"‏ هَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قِيلَ نَعَمْ‏.‏ قَالَ ‏\"‏ فَهَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا ثَلاَثَةَ دَنَانِيرَ‏.‏ فَصَلَّى عَلَيْهَا، ثُمَّ أُتِيَ بِالثَّالِثَةِ، فَقَالُوا صَلِّ عَلَيْهَا‏.‏ قَالَ ‏\"‏ هَلْ تَرَكَ شَيْئًا ‏\"‏‏.‏ قَالُوا لاَ‏.‏ قَالَ ‏\"‏ فَهَلْ عَلَيْهِ دَيْنٌ ‏\"‏‏.‏ قَالُوا ثَلاَثَةُ دَنَانِيرَ‏.‏ قَالَ ‏\"‏ صَلُّوا عَلَى صَاحِبِكُمْ ‏\"‏‏.‏ قَالَ أَبُو قَتَادَةَ صَلِّ عَلَيْهِ يَا رَسُولَ اللَّهِ، وَعَلَىَّ دَيْنُهُ‏.‏ فَصَلَّى عَلَيْهِ‏.‏</p>",
                    "grades": [
                        {
                            "graded_by": "",
                            "grade": "صحيح"
                        }
                    ]
                }
            ]
        }
    ],
    "total": 3,
    "limit": 100,
    "previous": null,
    "next": null
}